[Killed] BlockStatement
src/app/calc/calculator.component.ts:16:20
 
   constructor() {}
 
-  ngOnInit(): void {
-    this.myForm = new FormGroup({
-      zahl1: new FormControl(''),
-      zahl2: new FormControl('')
-    });
-  }
+  ngOnInit(): void {}
 
   submitForm() {
killedBy: CalculatorComponent should calc summe
statusReason: Expected undefined to equal ''.

[Killed] StringLiteral
src/app/calc/calculator.component.ts:19:30
   ngOnInit(): void {
     this.myForm = new FormGroup({
       zahl1: new FormControl(''),
-      zahl2: new FormControl('')
+      zahl2: new FormControl("Stryker was here!")
     });
   }
killedBy: CalculatorComponent should calc summe
statusReason: Expected 'Stryker was here!' to equal ''.

[Killed] BlockStatement
src/app/calc/calculator.component.ts:23:16
     });
   }
 
-  submitForm() {
-    let zahl1 = Number(this.myForm?.get('zahl1')?.value);
-    let zahl2 = Number(this.myForm?.get('zahl2')?.value);
-    this.summe = zahl2 * zahl1;
-    this.produkt = zahl2 * zahl1;
-  }
+  submitForm() {}
 }
 
killedBy: CalculatorComponent should calc summe
statusReason: Expected '' to contain '4'.

[Survived] ArithmeticOperator
src/app/calc/calculator.component.ts:26:18
   submitForm() {
     let zahl1 = Number(this.myForm?.get('zahl1')?.value);
     let zahl2 = Number(this.myForm?.get('zahl2')?.value);
-    this.summe = zahl2 * zahl1;
+    this.summe = zahl2 / zahl1;
     this.produkt = zahl2 * zahl1;
   }

[Killed] ArithmeticOperator
src/app/calc/calculator.component.ts:27:20
     let zahl1 = Number(this.myForm?.get('zahl1')?.value);
     let zahl2 = Number(this.myForm?.get('zahl2')?.value);
     this.summe = zahl2 * zahl1;
-    this.produkt = zahl2 * zahl1;
+    this.produkt = zahl2 / zahl1;
   }
 }
killedBy: CalculatorComponent should calc summe
statusReason: Expected '1' to contain '4'.
