[Killed] StringLiteral
app/admin/book-edit/book-form.component.ts:31:16
   @Input() aBook: BookEntity | undefined | null;
   @Input() isNew!: boolean;
   @Input() saved!: boolean | null;
-  successMsg = 'Book has been saved successfully';
+  successMsg = "";
   editForm!: FormGroup;
   @Output() saveBookEventEmitter = new EventEmitter();
killedBy: BookFormsComponent with existing book where AsyncValidatorFn is not used,  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given to ngOnChanges
statusReason: Expected '' to contain 'Book has been saved successfully'.
