[Killed] BlockStatement
app/admin/book-edit/book-edit.component.ts:29:16
 
   constructor(private store: Store) {}
 
-  closeError() {
-    this.store.dispatch(resetErrorsAction());
-  }
+  closeError() {}
   saveBook(book: BookEntity) {
     this.store.dispatch(upsertBookEntity({ bookEntity: book }));
killedBy: BookEditComponent should dispatch resetErrorsAction on closeError-event 
statusReason: Expected $.type = '@ngrx/store/init' to equal '[BookEntity/API] Error reset'.

[Killed] BlockStatement
app/admin/book-edit/book-edit.component.ts:32:30
   closeError() {
     this.store.dispatch(resetErrorsAction());
   }
-  saveBook(book: BookEntity) {
-    this.store.dispatch(upsertBookEntity({ bookEntity: book }));
-  }
+  saveBook(book: BookEntity) {}
 }
 
killedBy: BookEditComponent .saveBook should create, set "component.saved" to true in order to show/not show successmessage 
statusReason: Expected object to have properties
    bookEntity: Object({ isbn: '1234567890', title: 'Title 0', description: 'Description 0', rating: 1, published: Date(Sat Feb 02 2002 01:00:00 GMT+0100 (Central European Standard Time)), authors: [ 'author1' ] })
