[Killed] BlockStatement
app/shared/success-alert/success-alert.component.ts:13:45
 export class SuccessAlertComponent {
   _saved!: boolean | null;
   @Input() successMsg!: string;
-  @Input() set saved(value: boolean | null) {
-    this._saved = value;
-    if (this._saved) {
-      setTimeout(() => {
-        this.store.dispatch(resetSavedSuccessFlag());
-      }, 5000);
-    }
-  }
+  @Input() set saved(value: boolean | null) {}
   get saved(): boolean | null {
     return this._saved;
killedBy: SuccessAlertComponent should fire a resetSavedSuccessFlag action after 5 sec
statusReason: TypeError: Cannot read properties of null (reading 'nativeElement')

[Killed] BlockStatement
app/shared/success-alert/success-alert.component.ts:15:22
   @Input() successMsg!: string;
   @Input() set saved(value: boolean | null) {
     this._saved = value;
-    if (this._saved) {
-      setTimeout(() => {
-        this.store.dispatch(resetSavedSuccessFlag());
-      }, 5000);
-    }
+    if (this._saved) {}
   }
   get saved(): boolean | null {
killedBy: SuccessAlertComponent should fire a resetSavedSuccessFlag action after 5 sec
statusReason: Expected spy dispatch to have been called once. It was called 0 times.
