[Killed] StringLiteral
app/admin/book-edit/book-form.component.ts:31:16
   @Input() aBook: BookEntity | undefined | null;
   @Input() isNew!: boolean;
   @Input() saved!: boolean;
-  successMsg = 'Book has been saved successfully';
+  successMsg = "";
   editForm!: FormGroup;
   @Output() saveBookEventEmitter = new EventEmitter();
killedBy: BookFormsComponent with existing book where AsyncValidatorFn is not used,  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given to ngOnChanges
statusReason: Expected '' to contain 'Book has been saved successfully'.

[Killed] BlockStatement
app/admin/book-edit/book-form.component.ts:39:20
     private bodosValidatorService: BodosValidatorService
   ) {}
 
-  ngOnInit(): void {
-    this.checkEditForm();
-    if (this.isNew) {
-      this.fillEmptyBook();
-    } else if (this.aBook) {
-      this.fillForm(this.aBook);
-    }
-  }
+  ngOnInit(): void {}
 
   private createIsbnControl() {
killedBy: BookFormsComponent with existing book where AsyncValidatorFn is not used,  should not call fillForm if  ngOnChanges has no book or if changes are null alltogether ; BookFormsComponent with new book and AsyncValidatorFn or the checkAuthors validator  returns an error  should create; BookFormsComponent with new book and isbnLength validator  returns an error  should create the edit form, which should not be valid
statusReason: Error: NG01052: formGroup expects a FormGroup instance. Please pass one in.

      Example:

      
  <div [formGroup]="myGroup">
    <input formControlName="firstName">
  </div>

[Killed] ConditionalExpression
app/admin/book-edit/book-form.component.ts:41:9
 
   ngOnInit(): void {
     this.checkEditForm();
-    if (this.isNew) {
+    if (false) {
       this.fillEmptyBook();
     } else if (this.aBook) {
killedBy: BookFormsComponent with new book and AsyncValidatorFn or the checkAuthors validator  returns an error  should create the edit form, which should not be valid; BookFormsComponent with new book and isbnLength validator  returns an error  should create the edit form, which should not be valid; BookFormsComponent with new book and AsyncValidatorFn that returns no errors should call bookFormSaveBook method, when button is clicked, and emit Event if Form is  valid
statusReason: Expected object to have properties
    authors: [ '' ]
    thumbnails: [ Object({ title: '', url: '' }) ]

[Killed] BlockStatement
app/admin/book-edit/book-form.component.ts:41:21
 
   ngOnInit(): void {
     this.checkEditForm();
-    if (this.isNew) {
-      this.fillEmptyBook();
-    } else if (this.aBook) {
+    if (this.isNew) {} else if (this.aBook) {
       this.fillForm(this.aBook);
     }
killedBy: BookFormsComponent with new book and AsyncValidatorFn or the checkAuthors validator  returns an error  should create the edit form, which should not be valid; BookFormsComponent with new book and isbnLength validator  returns an error  should create the edit form, which should not be valid; BookFormsComponent with new book and AsyncValidatorFn that returns no errors should call bookFormSaveBook method, when button is clicked, and emit Event if Form is  valid
statusReason: Expected object to have properties
    authors: [ '' ]
    thumbnails: [ Object({ title: '', url: '' }) ]

[Killed] BlockStatement
app/admin/book-edit/book-form.component.ts:48:31
     }
   }
 
-  private createIsbnControl() {
-    if (this.isNew) {
-      return new FormControl('', {
-        validators: [this.bodosValidatorService.checkIsbn],
-        asyncValidators: [this.bodosValidatorService.asyncIsbnExistsValidator()]
-      });
-    } else {
-      return new FormControl(null, [
-        Validators.required,
-        this.bodosValidatorService.checkIsbn
-      ]);
-    }
-  }
+  private createIsbnControl() {}
 
   private checkEditForm() {
killedBy: BookFormsComponent with existing book where AsyncValidatorFn is not used,  should disable the SAVE button, and show the error if ISBN is invalid or if there are no authors; BookFormsComponent with new book and AsyncValidatorFn or the checkAuthors validator  returns an error  should create the edit form, which should not be valid; BookFormsComponent with new book and isbnLength validator  returns an error  should create the edit form, which should not be valid
statusReason: Expected spy unknown to have been called.

[Killed] ConditionalExpression
app/admin/book-edit/book-form.component.ts:49:9
   }
 
   private createIsbnControl() {
-    if (this.isNew) {
+    if (true) {
       return new FormControl('', {
         validators: [this.bodosValidatorService.checkIsbn],
killedBy: BookFormsComponent with existing book where AsyncValidatorFn is not used,  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given to ngOnChanges
statusReason: Expected false to be true.

[Killed] ConditionalExpression
app/admin/book-edit/book-form.component.ts:49:9
   }
 
   private createIsbnControl() {
-    if (this.isNew) {
+    if (false) {
       return new FormControl('', {
         validators: [this.bodosValidatorService.checkIsbn],
killedBy: BookFormsComponent with new book and AsyncValidatorFn or the checkAuthors validator  returns an error  should create the edit form, which should not be valid; BookFormsComponent with new book and isbnLength validator  returns an error  should create the edit form, which should not be valid
statusReason: Expected $.isbn = null to equal ''.

[Killed] ArrayDeclaration
app/admin/book-edit/book-form.component.ts:52:26
     if (this.isNew) {
       return new FormControl('', {
         validators: [this.bodosValidatorService.checkIsbn],
-        asyncValidators: [this.bodosValidatorService.asyncIsbnExistsValidator()]
+        asyncValidators: []
       });
     } else {
killedBy: BookFormsComponent with new book and AsyncValidatorFn or the checkAuthors validator  returns an error  should not be valid, if BodosValidatorService.asyncIsbnExistsValidator or checkAuthors finds an e
statusReason: Expected true to be false.

[Killed] BlockStatement
app/admin/book-edit/book-form.component.ts:62:27
     }
   }
 
-  private checkEditForm() {
-    let isbnControl = this.createIsbnControl();
-    this.editForm = this.fb.group({
-      title: ['', Validators.required],
-      subtitle: '',
-      isbn: isbnControl,
-      published: [
-        new Date().toISOString().substring(0, 10),
-        Validators.required
-      ],
-      description: '',
-      rating: [null, [Validators.min(0), Validators.max(5)]]
-    });
-  }
+  private checkEditForm() {}
 
   ngOnChanges(changes: SimpleChanges) {
killedBy: BookFormsComponent with existing book where AsyncValidatorFn is not used,  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given to ngOnChanges; BookFormsComponent with new book and AsyncValidatorFn or the checkAuthors validator  returns an error  should create; BookFormsComponent with new book and isbnLength validator  returns an error  should create the edit form, which should not be valid
statusReason: TypeError: Cannot read properties of undefined (reading 'get')

[Killed] StringLiteral
app/admin/book-edit/book-form.component.ts:65:15
   private checkEditForm() {
     let isbnControl = this.createIsbnControl();
     this.editForm = this.fb.group({
-      title: ['', Validators.required],
+      title: ["Stryker was here!", Validators.required],
       subtitle: '',
       isbn: isbnControl,
killedBy: BookFormsComponent with new book and AsyncValidatorFn or the checkAuthors validator  returns an error  should create the edit form, which should not be valid; BookFormsComponent with new book and isbnLength validator  returns an error  should create the edit form, which should not be valid
statusReason: Expected $.title = 'Stryker was here!' to equal ''.

[Killed] MethodExpression
app/admin/book-edit/book-form.component.ts:69:9
       subtitle: '',
       isbn: isbnControl,
       published: [
-        new Date().toISOString().substring(0, 10),
+        new Date().toISOString(),
         Validators.required
       ],
killedBy: BookFormsComponent with new book and AsyncValidatorFn or the checkAuthors validator  returns an error  should create the edit form, which should not be valid; BookFormsComponent with new book and isbnLength validator  returns an error  should create the edit form, which should not be valid
statusReason: Expected '2022-10-19T12:42:13.350Z' to equal '2022-10-19'.

[Killed] BlockStatement
app/admin/book-edit/book-form.component.ts:77:39
     });
   }
 
-  ngOnChanges(changes: SimpleChanges) {
-    this.checkEditForm();
-    const { aBook } = changes;
-    if (!!aBook && aBook.currentValue && !this.isNew) {
-      this.fillForm(aBook.currentValue);
-    }
-  }
+  ngOnChanges(changes: SimpleChanges) {}
 
   private fillEmptyBook() {
killedBy: BookFormsComponent with existing book where AsyncValidatorFn is not used,  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given to ngOnChanges
statusReason: Expected '2022-10-19' to equal '2022-02-02'.

[Killed] BooleanLiteral
app/admin/book-edit/book-form.component.ts:80:42
   ngOnChanges(changes: SimpleChanges) {
     this.checkEditForm();
     const { aBook } = changes;
-    if (!!aBook && aBook.currentValue && !this.isNew) {
+    if (!!aBook && aBook.currentValue && this.isNew) {
       this.fillForm(aBook.currentValue);
     }
killedBy: BookFormsComponent with existing book where AsyncValidatorFn is not used,  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given to ngOnChanges
statusReason: Expected '2022-10-19' to equal '2022-02-02'.

[Killed] BlockStatement
app/admin/book-edit/book-form.component.ts:80:55
   ngOnChanges(changes: SimpleChanges) {
     this.checkEditForm();
     const { aBook } = changes;
-    if (!!aBook && aBook.currentValue && !this.isNew) {
-      this.fillForm(aBook.currentValue);
-    }
+    if (!!aBook && aBook.currentValue && !this.isNew) {}
   }
 
killedBy: BookFormsComponent with existing book where AsyncValidatorFn is not used,  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given to ngOnChanges
statusReason: Expected '2022-10-19' to equal '2022-02-02'.

[Killed] StringLiteral
app/admin/book-edit/book-form.component.ts:103:23
   }
 
   fillForm(book: BookEntity) {
-    this.editForm.get('title')?.setValue(book.title);
+    this.editForm.get("")?.setValue(book.title);
     this.editForm.get('subtitle')?.setValue(book.subtitle);
     this.editForm.get('isbn')?.setValue(book.isbn + '');
killedBy: BookFormsComponent with existing book where AsyncValidatorFn is not used,  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given to ngOnChanges
statusReason: Expected false to be true.

[Killed] StringLiteral
app/admin/book-edit/book-form.component.ts:104:23
 
   fillForm(book: BookEntity) {
     this.editForm.get('title')?.setValue(book.title);
-    this.editForm.get('subtitle')?.setValue(book.subtitle);
+    this.editForm.get("")?.setValue(book.subtitle);
     this.editForm.get('isbn')?.setValue(book.isbn + '');
     this.editForm.get('description')?.setValue(book.description);
killedBy: BookFormsComponent with existing book where AsyncValidatorFn is not used,  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given to ngOnChanges
statusReason: Expected spy emit to have been called with:
  [ Object({ authors: [ 'author' ], isbn: '1234567890', published: Date(Wed Feb 02 2022 01:00:00 GMT+0100 (Central European Standard Time)), title: 'a title', subtitle: 'a subtitle', description: 'a description', rating: 3 }) ]
but actual calls were:
  [ Object({ title: 'a title', subtitle: '', isbn: '1234567890', published: Date(Wed Feb 02 2022 01:00:00

[Killed] StringLiteral
app/admin/book-edit/book-form.component.ts:105:23
   fillForm(book: BookEntity) {
     this.editForm.get('title')?.setValue(book.title);
     this.editForm.get('subtitle')?.setValue(book.subtitle);
-    this.editForm.get('isbn')?.setValue(book.isbn + '');
+    this.editForm.get("")?.setValue(book.isbn + '');
     this.editForm.get('description')?.setValue(book.description);
     const published: string = book.published.toISOString().substring(0, 10);
killedBy: BookFormsComponent with existing book where AsyncValidatorFn is not used,  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given to ngOnChanges
statusReason: Expected false to be true.

[Killed] MethodExpression
app/admin/book-edit/book-form.component.ts:107:31
     this.editForm.get('subtitle')?.setValue(book.subtitle);
     this.editForm.get('isbn')?.setValue(book.isbn + '');
     this.editForm.get('description')?.setValue(book.description);
-    const published: string = book.published.toISOString().substring(0, 10);
+    const published: string = book.published.toISOString();
 
     this.editForm.get('published')?.setValue(published);
killedBy: BookFormsComponent with existing book where AsyncValidatorFn is not used,  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given to ngOnChanges
statusReason: Expected '2022-02-02T00:00:00.000Z' to equal '2022-02-02'.

[Killed] StringLiteral
app/admin/book-edit/book-form.component.ts:117:30
       const fcAuthor = new FormControl(author);
       authors.push(fcAuthor);
     }
-    this.editForm.setControl('authors', authors);
+    this.editForm.setControl("", authors);
     if (book.thumbnails) {
       let thumbnails = this.fb.array([] as FormGroup[]);
killedBy: BookFormsComponent with existing book where AsyncValidatorFn is not used,  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given to ngOnChanges
statusReason: Expected spy emit to have been called with:
  [ Object({ authors: [ 'author' ], isbn: '1234567890', published: Date(Wed Feb 02 2022 01:00:00 GMT+0100 (Central European Standard Time)), title: 'a title', subtitle: 'a subtitle', description: 'a description', rating: 3 }) ]
but actual calls were:
  [ Object({ title: 'a title', subtitle: 'a subtitle', isbn: '1234567890', published: Date(Wed Feb 02 202

[Killed] StringLiteral
app/admin/book-edit/book-form.component.ts:135:30
     return this.editForm.get('authors') as FormArray;
   }
   get isbn() {
-    return this.editForm.get('isbn');
+    return this.editForm.get("");
   }
   get thumbnails() {
killedBy: BookFormsComponent with new book and AsyncValidatorFn or the checkAuthors validator  returns an error  should not be valid, if BodosValidatorService.asyncIsbnExistsValidator or checkAuthors finds an e
statusReason: Expected undefined to be true.

[Killed] BlockStatement
app/admin/book-edit/book-form.component.ts:141:22
     return this.editForm.get('thumbnails') as FormArray;
   }
 
-  bookFormSaveBook() {
-    if (this.editForm.valid) {
-      this.saveBookEventEmitter.emit(
-        BookFactoryService.getFromRaw(this.editForm.value)
-      );
-    } else {
-      throw new Error('bookFormSave called although form is not valid!');
-    }
-  }
+  bookFormSaveBook() {}
 
   addAuthor() {
killedBy: BookFormsComponent with existing book where AsyncValidatorFn is not used,  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given to ngOnChanges; BookFormsComponent with new book and AsyncValidatorFn or the checkAuthors validator  returns an error  should call bookFormSaveBook method, when button is clicked, but not emit Event if Form is not va; BookFormsComponent with new book and AsyncValidatorFn that returns no errors should call bookFormSaveBook method, when button is clicked, and emit Event if Form is  valid
statusReason: Expected spy emit to have been called with:
  [ Object({ authors: [ 'author' ], isbn: '1234567890', published: Date(Wed Feb 02 2022 01:00:00 GMT+0100 (Central European Standard Time)), title: 'a title', subtitle: 'a subtitle', description: 'a description', rating: 3 }) ]
but it was never called.

[Killed] BlockStatement
app/admin/book-edit/book-form.component.ts:142:30
   }
 
   bookFormSaveBook() {
-    if (this.editForm.valid) {
-      this.saveBookEventEmitter.emit(
-        BookFactoryService.getFromRaw(this.editForm.value)
-      );
-    } else {
+    if (this.editForm.valid) {} else {
       throw new Error('bookFormSave called although form is not valid!');
     }
killedBy: BookFormsComponent with existing book where AsyncValidatorFn is not used,  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given to ngOnChanges; BookFormsComponent with new book and AsyncValidatorFn that returns no errors should call bookFormSaveBook method, when button is clicked, and emit Event if Form is  valid
statusReason: Expected spy emit to have been called with:
  [ Object({ authors: [ 'author' ], isbn: '1234567890', published: Date(Wed Feb 02 2022 01:00:00 GMT+0100 (Central European Standard Time)), title: 'a title', subtitle: 'a subtitle', description: 'a description', rating: 3 }) ]
but it was never called.

[Killed] BlockStatement
app/admin/book-edit/book-form.component.ts:146:12
       this.saveBookEventEmitter.emit(
         BookFactoryService.getFromRaw(this.editForm.value)
       );
-    } else {
-      throw new Error('bookFormSave called although form is not valid!');
-    }
+    } else {}
   }
 
killedBy: BookFormsComponent with new book and AsyncValidatorFn or the checkAuthors validator  returns an error  should call bookFormSaveBook method, when button is clicked, but not emit Event if Form is not va
statusReason: Expected function to throw an Error.

[Killed] BlockStatement
app/admin/book-edit/book-form.component.ts:160:14
     this.authors.removeAt(i);
   }
 
-  addThumb() {
-    const thumbG = this.fb.group({});
-    this.thumbnails.push(thumbG);
-  }
+  addThumb() {}
 
   removeThumb(j: number) {
killedBy: BookFormsComponent with new book and AsyncValidatorFn that returns no errors should call addThumb method, when add Thumb is clicked, same with ThumbAuthor
statusReason: Expected 1 to equal 2.
