[Killed] BlockStatement
app/books/book-details/book-details.component.ts:34:42
 
   readonly confirmMessage = 'Really delete book?';
 
-  delete(isbn: string | undefined): void {
-    this.confirm(this.confirmMessage).subscribe((ok) => {
-      if (ok && !!isbn) {
-        this.reallyDelete(isbn);
-      }
-    });
-  }
+  delete(isbn: string | undefined): void {}
 
   reallyDelete(isbn: string): void {
killedBy: BookDetailsComponent and IsbnPipe  when click on delete, it should subscribe a to a confirmation window, and call this.book .deleteBook(isbn) if the confirmation is true, and navigate to "/books/list"
statusReason: Expected spy confirm to have been called only once, and with given args:
  [ 'Really delete book?' ]
But it was never called.


Error: Expected spy confirm to have been called only once, and with given args:
  [ 'Really delete book?' ]
But it was never called.

[Killed] BlockStatement
app/books/book-details/book-details.component.ts:35:57
   readonly confirmMessage = 'Really delete book?';
 
   delete(isbn: string | undefined): void {
-    this.confirm(this.confirmMessage).subscribe((ok) => {
-      if (ok && !!isbn) {
-        this.reallyDelete(isbn);
-      }
-    });
+    this.confirm(this.confirmMessage).subscribe((ok) => {});
   }
 
killedBy: BookDetailsComponent and IsbnPipe  when click on delete, it should subscribe a to a confirmation window, and call this.book .deleteBook(isbn) if the confirmation is true, and navigate to "/books/list"
statusReason: Expected spy dispatch to have been called only once, and with given args:
  [ Object({ id: '1234567890', type: '[BookEntity/API] Delete BookEntity' }) ]
But it was never called.


Error: Expected spy dispatch to have been called only once, and with given args:
  [ Object({ id: '1234567890', type: '[BookEntity/API] Delete BookEntity' }) ]
But it was never called.

[Killed] BlockStatement
app/books/book-details/book-details.component.ts:36:25
 
   delete(isbn: string | undefined): void {
     this.confirm(this.confirmMessage).subscribe((ok) => {
-      if (ok && !!isbn) {
-        this.reallyDelete(isbn);
-      }
+      if (ok && !!isbn) {}
     });
   }
killedBy: BookDetailsComponent and IsbnPipe  when click on delete, it should subscribe a to a confirmation window, and call this.book .deleteBook(isbn) if the confirmation is true, and navigate to "/books/list"
statusReason: Expected spy dispatch to have been called only once, and with given args:
  [ Object({ id: '1234567890', type: '[BookEntity/API] Delete BookEntity' }) ]
But it was never called.


Error: Expected spy dispatch to have been called only once, and with given args:
  [ Object({ id: '1234567890', type: '[BookEntity/API] Delete BookEntity' }) ]
But it was never called.

[Killed] BlockStatement
app/books/book-details/book-details.component.ts:42:36
     });
   }
 
-  reallyDelete(isbn: string): void {
-    this.store.dispatch(deleteBookEntity({ id: isbn }));
-    this.router.navigate(['/books/list']);
-  }
+  reallyDelete(isbn: string): void {}
 
   confirm(message?: string): Observable<boolean> {
killedBy: BookDetailsComponent and IsbnPipe  when click on delete, it should subscribe a to a confirmation window, and call this.book .deleteBook(isbn) if the confirmation is true, and navigate to "/books/list"
statusReason: Expected spy dispatch to have been called only once, and with given args:
  [ Object({ id: '1234567890', type: '[BookEntity/API] Delete BookEntity' }) ]
But it was never called.


Error: Expected spy dispatch to have been called only once, and with given args:
  [ Object({ id: '1234567890', type: '[BookEntity/API] Delete BookEntity' }) ]
But it was never called.

[Killed] StringLiteral
app/books/book-details/book-details.component.ts:44:27
 
   reallyDelete(isbn: string): void {
     this.store.dispatch(deleteBookEntity({ id: isbn }));
-    this.router.navigate(['/books/list']);
+    this.router.navigate([""]);
   }
 
killedBy: BookDetailsComponent and IsbnPipe  when click on delete, it should subscribe a to a confirmation window, and call this.book .deleteBook(isbn) if the confirmation is true, and navigate to "/books/list"
statusReason: Expected spy navigate to have been called only once, and with given args:
  [ [ '/books/list' ] ]
But the actual call was:
  [ [ '' ] ].
Expected $[0][0] = '' to equal '/books/list'.


Error: Expected spy navigate to have been called only once, and with given args:

[Killed] BlockStatement
app/books/book-details/book-details.component.ts:51:16
     const confirmation = window.confirm(message);
     return of(confirmation);
   }
-  closeError() {
-    this.store.dispatch(resetErrorsAction());
-  }
+  closeError() {}
 }
 
killedBy: BookDetailsComponent and IsbnPipe should show  http errors if any  and if clicked on close, the error message should disapear
statusReason: Expected spy dispatch to have been called only once, and with given args:
  [ Object({ type: '[BookEntity/API] Error reset' }) ]
But it was never called.


Error: Expected spy dispatch to have been called only once, and with given args:
  [ Object({ type: '[BookEntity/API] Error reset' }) ]
But it was never called.
