[Killed] BlockStatement
app/admin/create-book/create-book.component.ts:24:36
 
   constructor(private store: Store) {}
 
-  createBookSave(book: BookEntity) {
-    this.store.dispatch(addBookEntity({ bookEntity: book }));
-  }
+  createBookSave(book: BookEntity) {}
 
   closeError() {
killedBy: CreateBookComponent .createBookSave should create, set "component.saved" to true in order to show/not show successmessage 
statusReason: Expected object to have properties
    bookEntity: Object({ isbn: '1234567890', title: 'Title 0', description: 'Description 0', rating: 1, published: Date(Sat Feb 02 2002 01:00:00 GMT+0100 (Central European Standard Time)), authors: [ 'author1' ] })
