[Killed] ConditionalExpression
app/books/book-details/book-details2.guard.ts:32:9
   ): Observable<boolean | UrlTree> {
     let paramMap = route.paramMap;
     let isbn: string;
-    if (paramMap.get('isbn') === null)
+    if (false)
       return of(this.router.parseUrl('/error'));
     else isbn = paramMap.get('isbn') as string;
killedBy: BookDetailsGuard2 canActivate should return of(UrlTree(/error)) if there is no isbn number as a path parameter
statusReason: Expected $.length = 1 to equal 2.
Expected $[1] = undefined to equal Object({ frame: 0, notification: Object({ kind: 'C', value: undefined, error: undefined }) }).

[Killed] ConditionalExpression
app/books/book-details/book-details2.guard.ts:32:9
   ): Observable<boolean | UrlTree> {
     let paramMap = route.paramMap;
     let isbn: string;
-    if (paramMap.get('isbn') === null)
+    if (true)
       return of(this.router.parseUrl('/error'));
     else isbn = paramMap.get('isbn') as string;
killedBy: BookDetailsGuard2 canActivate should return of(UrlTree(/error)) if there is no isbn number as a path parameter
statusReason: Expected spy paramMap.get to have been called only once, and with given args:
  [ 'isbn' ]
But it was never called.


Error: Expected spy paramMap.get to have been called only once, and with given args:
  [ 'isbn' ]
But it was never called.

[Killed] ArrowFunction
app/books/book-details/book-details2.guard.ts:36:11
       return of(this.router.parseUrl('/error'));
     else isbn = paramMap.get('isbn') as string;
     return this.store.select(selectCurrentBookAndAll).pipe(
-      tap((data: curBookTS) => this.dispatchAction(data, isbn)),
+      tap(() => undefined),
       filter((data: curBookTS) => this.proceedRoute(data, isbn)),
       switchMap((data: curBookTS) => {
killedBy: BookDetailsGuard2 canActivate with NEW timestamp in the store,  but isbn param doesn't match that in the store.currentBook  and if there is ONE other book in the store with the requested ISBN,  should; BookDetailsGuard2 canActivate with old timestamp in the store should not return anything in the Observable yet but emit a dispatch(loadAllAndSetCurrentBook)if  there is no Book at all with the request
statusReason: Expected spy mockStore.dispatch to have been called only once, and with given args:
  [ Object({ currentBookId: '1234567890', type: '[BookEntity/API] Set Current Book Success' }) ]
But it was never called.


Error: Expected spy mockStore.dispatch to have been called only once, and with given args:
  [ Object({ currentBookId: '1234567890', type: '[BookEntity/API] Set Current Book Success' }) ]
But

[Killed] ConditionalExpression
app/books/book-details/book-details2.guard.ts:39:13
       tap((data: curBookTS) => this.dispatchAction(data, isbn)),
       filter((data: curBookTS) => this.proceedRoute(data, isbn)),
       switchMap((data: curBookTS) => {
-        if (data.currentBookId != isbn)
+        if (false)
           return of(this.router.parseUrl('/error'));
         return of(true);
killedBy: BookDetailsGuard2 canActivate with NEW timestamp in the store,  but isbn param doesn't match that in the store.currentBook  and if there is NO book in the store with the requested ISBN should  return 
statusReason: Expected $[0].notification.value = true to equal has-invalid-toString-method.

[Killed] ConditionalExpression
app/books/book-details/book-details2.guard.ts:39:13
       tap((data: curBookTS) => this.dispatchAction(data, isbn)),
       filter((data: curBookTS) => this.proceedRoute(data, isbn)),
       switchMap((data: curBookTS) => {
-        if (data.currentBookId != isbn)
+        if (true)
           return of(this.router.parseUrl('/error'));
         return of(true);
killedBy: BookDetailsGuard2 canActivate with NEW timestamp in the store, and isbn param matches that in the store, should return of(true) 
statusReason: Expected $[0].notification.value = has-invalid-toString-method to equal true.

[Killed] BooleanLiteral
app/books/book-details/book-details2.guard.ts:41:19
       switchMap((data: curBookTS) => {
         if (data.currentBookId != isbn)
           return of(this.router.parseUrl('/error'));
-        return of(true);
+        return of(false);
       })
     );
killedBy: BookDetailsGuard2 canActivate with NEW timestamp in the store, and isbn param matches that in the store, should return of(true) 
statusReason: Expected $[0].notification.value = false to equal true.

[Killed] BooleanLiteral
app/books/book-details/book-details2.guard.ts:46:45
     );
   }
   private proceedRoute(data: curBookTS, isbn: string): boolean {
-    if (data.currentBookId === isbn) return true;
+    if (data.currentBookId === isbn) return false;
     return (
       this.isNewTimeStamp(data) &&
killedBy: BookDetailsGuard2 canActivate with NEW timestamp in the store, and isbn param matches that in the store, should return of(true) 
statusReason: Expected $.length = 0 to equal 1.
Expected $[0] = undefined to equal Object({ frame: 0, notification: Object({ kind: 'N', value: true, error: undefined }) }).

[Killed] ConditionalExpression
app/books/book-details/book-details2.guard.ts:46:9
     );
   }
   private proceedRoute(data: curBookTS, isbn: string): boolean {
-    if (data.currentBookId === isbn) return true;
+    if (true) return true;
     return (
       this.isNewTimeStamp(data) &&
killedBy: BookDetailsGuard2 canActivate with NEW timestamp in the store,  but isbn param doesn't match that in the store.currentBook  and if there is ONE other book in the store with the requested ISBN,  should; BookDetailsGuard2 canActivate with old timestamp in the store should not return anything in the Observable yet but emit a dispatch(loadAllAndSetCurrentBook)if  there is no Book at all with the request
statusReason: Expected $.length = 1 to equal 0.
Unexpected $[0] = Object({ frame: 0, notification: Object({ kind: 'N', value: has-invalid-toString-method, error: undefined }) }) in array.

[Killed] LogicalOperator
app/books/book-details/book-details2.guard.ts:48:7
   private proceedRoute(data: curBookTS, isbn: string): boolean {
     if (data.currentBookId === isbn) return true;
     return (
-      this.isNewTimeStamp(data) &&
-      !data.allBooks.find((book) => book.isbn === isbn)
+      this.isNewTimeStamp(data) || !data.allBooks.find(book => book.isbn === isbn)
     );
   }
killedBy: BookDetailsGuard2 canActivate with NEW timestamp in the store,  but isbn param doesn't match that in the store.currentBook  and if there is ONE other book in the store with the requested ISBN,  should; BookDetailsGuard2 canActivate with old timestamp in the store should not return anything in the Observable yet but emit a dispatch(loadAllAndSetCurrentBook)if  there is no Book at all with the request
statusReason: Expected $.length = 1 to equal 0.
Unexpected $[0] = Object({ frame: 0, notification: Object({ kind: 'N', value: has-invalid-toString-method, error: undefined }) }) in array.

[Killed] ConditionalExpression
app/books/book-details/book-details2.guard.ts:48:7
   private proceedRoute(data: curBookTS, isbn: string): boolean {
     if (data.currentBookId === isbn) return true;
     return (
-      this.isNewTimeStamp(data) &&
-      !data.allBooks.find((book) => book.isbn === isbn)
+      true
     );
   }
killedBy: BookDetailsGuard2 canActivate with NEW timestamp in the store,  but isbn param doesn't match that in the store.currentBook  and if there is ONE other book in the store with the requested ISBN,  should; BookDetailsGuard2 canActivate with old timestamp in the store should not return anything in the Observable yet but emit a dispatch(loadAllAndSetCurrentBook)if  there is no Book at all with the request
statusReason: Expected $.length = 1 to equal 0.
Unexpected $[0] = Object({ frame: 0, notification: Object({ kind: 'N', value: has-invalid-toString-method, error: undefined }) }) in array.

[Killed] ArrowFunction
app/books/book-details/book-details2.guard.ts:49:27
     if (data.currentBookId === isbn) return true;
     return (
       this.isNewTimeStamp(data) &&
-      !data.allBooks.find((book) => book.isbn === isbn)
+      !data.allBooks.find(() => undefined)
     );
   }
killedBy: BookDetailsGuard2 canActivate with NEW timestamp in the store,  but isbn param doesn't match that in the store.currentBook  and if there is ONE other book in the store with the requested ISBN,  should
statusReason: Expected $.length = 1 to equal 0.
Unexpected $[0] = Object({ frame: 0, notification: Object({ kind: 'N', value: has-invalid-toString-method, error: undefined }) }) in array.

[Killed] ConditionalExpression
app/books/book-details/book-details2.guard.ts:49:37
     if (data.currentBookId === isbn) return true;
     return (
       this.isNewTimeStamp(data) &&
-      !data.allBooks.find((book) => book.isbn === isbn)
+      !data.allBooks.find((book) => true)
     );
   }
killedBy: BookDetailsGuard2 canActivate with NEW timestamp in the store,  but isbn param doesn't match that in the store.currentBook  and if there is NO book in the store with the requested ISBN should  return 
statusReason: Expected $.length = 0 to equal 1.
Expected $[0] = undefined to equal Object({ frame: 0, notification: Object({ kind: 'N', value: has-invalid-toString-method, error: undefined }) }).

[Killed] BlockStatement
app/books/book-details/book-details2.guard.ts:52:57
       !data.allBooks.find((book) => book.isbn === isbn)
     );
   }
-  private dispatchAction(data: curBookTS, isbn: string) {
-    if (this.isOldTimeStamp(data)) {
-      this.store.dispatch(loadAllAndSetCurrentBook({ isbn }));
-    }
-    if (
-      this.isNewTimeStamp(data) &&
-      data.currentBookId != isbn &&
-      data.allBooks.find((book) => book.isbn === isbn)
-    ) {
-      this.store.dispatch(setCurrentBookSuccess({ currentBookId: isbn }));
-    }
-    if (
-      this.isNewTimeStamp(data) &&
-      !data.allBooks.find((book) => book.isbn === isbn)
-    ) {
-      this.store.dispatch(
-        bookErrorAction({ message: 'isbn number not found' })
-      );
-    }
-  }
+  private dispatchAction(data: curBookTS, isbn: string) {}
   private isNewTimeStamp(data: curBookTS) {
     return !this.isOldTimeStamp(data);
killedBy: BookDetailsGuard2 canActivate with NEW timestamp in the store,  but isbn param doesn't match that in the store.currentBook  and if there is ONE other book in the store with the requested ISBN,  should; BookDetailsGuard2 canActivate with old timestamp in the store should not return anything in the Observable yet but emit a dispatch(loadAllAndSetCurrentBook)if  there is no Book at all with the request
statusReason: Expected spy mockStore.dispatch to have been called only once, and with given args:
  [ Object({ currentBookId: '1234567890', type: '[BookEntity/API] Set Current Book Success' }) ]
But it was never called.


Error: Expected spy mockStore.dispatch to have been called only once, and with given args:
  [ Object({ currentBookId: '1234567890', type: '[BookEntity/API] Set Current Book Success' }) ]
But

[Killed] BlockStatement
app/books/book-details/book-details2.guard.ts:53:36
     );
   }
   private dispatchAction(data: curBookTS, isbn: string) {
-    if (this.isOldTimeStamp(data)) {
-      this.store.dispatch(loadAllAndSetCurrentBook({ isbn }));
-    }
+    if (this.isOldTimeStamp(data)) {}
     if (
       this.isNewTimeStamp(data) &&
killedBy: BookDetailsGuard2 canActivate with old timestamp in the store should not return anything in the Observable yet but emit a dispatch(loadAllAndSetCurrentBook)if  there is no Book at all with the request
statusReason: Expected spy mockStore.dispatch to have been called only once, and with given args:
  [ Object({ isbn: 'differentIsbn', type: '[BookEntity/API] Load all and set Current Book' }) ]
But it was never called.


Error: Expected spy mockStore.dispatch to have been called only once, and with given args:
  [ Object({ isbn: 'differentIsbn', type: '[BookEntity/API] Load all and set Current Book' }) ]
But it

[Killed] ConditionalExpression
app/books/book-details/book-details2.guard.ts:53:9
     );
   }
   private dispatchAction(data: curBookTS, isbn: string) {
-    if (this.isOldTimeStamp(data)) {
+    if (true) {
       this.store.dispatch(loadAllAndSetCurrentBook({ isbn }));
     }
killedBy: BookDetailsGuard2 canActivate with NEW timestamp in the store, and isbn param matches that in the store, should return of(true) 
statusReason: Expected spy mockStore.dispatch not to have been called.

[Killed] ConditionalExpression
app/books/book-details/book-details2.guard.ts:57:7
       this.store.dispatch(loadAllAndSetCurrentBook({ isbn }));
     }
     if (
-      this.isNewTimeStamp(data) &&
-      data.currentBookId != isbn &&
-      data.allBooks.find((book) => book.isbn === isbn)
+      true
     ) {
       this.store.dispatch(setCurrentBookSuccess({ currentBookId: isbn }));
killedBy: BookDetailsGuard2 canActivate with NEW timestamp in the store, and isbn param matches that in the store, should return of(true) ; BookDetailsGuard2 canActivate with old timestamp in the store should not return anything in the Observable yet but emit a dispatch(loadAllAndSetCurrentBook)if  there is no Book at all with the request
statusReason: Expected spy mockStore.dispatch not to have been called.

[Killed] ConditionalExpression
app/books/book-details/book-details2.guard.ts:57:7
       this.store.dispatch(loadAllAndSetCurrentBook({ isbn }));
     }
     if (
-      this.isNewTimeStamp(data) &&
-      data.currentBookId != isbn &&
+      true &&
       data.allBooks.find((book) => book.isbn === isbn)
     ) {
killedBy: BookDetailsGuard2 canActivate with NEW timestamp in the store, and isbn param matches that in the store, should return of(true) ; BookDetailsGuard2 canActivate with old timestamp in the store should not return anything in the Observable yet  but  emit a dispatch(loadAllAndSetCurrentBook) even if there is already a currentBook wi
statusReason: Expected spy mockStore.dispatch not to have been called.

[Killed] ConditionalExpression
app/books/book-details/book-details2.guard.ts:58:7
     }
     if (
       this.isNewTimeStamp(data) &&
-      data.currentBookId != isbn &&
+      true &&
       data.allBooks.find((book) => book.isbn === isbn)
     ) {
killedBy: BookDetailsGuard2 canActivate with NEW timestamp in the store, and isbn param matches that in the store, should return of(true) 
statusReason: Expected spy mockStore.dispatch not to have been called.

[Killed] EqualityOperator
app/books/book-details/book-details2.guard.ts:58:7
     }
     if (
       this.isNewTimeStamp(data) &&
-      data.currentBookId != isbn &&
+      data.currentBookId == isbn &&
       data.allBooks.find((book) => book.isbn === isbn)
     ) {
killedBy: BookDetailsGuard2 canActivate with NEW timestamp in the store, and isbn param matches that in the store, should return of(true) 
statusReason: Expected spy mockStore.dispatch not to have been called.

[Killed] ConditionalExpression
app/books/book-details/book-details2.guard.ts:59:36
     if (
       this.isNewTimeStamp(data) &&
       data.currentBookId != isbn &&
-      data.allBooks.find((book) => book.isbn === isbn)
+      data.allBooks.find((book) => false)
     ) {
       this.store.dispatch(setCurrentBookSuccess({ currentBookId: isbn }));
killedBy: BookDetailsGuard2 canActivate with NEW timestamp in the store,  but isbn param doesn't match that in the store.currentBook  and if there is ONE other book in the store with the requested ISBN,  should
statusReason: Expected spy mockStore.dispatch to have been called only once, and with given args:
  [ Object({ currentBookId: '1234567890', type: '[BookEntity/API] Set Current Book Success' }) ]
But it was never called.


Error: Expected spy mockStore.dispatch to have been called only once, and with given args:
  [ Object({ currentBookId: '1234567890', type: '[BookEntity/API] Set Current Book Success' }) ]
But

[Killed] ArrowFunction
app/books/book-details/book-details2.guard.ts:59:26
     if (
       this.isNewTimeStamp(data) &&
       data.currentBookId != isbn &&
-      data.allBooks.find((book) => book.isbn === isbn)
+      data.allBooks.find(() => undefined)
     ) {
       this.store.dispatch(setCurrentBookSuccess({ currentBookId: isbn }));
killedBy: BookDetailsGuard2 canActivate with NEW timestamp in the store,  but isbn param doesn't match that in the store.currentBook  and if there is ONE other book in the store with the requested ISBN,  should
statusReason: Expected spy mockStore.dispatch to have been called only once, and with given args:
  [ Object({ currentBookId: '1234567890', type: '[BookEntity/API] Set Current Book Success' }) ]
But it was never called.


Error: Expected spy mockStore.dispatch to have been called only once, and with given args:
  [ Object({ currentBookId: '1234567890', type: '[BookEntity/API] Set Current Book Success' }) ]
But

[Killed] BlockStatement
app/books/book-details/book-details2.guard.ts:60:7
       this.isNewTimeStamp(data) &&
       data.currentBookId != isbn &&
       data.allBooks.find((book) => book.isbn === isbn)
-    ) {
-      this.store.dispatch(setCurrentBookSuccess({ currentBookId: isbn }));
-    }
+    ) {}
     if (
       this.isNewTimeStamp(data) &&
killedBy: BookDetailsGuard2 canActivate with NEW timestamp in the store,  but isbn param doesn't match that in the store.currentBook  and if there is ONE other book in the store with the requested ISBN,  should
statusReason: Expected spy mockStore.dispatch to have been called only once, and with given args:
  [ Object({ currentBookId: '1234567890', type: '[BookEntity/API] Set Current Book Success' }) ]
But it was never called.


Error: Expected spy mockStore.dispatch to have been called only once, and with given args:
  [ Object({ currentBookId: '1234567890', type: '[BookEntity/API] Set Current Book Success' }) ]
But

[Killed] ConditionalExpression
app/books/book-details/book-details2.guard.ts:64:7
       this.store.dispatch(setCurrentBookSuccess({ currentBookId: isbn }));
     }
     if (
-      this.isNewTimeStamp(data) &&
-      !data.allBooks.find((book) => book.isbn === isbn)
+      true
     ) {
       this.store.dispatch(
killedBy: BookDetailsGuard2 canActivate with NEW timestamp in the store, and isbn param matches that in the store, should return of(true) ; BookDetailsGuard2 canActivate with old timestamp in the store should not return anything in the Observable yet but emit a dispatch(loadAllAndSetCurrentBook)if  there is no Book at all with the request
statusReason: Expected spy mockStore.dispatch not to have been called.

[Killed] ConditionalExpression
app/books/book-details/book-details2.guard.ts:64:7
       this.store.dispatch(setCurrentBookSuccess({ currentBookId: isbn }));
     }
     if (
-      this.isNewTimeStamp(data) &&
-      !data.allBooks.find((book) => book.isbn === isbn)
+      false
     ) {
       this.store.dispatch(
killedBy: BookDetailsGuard2 canActivate with NEW timestamp in the store,  but isbn param doesn't match that in the store.currentBook  and if there is NO book in the store with the requested ISBN should  return 
statusReason: Expected spy mockStore.dispatch to have been called only once, and with given args:
  [ Object({ message: 'isbn number not found', type: '[BookEntity/API]  Error' }) ]
But it was never called.


Error: Expected spy mockStore.dispatch to have been called only once, and with given args:
  [ Object({ message: 'isbn number not found', type: '[BookEntity/API]  Error' }) ]
But it was never called.

[Killed] BlockStatement
app/books/book-details/book-details2.guard.ts:66:7
     if (
       this.isNewTimeStamp(data) &&
       !data.allBooks.find((book) => book.isbn === isbn)
-    ) {
-      this.store.dispatch(
-        bookErrorAction({ message: 'isbn number not found' })
-      );
-    }
+    ) {}
   }
   private isNewTimeStamp(data: curBookTS) {
killedBy: BookDetailsGuard2 canActivate with NEW timestamp in the store,  but isbn param doesn't match that in the store.currentBook  and if there is NO book in the store with the requested ISBN should  return 
statusReason: Expected spy mockStore.dispatch to have been called only once, and with given args:
  [ Object({ message: 'isbn number not found', type: '[BookEntity/API]  Error' }) ]
But it was never called.


Error: Expected spy mockStore.dispatch to have been called only once, and with given args:
  [ Object({ message: 'isbn number not found', type: '[BookEntity/API]  Error' }) ]
But it was never called.

[Killed] BooleanLiteral
app/books/book-details/book-details2.guard.ts:73:12
     }
   }
   private isNewTimeStamp(data: curBookTS) {
-    return !this.isOldTimeStamp(data);
+    return this.isOldTimeStamp(data);
   }
   private isOldTimeStamp(data: curBookTS) {
killedBy: BookDetailsGuard2 canActivate with NEW timestamp in the store,  but isbn param doesn't match that in the store.currentBook  and if there is ONE other book in the store with the requested ISBN,  should; BookDetailsGuard2 canActivate with old timestamp in the store should not return anything in the Observable yet but emit a dispatch(loadAllAndSetCurrentBook)if  there is no Book at all with the request
statusReason: Expected spy mockStore.dispatch to have been called only once, and with given args:
  [ Object({ currentBookId: '1234567890', type: '[BookEntity/API] Set Current Book Success' }) ]
But it was never called.


Error: Expected spy mockStore.dispatch to have been called only once, and with given args:
  [ Object({ currentBookId: '1234567890', type: '[BookEntity/API] Set Current Book Success' }) ]
But

[Killed] ArithmeticOperator
app/books/book-details/book-details2.guard.ts:76:32
     return !this.isOldTimeStamp(data);
   }
   private isOldTimeStamp(data: curBookTS) {
-    return data.lastUpdateTS < Date.now() - 1000 * 60;
+    return data.lastUpdateTS < Date.now() + 1000 * 60;
   }
 }
killedBy: BookDetailsGuard2 canActivate with NEW timestamp in the store, and isbn param matches that in the store, should return of(true) 
statusReason: Expected spy mockStore.dispatch not to have been called.

[Killed] EqualityOperator
app/books/book-details/book-details2.guard.ts:76:12
     return !this.isOldTimeStamp(data);
   }
   private isOldTimeStamp(data: curBookTS) {
-    return data.lastUpdateTS < Date.now() - 1000 * 60;
+    return data.lastUpdateTS <= Date.now() - 1000 * 60;
   }
 }
killedBy: BookDetailsGuard2 canActivate with NEW timestamp in the store, and isbn param matches that in the store, should return of(true) 
statusReason: Expected spy mockStore.dispatch not to have been called.
