[Killed] BlockStatement
app/books/book-list/book-list.component.ts:23:20
 
   constructor(private cd: ChangeDetectorRef, private store: Store) {}
 
-  ngOnInit(): void {
-    this.listView = true;
-  }
+  ngOnInit(): void {}
   closeError() {
     this.store.dispatch(resetErrorsAction());
killedBy: BookListComponent should have an observable containing the books and show 2 book-items
statusReason: Expected undefined to be true.

[Killed] BooleanLiteral
app/books/book-list/book-list.component.ts:24:21
   constructor(private cd: ChangeDetectorRef, private store: Store) {}
 
   ngOnInit(): void {
-    this.listView = true;
+    this.listView = false;
   }
   closeError() {
killedBy: BookListComponent should have an observable containing the books and show 2 book-items
statusReason: Expected false to be true.
