[Killed] ConditionalExpression
app/admin/shared/bodos-validator.service.ts:19:9
   //Todo: replace use of BookStoreService with a Store-Action
   constructor(private bookService: BookStoreService) {}
   checkIsbn(control: AbstractControl): ValidationErrors | null {
-    if (!control.value) return { isbnLength: { valid: false } };
+    if (false) return { isbnLength: { valid: false } };
     if (control.value.length != 10 && control.value.length != 13)
       return { isbnLength: { valid: false } };
killedBy: BodosValidatorService should return an error if control.value is not defined
statusReason: TypeError: Cannot read properties of null (reading 'length')

[Killed] EqualityOperator
app/admin/shared/bodos-validator.service.ts:20:9
   constructor(private bookService: BookStoreService) {}
   checkIsbn(control: AbstractControl): ValidationErrors | null {
     if (!control.value) return { isbnLength: { valid: false } };
-    if (control.value.length != 10 && control.value.length != 13)
+    if (control.value.length == 10 && control.value.length != 13)
       return { isbnLength: { valid: false } };
     return null;
killedBy: BodosValidatorService should return null if value.length is 10 or 13
statusReason: Expected Object({ isbnLength: Object({ valid: false }) }) to be null.

[Killed] EqualityOperator
app/admin/shared/bodos-validator.service.ts:20:39
   constructor(private bookService: BookStoreService) {}
   checkIsbn(control: AbstractControl): ValidationErrors | null {
     if (!control.value) return { isbnLength: { valid: false } };
-    if (control.value.length != 10 && control.value.length != 13)
+    if (control.value.length != 10 && control.value.length == 13)
       return { isbnLength: { valid: false } };
     return null;
killedBy: BodosValidatorService should return null if value.length is 10 or 13
statusReason: Expected Object({ isbnLength: Object({ valid: false }) }) to be null.

[Killed] MethodExpression
app/admin/shared/bodos-validator.service.ts:26:7
   }
   checkAuthors(authorsFormArray: AbstractControl): ValidationErrors | null {
     if (
-      (authorsFormArray as FormArray).controls.some(
-        (ele) => ele.value?.length > 0
-      )
+      (authorsFormArray as FormArray).controls.every(ele => ele.value?.length > 0)
     ) {
       return null;
killedBy: BodosValidatorService should return no error if FormControlArray has an author that value is empty string, but has another valid author
statusReason: Expected Object({ oneAuthor: Object({ valid: false }) }) to be null.

[Killed] ConditionalExpression
app/admin/shared/bodos-validator.service.ts:27:18
   checkAuthors(authorsFormArray: AbstractControl): ValidationErrors | null {
     if (
       (authorsFormArray as FormArray).controls.some(
-        (ele) => ele.value?.length > 0
+        (ele) => true
       )
     ) {
killedBy: BodosValidatorService should return { oneAuthor: { valid: false } } if FormControlArray has no author
statusReason: Expected null to equal Object({ oneAuthor: Object({ valid: false }) }).

[Killed] EqualityOperator
app/admin/shared/bodos-validator.service.ts:27:18
   checkAuthors(authorsFormArray: AbstractControl): ValidationErrors | null {
     if (
       (authorsFormArray as FormArray).controls.some(
-        (ele) => ele.value?.length > 0
+        (ele) => ele.value?.length <= 0
       )
     ) {
killedBy: BodosValidatorService should return null if FormControlArray has at least one author
statusReason: Expected Object({ oneAuthor: Object({ valid: false }) }) to be null.

[Killed] ObjectLiteral
app/admin/shared/bodos-validator.service.ts:32:14
     ) {
       return null;
     } else {
-      return { oneAuthor: { valid: false } };
+      return {};
     }
   }
killedBy: BodosValidatorService should return { oneAuthor: { valid: false } } if FormControlArray has no author
statusReason: Expected object to have properties
    oneAuthor: Object({ valid: false })

[Killed] ObjectLiteral
app/admin/shared/bodos-validator.service.ts:40:25
       //console.log('calling book Service for validation of isbn');
       return this.bookService.getBookFast(control.value).pipe(
         map((book) => {
-          return book ? { isbnExists: { valid: false } } : null;
+          return book ? {} : null;
         }),
         catchError(() => {
killedBy: BodosValidatorService should return error observable if book with this ISBN already exists
statusReason: Expected $[0].notification.value to have properties
    isbnExists: Object({ valid: false })
