[NoCoverage] StringLiteral
src/app/admin/admin-routing.module.ts:7:11
 import { CreateBookComponent } from './create-book/create-book.component';
 
 const routes: Routes = [
-  { path: 'edit/:isbn', component: BookEditComponent },
+  { path: "", component: BookEditComponent },
   { path: 'create', component: CreateBookComponent },
   { path: '', redirectTo: 'admin/create', pathMatch: 'full' }
