[Killed] BlockStatement
app/books/book-list/list-loaded.guard.ts:27:70
   canActivate(route: ActivatedRouteSnapshot, state: RouterStateSnapshot) {
     return this.getFromStoreOrAPI().pipe(
       switchMap((data) => {
-        if (data.total > 0 && !data.httpError && !data.errorMessage) {
-          // only if we have data AND no errors whatsoever
-          return of(true);
-        }
+        if (data.total > 0 && !data.httpError && !data.errorMessage) {}
         return of(this.router.parseUrl('/error'));
       })
killedBy: ListLoadedGuard.canActivate  with a mock for store.select() happy case: 1 item and new timestamp from store, this  is already good: return true and  ignore the rest
statusReason: Expected $[0].notification.value = undefined to equal true.

[Killed] BooleanLiteral
app/books/book-list/list-loaded.guard.ts:27:50
   canActivate(route: ActivatedRouteSnapshot, state: RouterStateSnapshot) {
     return this.getFromStoreOrAPI().pipe(
       switchMap((data) => {
-        if (data.total > 0 && !data.httpError && !data.errorMessage) {
+        if (data.total > 0 && !data.httpError && data.errorMessage) {
           // only if we have data AND no errors whatsoever
           return of(true);
killedBy: ListLoadedGuard.canActivate  with a mock for store.select() happy case: 1 item and new timestamp from store, this  is already good: return true and  ignore the rest
statusReason: Expected $[0].notification.value = undefined to equal true.

[Killed] BooleanLiteral
app/books/book-list/list-loaded.guard.ts:29:21
       switchMap((data) => {
         if (data.total > 0 && !data.httpError && !data.errorMessage) {
           // only if we have data AND no errors whatsoever
-          return of(true);
+          return of(false);
         }
         return of(this.router.parseUrl('/error'));
killedBy: ListLoadedGuard.canActivate  with a mock for store.select() happy case: 1 item and new timestamp from store, this  is already good: return true and  ignore the rest
statusReason: Expected $[0].notification.value = false to equal true.

[Killed] BlockStatement
app/books/book-list/list-loaded.guard.ts:41:21
       distinctUntilChanged((previous, current) => {
         return isEqual(previous, current);
       }),
-      tap((data) => {
-        this.dispatchActions(data);
-      }),
+      tap((data) => {}),
       filter((data) => {
         return this.canWeProceed(data);
killedBy: ListLoadedGuard.canActivate  with a mock for store.select() 1st and 2nd item from store are the same and it has an old timestamp and NO books, 3rd has the books and a new timestamp.we expect a call to
statusReason: Expected spy MockStore.dispatch to have been called only once, and with given args:
  [ Object({ type: '[BookEntity/API] Load BookEntities' }) ]
But it was never called.


Error: Expected spy MockStore.dispatch to have been called only once, and with given args:
  [ Object({ type: '[BookEntity/API] Load BookEntities' }) ]
But it was never called.

[Killed] ArithmeticOperator
app/books/book-list/list-loaded.guard.ts:57:43
     httpError: HttpErrorResponse | null;
     errorMessage: string | null;
   }) {
-    if (data.lastUpdateTS >= Date.now() - 1000 * 60) {
+    if (data.lastUpdateTS >= Date.now() - 1000 / 60) {
       // yes: new timestamp
       return true;
killedBy: ListLoadedGuard.canActivate  with a mock for store.select() 1st item from store  has an new timestamp but NO books, and there were no other errorswe expect a call to dispatch(bookErrorAction()) and fi
statusReason: Expected $.length = 1 to equal 2.
Expected $[0].frame = 3 to equal 0.
Expected $[0].notification.kind = 'C' to equal 'N'.
Expected $[0].notification.value = undefined to equal spy on MockUrlTree.toString.
Expected $[1] = undefined to equal Object({ frame: 0, notification: Object({ kind: 'C', value: undefined, error: undefined }) }).

[Killed] EqualityOperator
app/books/book-list/list-loaded.guard.ts:57:9
     httpError: HttpErrorResponse | null;
     errorMessage: string | null;
   }) {
-    if (data.lastUpdateTS >= Date.now() - 1000 * 60) {
+    if (data.lastUpdateTS > Date.now() - 1000 * 60) {
       // yes: new timestamp
       return true;
killedBy: ListLoadedGuard.canActivate  with a mock for store.select() 1st item from store  has an new timestamp but NO books, and there were no other errorswe expect a call to dispatch(bookErrorAction()) and fi
statusReason: Expected $.length = 1 to equal 2.
Expected $[0].frame = 3 to equal 0.
Expected $[0].notification.kind = 'C' to equal 'N'.
Expected $[0].notification.value = undefined to equal spy on MockUrlTree.toString.
Expected $[1] = undefined to equal Object({ frame: 0, notification: Object({ kind: 'C', value: undefined, error: undefined }) }).

[Killed] BooleanLiteral
app/books/book-list/list-loaded.guard.ts:59:14
   }) {
     if (data.lastUpdateTS >= Date.now() - 1000 * 60) {
       // yes: new timestamp
-      return true;
+      return false;
     } else if (!!data.total || !!data.httpError || !!data.errorMessage) {
       // yes: old timestamp , but we have data or an error message
killedBy: ListLoadedGuard.canActivate  with a mock for store.select() happy case: 1 item and new timestamp from store, this  is already good: return true and  ignore the rest
statusReason: Expected $.length = 1 to equal 2.
Expected $[0].frame = 3 to equal 0.
Expected $[0].notification.kind = 'C' to equal 'N'.
Expected $[0].notification.value = undefined to equal true.
Expected $[1] = undefined to equal Object({ frame: 0, notification: Object({ kind: 'C', value: undefined, error: undefined }) }).

[Killed] BooleanLiteral
app/books/book-list/list-loaded.guard.ts:60:52
     if (data.lastUpdateTS >= Date.now() - 1000 * 60) {
       // yes: new timestamp
       return true;
-    } else if (!!data.total || !!data.httpError || !!data.errorMessage) {
+    } else if (!!data.total || !!data.httpError || !data.errorMessage) {
       // yes: old timestamp , but we have data or an error message
       return true;
killedBy: ListLoadedGuard.canActivate  with a mock for store.select() 1st and 2nd item from store are the same and it has an old timestamp and NO books, 3rd has the books and a new timestamp.we expect a call to
statusReason: Expected $[0].frame = 0 to equal 2.
Expected $[0].notification.value = undefined to equal true.
Expected $[1].frame = 0 to equal 2.

[Killed] ConditionalExpression
app/books/book-list/list-loaded.guard.ts:60:16
     if (data.lastUpdateTS >= Date.now() - 1000 * 60) {
       // yes: new timestamp
       return true;
-    } else if (!!data.total || !!data.httpError || !!data.errorMessage) {
+    } else if (false) {
       // yes: old timestamp , but we have data or an error message
       return true;
killedBy: ListLoadedGuard.canActivate  with a mock for store.select() 1st and 2nd item from store are the same and it has an old timestamp and SOME books, 3rd has the books and a new timestamp.we expect a call 
statusReason: Expected $[0].frame = 2 to equal 0.
Expected $[1].frame = 2 to equal 0.

[Killed] BooleanLiteral
app/books/book-list/list-loaded.guard.ts:62:14
       return true;
     } else if (!!data.total || !!data.httpError || !!data.errorMessage) {
       // yes: old timestamp , but we have data or an error message
-      return true;
+      return false;
     }
     // no: wait for next data, because it's an old timestamp,
killedBy: ListLoadedGuard.canActivate  with a mock for store.select() 1st and 2nd item from store are the same and it has an old timestamp and SOME books, 3rd has the books and a new timestamp.we expect a call 
statusReason: Expected $[0].frame = 2 to equal 0.
Expected $[1].frame = 2 to equal 0.

[Killed] BooleanLiteral
app/books/book-list/list-loaded.guard.ts:66:12
     }
     // no: wait for next data, because it's an old timestamp,
     // and we have no data nor errors -> wait for store update, do nothing
-    return false;
+    return true;
   }
 
killedBy: ListLoadedGuard.canActivate  with a mock for store.select() 1st and 2nd item from store are the same and it has an old timestamp and NO books, 3rd has the books and a new timestamp.we expect a call to
statusReason: Expected $[0].frame = 0 to equal 2.
Expected $[0].notification.value = undefined to equal true.
Expected $[1].frame = 0 to equal 2.

[Killed] BlockStatement
app/books/book-list/list-loaded.guard.ts:74:6
     lastUpdateTS: number;
     httpError: HttpErrorResponse | null;
     errorMessage: string | null;
-  }) {
-    if (data.lastUpdateTS < Date.now() - 1000 * 60) {
-      // old timestamp
-      this.store.dispatch(loadBookEntities());
-    } else {
-      // new timestamp
-      if (!data.total && !data.httpError && !data.errorMessage) {
-        this.store.dispatch(
-          bookErrorAction({
-            message: 'no books found from backend recently'
-          })
-        );
-      }
-    }
-  }
+  }) {}
 }
 
killedBy: ListLoadedGuard.canActivate  with a mock for store.select() 1st and 2nd item from store are the same and it has an old timestamp and NO books, 3rd has the books and a new timestamp.we expect a call to
statusReason: Expected spy MockStore.dispatch to have been called only once, and with given args:
  [ Object({ type: '[BookEntity/API] Load BookEntities' }) ]
But it was never called.


Error: Expected spy MockStore.dispatch to have been called only once, and with given args:
  [ Object({ type: '[BookEntity/API] Load BookEntities' }) ]
But it was never called.

[Killed] ArithmeticOperator
app/books/book-list/list-loaded.guard.ts:75:42
     httpError: HttpErrorResponse | null;
     errorMessage: string | null;
   }) {
-    if (data.lastUpdateTS < Date.now() - 1000 * 60) {
+    if (data.lastUpdateTS < Date.now() - 1000 / 60) {
       // old timestamp
       this.store.dispatch(loadBookEntities());
killedBy: ListLoadedGuard.canActivate  with a mock for store.select() happy case: 1 item and new timestamp from store, this  is already good: return true and  ignore the rest
statusReason: Expected spy MockStore.dispatch not to have been called.

[Killed] ConditionalExpression
app/books/book-list/list-loaded.guard.ts:75:9
     httpError: HttpErrorResponse | null;
     errorMessage: string | null;
   }) {
-    if (data.lastUpdateTS < Date.now() - 1000 * 60) {
+    if (false) {
       // old timestamp
       this.store.dispatch(loadBookEntities());
killedBy: ListLoadedGuard.canActivate  with a mock for store.select() 1st and 2nd item from store are the same and it has an old timestamp and NO books, 3rd has the books and a new timestamp.we expect a call to
statusReason: Expected spy MockStore.dispatch to have been called only once, and with given args:
  [ Object({ type: '[BookEntity/API] Load BookEntities' }) ]
But the actual call was:
  [ Object({ message: 'no books found from backend recently', type: '[BookEntity/API]  Error' }) ].
Expected $[0] not to have properties
    message: 'no books found from backend recently'

[Killed] BlockStatement
app/books/book-list/list-loaded.guard.ts:78:12
     if (data.lastUpdateTS < Date.now() - 1000 * 60) {
       // old timestamp
       this.store.dispatch(loadBookEntities());
-    } else {
-      // new timestamp
-      if (!data.total && !data.httpError && !data.errorMessage) {
-        this.store.dispatch(
-          bookErrorAction({
-            message: 'no books found from backend recently'
-          })
-        );
-      }
-    }
+    } else {}
   }
 }
killedBy: ListLoadedGuard.canActivate  with a mock for store.select() 1st item from store  has an new timestamp but NO books, and there were no other errorswe expect a call to dispatch(bookErrorAction()) and fi
statusReason: Expected spy MockStore.dispatch to have been called only once, and with given args:
  [ Object({ message: 'no books found from backend recently', type: '[BookEntity/API]  Error' }) ]
But it was never called.


Error: Expected spy MockStore.dispatch to have been called only once, and with given args:
  [ Object({ message: 'no books found from backend recently', type: '[BookEntity/API]  Error' }) ]

[Killed] LogicalOperator
app/books/book-list/list-loaded.guard.ts:80:11
       this.store.dispatch(loadBookEntities());
     } else {
       // new timestamp
-      if (!data.total && !data.httpError && !data.errorMessage) {
+      if (!data.total || !data.httpError && !data.errorMessage) {
         this.store.dispatch(
           bookErrorAction({
killedBy: ListLoadedGuard.canActivate  with a mock for store.select() happy case: 1 item and new timestamp from store, this  is already good: return true and  ignore the rest
statusReason: Expected spy MockStore.dispatch not to have been called.

[Killed] ConditionalExpression
app/books/book-list/list-loaded.guard.ts:80:11
       this.store.dispatch(loadBookEntities());
     } else {
       // new timestamp
-      if (!data.total && !data.httpError && !data.errorMessage) {
+      if (false) {
         this.store.dispatch(
           bookErrorAction({
killedBy: ListLoadedGuard.canActivate  with a mock for store.select() 1st item from store  has an new timestamp but NO books, and there were no other errorswe expect a call to dispatch(bookErrorAction()) and fi
statusReason: Expected spy MockStore.dispatch to have been called only once, and with given args:
  [ Object({ message: 'no books found from backend recently', type: '[BookEntity/API]  Error' }) ]
But it was never called.


Error: Expected spy MockStore.dispatch to have been called only once, and with given args:
  [ Object({ message: 'no books found from backend recently', type: '[BookEntity/API]  Error' }) ]
