[Killed] ConditionalExpression
books/store/book-entity/book-entity.effects.ts:49:54
       switchMap((action) =>
         this.bs.getAllEntities().pipe(
           map((books: BookEntity[]) => {
-            const currentBook = books.find((book) => book.isbn == action.isbn);
+            const currentBook = books.find((book) => true);
             return loadAllAndSetCurrentBookSuccess({
               books,
killedBy: BookEntityEffects  success case with BookService.getAllEntities  reloadBooksAndSetCurrentBook$ should dispatch action loadBookEntitiesSuccess even it book not found
statusReason: Expected '1234567890' to be falsy.
