[Survived] StringLiteral
app/admin/book-edit/book-edit.component.ts:14:18
 })
 export class BookEditComponent implements OnInit {
   book$!: Observable<Book>;
-  errorMessage = '';
+  errorMessage = "Stryker was here!";
   saved = false;
   successMsg = '';

[Killed] BooleanLiteral
app/admin/book-edit/book-edit.component.ts:15:11
 export class BookEditComponent implements OnInit {
   book$!: Observable<Book>;
   errorMessage = '';
-  saved = false;
+  saved = true;
   successMsg = '';
   constructor(
killedBy: BookEditComponent should call bookstoreservice and subscribe on saveBook() , error case
statusReason: Expected true to equal false.

[Killed] StringLiteral
app/admin/book-edit/book-edit.component.ts:16:16
   book$!: Observable<Book>;
   errorMessage = '';
   saved = false;
-  successMsg = '';
+  successMsg = "Stryker was here!";
   constructor(
     private route: ActivatedRoute,
killedBy: BookEditComponent should call bookstoreservice and subscribe on saveBook() , error case
statusReason: Expected 17 to equal 0.

[Survived] BlockStatement
app/admin/book-edit/book-edit.component.ts:20:5
   constructor(
     private route: ActivatedRoute,
     private bookStoreService: BookStoreService
-  ) {
-    this.route = route;
-  }
+  ) {}
 
   ngOnInit(): void {

[Killed] BlockStatement
app/admin/book-edit/book-edit.component.ts:24:20
     this.route = route;
   }
 
-  ngOnInit(): void {
-    this.route.paramMap.subscribe((params) => {
-      let isbn = params.get('isbn');
-      if (isbn) {
-        this.book$ = this.bookStoreService.getBook(isbn);
-      } else {
-        this.book$ = of({} as Book);
-      }
-    });
-  }
+  ngOnInit(): void {}
 
   saveBook(book: Book) {
killedBy: BookEditComponent should create component and should ball bookStoreService.get() with ISBN number on ngOnInit()
statusReason: Expected spy paramMap to have been called only once, and with given args:
  [  ]
But it was never called.


Error: Expected spy paramMap to have been called only once, and with given args:
  [  ]
But it was never called.

[Killed] BlockStatement
app/admin/book-edit/book-edit.component.ts:25:47
   }
 
   ngOnInit(): void {
-    this.route.paramMap.subscribe((params) => {
-      let isbn = params.get('isbn');
-      if (isbn) {
-        this.book$ = this.bookStoreService.getBook(isbn);
-      } else {
-        this.book$ = of({} as Book);
-      }
-    });
+    this.route.paramMap.subscribe((params) => {});
   }
 
killedBy: BookEditComponent should create component and should ball bookStoreService.get() with ISBN number on ngOnInit()
statusReason: Expected spy paramMap.get().get to have been called only once, and with given args:
  [ 'isbn' ]
But it was never called.


Error: Expected spy paramMap.get().get to have been called only once, and with given args:
  [ 'isbn' ]
But it was never called.

[Killed] StringLiteral
app/admin/book-edit/book-edit.component.ts:26:29
 
   ngOnInit(): void {
     this.route.paramMap.subscribe((params) => {
-      let isbn = params.get('isbn');
+      let isbn = params.get("");
       if (isbn) {
         this.book$ = this.bookStoreService.getBook(isbn);
killedBy: BookEditComponent should create component and should ball bookStoreService.get() with ISBN number on ngOnInit()
statusReason: Expected spy paramMap.get().get to have been called only once, and with given args:
  [ 'isbn' ]
But the actual call was:
  [ '' ].
Expected $[0] = '' to equal 'isbn'.


Error: Expected spy paramMap.get().get to have been called only once, and with given args:

[Killed] ConditionalExpression
app/admin/book-edit/book-edit.component.ts:27:11
   ngOnInit(): void {
     this.route.paramMap.subscribe((params) => {
       let isbn = params.get('isbn');
-      if (isbn) {
+      if (false) {
         this.book$ = this.bookStoreService.getBook(isbn);
       } else {
killedBy: BookEditComponent should create component and should ball bookStoreService.get() with ISBN number on ngOnInit()
statusReason: Expected spy unknown to have been called only once, and with given args:
  [ '123' ]
But it was never called.


Error: Expected spy unknown to have been called only once, and with given args:
  [ '123' ]
But it was never called.

[Killed] BlockStatement
app/admin/book-edit/book-edit.component.ts:27:17
   ngOnInit(): void {
     this.route.paramMap.subscribe((params) => {
       let isbn = params.get('isbn');
-      if (isbn) {
-        this.book$ = this.bookStoreService.getBook(isbn);
-      } else {
+      if (isbn) {} else {
         this.book$ = of({} as Book);
       }
killedBy: BookEditComponent should create component and should ball bookStoreService.get() with ISBN number on ngOnInit()
statusReason: Expected spy unknown to have been called only once, and with given args:
  [ '123' ]
But it was never called.


Error: Expected spy unknown to have been called only once, and with given args:
  [ '123' ]
But it was never called.

[Survived] BlockStatement
app/admin/book-edit/book-edit.component.ts:29:14
       let isbn = params.get('isbn');
       if (isbn) {
         this.book$ = this.bookStoreService.getBook(isbn);
-      } else {
-        this.book$ = of({} as Book);
-      }
+      } else {}
     });
   }

[Killed] BlockStatement
app/admin/book-edit/book-edit.component.ts:35:24
     });
   }
 
-  saveBook(book: Book) {
-    this.bookStoreService.putBook(book).subscribe({
-      next: (res) => {
-        this.saved = true;
-        this.successMsg = res;
-        this.book$ = of(book);
-        setTimeout(() => (this.saved = false), 5000);
-      },
-      error: (error) => {
-        this.errorMessage = JSON.stringify(error);
-        console.error('ERROR in http.put saveBook: ' + JSON.stringify(error));
-      }
-    });
-  }
+  saveBook(book: Book) {}
 }
 
killedBy: BookEditComponent to save a book, it should call bookstoreservice and subscribe on saveBook(), success case
statusReason: Expected spy unknown to have been called only once, and with given args:
  [ Object({ title: 'string', authors: [  ], published: Date(Thu Aug 18 2022 13:46:27 GMT-0400 (Eastern Daylight Time)), isbn: '' }) ]
But it was never called.


Error: Expected spy unknown to have been called only once, and with given args:
  [ Object({ title: 'string', authors: [  ], published: Date(Thu Aug 18 2022 13:46:27

[Killed] ObjectLiteral
app/admin/book-edit/book-edit.component.ts:36:51
   }
 
   saveBook(book: Book) {
-    this.bookStoreService.putBook(book).subscribe({
-      next: (res) => {
-        this.saved = true;
-        this.successMsg = res;
-        this.book$ = of(book);
-        setTimeout(() => (this.saved = false), 5000);
-      },
-      error: (error) => {
-        this.errorMessage = JSON.stringify(error);
-        console.error('ERROR in http.put saveBook: ' + JSON.stringify(error));
-      }
-    });
+    this.bookStoreService.putBook(book).subscribe({});
   }
 }
killedBy: BookEditComponent to save a book, it should call bookstoreservice and subscribe on saveBook(), success case
statusReason: Expected false to equal true.

[Killed] BlockStatement
app/admin/book-edit/book-edit.component.ts:43:25
         this.book$ = of(book);
         setTimeout(() => (this.saved = false), 5000);
       },
-      error: (error) => {
-        this.errorMessage = JSON.stringify(error);
-        console.error('ERROR in http.put saveBook: ' + JSON.stringify(error));
-      }
+      error: (error) => {}
     });
   }
killedBy: BookEditComponent should call bookstoreservice and subscribe on saveBook() , error case
statusReason: Expected spy error to have been called once. It was called 0 times.
