[Killed] BlockStatement
books/store/book-entity/book-entity.selectors.ts:20:76
   selectIds(state)
 );
 
-export const selectErrorState = createSelector(selectBookState, (state) => {
-  if (!!state.httpError || !!state.errorMessage)
-    return {
-      httpError: state.httpError,
-      errorMessage: state.errorMessage,
-      lastUpdateTS: state.lastUpdateTS
-    };
-  else return {};
-});
+export const selectErrorState = createSelector(selectBookState, (state) => {});
 
 export const selectCurrentBook = createSelector(selectBookState, (state) => {
killedBy: BookDetailsComponent and IsbnPipe should show  http errors if any  and if clicked on close, the error message should disapear; BookListComponent should show  http errors if any ; BookEntity selectors selectErrorState should select ErrorState
statusReason: Expected null to be truthy.

[Killed] BooleanLiteral
books/store/book-entity/book-entity.selectors.ts:21:28
 );
 
 export const selectErrorState = createSelector(selectBookState, (state) => {
-  if (!!state.httpError || !!state.errorMessage)
+  if (!!state.httpError || !state.errorMessage)
     return {
       httpError: state.httpError,
killedBy: BookListComponent should show   errorMessage if any ; BookEntity selectors selectErrors should select empty ErrorState if there are no errors
statusReason: Expected undefined to equal 'some error'.

[Killed] ConditionalExpression
books/store/book-entity/book-entity.selectors.ts:21:7
 );
 
 export const selectErrorState = createSelector(selectBookState, (state) => {
-  if (!!state.httpError || !!state.errorMessage)
+  if (true)
     return {
       httpError: state.httpError,
killedBy: BookEntity selectors selectErrors should select empty ErrorState if there are no errors
statusReason: Expected object not to have properties
    httpError: null
    errorMessage: null
    lastUpdateTS: 1

[Killed] ConditionalExpression
books/store/book-entity/book-entity.selectors.ts:75:7
 );
 
 export const selectTotalAndErrors = createSelector(selectBookState, (state) => {
-  if (!state)
+  if (true)
     return {
       total: 0,
killedBy: BookEntity selectors selectTotalAndErrors should select ErrorState
statusReason: Expected $.total = 0 to equal 2.
Expected $.lastUpdateTS = 0 to equal 1.
Expected $.errorMessage = null to equal 'the message'.

[Killed] ConditionalExpression
books/store/book-entity/book-entity.selectors.ts:75:7
 );
 
 export const selectTotalAndErrors = createSelector(selectBookState, (state) => {
-  if (!state)
+  if (false)
     return {
       total: 0,
killedBy: BookEntity selectors selectTotalAndErrors should select ErrorState
statusReason: TypeError: Cannot read properties of null (reading 'ids')
