[Survived] BooleanLiteral
app/admin/book-edit/book-form.component.ts:28:29
 })
 export class BookFormComponent implements OnInit, OnChanges {
   @Input() book: Book | undefined | null;
-  @Input() isNew: boolean = false;
+  @Input() isNew: boolean = true;
   @Input() saved: boolean = false;
   @Input() successMsg = '';

[Survived] BooleanLiteral
app/admin/book-edit/book-form.component.ts:29:29
 export class BookFormComponent implements OnInit, OnChanges {
   @Input() book: Book | undefined | null;
   @Input() isNew: boolean = false;
-  @Input() saved: boolean = false;
+  @Input() saved: boolean = true;
   @Input() successMsg = '';
   editForm!: FormGroup;

[Killed] ObjectLiteral
app/admin/book-edit/book-form.component.ts:45:41
   ngOnInit(): void {
     let isbnControl!: FormControl;
     if (this.isNew) {
-      isbnControl = new FormControl('', {
-        validators: [Validators.required, this.isbnValidatorServ.checkIsbn],
-        asyncValidators: [this.isbnValidatorServ.asyncIsbnExistsValidator()]
-      });
+      isbnControl = new FormControl('', {});
     } else {
       isbnControl = new FormControl('', [
killedBy: BookFormsComponent with new book and AsyncValidatorFn that returns a isbnExists-Error should not be valid, if BodosValidatorService.asyncIsbnExistsValidator finds an error
statusReason: Expected true to be false.

[Survived] BlockStatement
app/admin/book-edit/book-form.component.ts:49:12
         validators: [Validators.required, this.isbnValidatorServ.checkIsbn],
         asyncValidators: [this.isbnValidatorServ.asyncIsbnExistsValidator()]
       });
-    } else {
-      isbnControl = new FormControl('', [
-        Validators.required,
-        this.isbnValidatorServ.checkIsbn
-      ]);
-    }
+    } else {}
 
     this.editForm = this.fb.group({

[Killed] ConditionalExpression
app/admin/book-edit/book-form.component.ts:64:9
       description: '',
       rating: [null, [Validators.min(0), Validators.max(5)]]
     });
-    if (this.isNew) {
+    if (true) {
       this.fillEmptyBook();
     } else if (this.book) {
killedBy: BookFormsComponent with existing book and AsyncValidatorFn that returns a isbnExists-Error form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given 
statusReason: Expected false to be true.

[Killed] ConditionalExpression
app/admin/book-edit/book-form.component.ts:66:16
     });
     if (this.isNew) {
       this.fillEmptyBook();
-    } else if (this.book) {
+    } else if (true) {
       this.fillForm(this.book);
     }
killedBy: BookFormsComponent with existing book and AsyncValidatorFn that returns a isbnExists-Error  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given
statusReason: TypeError: Cannot read properties of undefined (reading 'title')

[Killed] ConditionalExpression
app/admin/book-edit/book-form.component.ts:66:16
     });
     if (this.isNew) {
       this.fillEmptyBook();
-    } else if (this.book) {
+    } else if (false) {
       this.fillForm(this.book);
     }
killedBy: BookFormsComponent with existing book and AsyncValidatorFn that returns a isbnExists-Error form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given 
statusReason: Expected false to be true.

[Killed] BlockStatement
app/admin/book-edit/book-form.component.ts:70:39
       this.fillForm(this.book);
     }
   }
-  ngOnChanges(changes: SimpleChanges) {
-    const { aBook } = changes;
-    if (aBook?.currentValue && !this.isNew && this.editForm) {
-      this.fillForm(aBook.currentValue);
-    }
-  }
+  ngOnChanges(changes: SimpleChanges) {}
 
   private fillEmptyBook() {
killedBy: BookFormsComponent with existing book and AsyncValidatorFn that returns a isbnExists-Error  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given
statusReason: Expected false to be true.

[Killed] ConditionalExpression
app/admin/book-edit/book-form.component.ts:72:9
   }
   ngOnChanges(changes: SimpleChanges) {
     const { aBook } = changes;
-    if (aBook?.currentValue && !this.isNew && this.editForm) {
+    if (false) {
       this.fillForm(aBook.currentValue);
     }
killedBy: BookFormsComponent with existing book and AsyncValidatorFn that returns a isbnExists-Error  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given
statusReason: Expected false to be true.

[Killed] BooleanLiteral
app/admin/book-edit/book-form.component.ts:72:32
   }
   ngOnChanges(changes: SimpleChanges) {
     const { aBook } = changes;
-    if (aBook?.currentValue && !this.isNew && this.editForm) {
+    if (aBook?.currentValue && this.isNew && this.editForm) {
       this.fillForm(aBook.currentValue);
     }
killedBy: BookFormsComponent with existing book and AsyncValidatorFn that returns a isbnExists-Error  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given
statusReason: Expected false to be true.

[Killed] BlockStatement
app/admin/book-edit/book-form.component.ts:77:27
     }
   }
 
-  private fillEmptyBook() {
-    const authors = this.fb.array([], [this.isbnValidatorServ.checkAuthors]);
-    authors.push(new FormControl(''));
-    this.editForm.setControl('authors', authors);
-    const thbArray = this.fb.array([]) as FormArray;
-    thbArray.push(
-      this.fb.group({
-        url: '',
-        title: ''
-      })
-    );
-    this.editForm.setControl('thumbnails', thbArray);
-  }
+  private fillEmptyBook() {}
 
   private fillForm(book: Book) {
killedBy: BookFormsComponent with new book and AsyncValidatorFn that returns a isbnExists-Error should create the edit form, which should not be valid; BookFormsComponent with new book and AsyncValidatorFn that returns no errors should call bookFormSaveBook method, when button is clicked, and emit Event if Form is  valid
statusReason: Expected object to have properties
    authors: [ '' ]
    thumbnails: [ Object({ title: '', url: '' }) ]

[Killed] StringLiteral
app/admin/book-edit/book-form.component.ts:85:16
     thbArray.push(
       this.fb.group({
         url: '',
-        title: ''
+        title: "Stryker was here!"
       })
     );
killedBy: BookFormsComponent with new book and AsyncValidatorFn that returns a isbnExists-Error should create the edit form, which should not be valid
statusReason: Expected $.thumbnails[0].title = 'Stryker was here!' to equal ''.

[Survived] OptionalChaining
app/admin/book-edit/book-form.component.ts:92:5
   }
 
   private fillForm(book: Book) {
-    this.editForm.get('title')?.setValue(book.title);
+    this.editForm.get('title').setValue(book.title);
     this.editForm.get('subtitle')?.setValue(book.subtitle + '');
     this.editForm.get('isbn')?.setValue(book.isbn + '');

[Survived] OptionalChaining
app/admin/book-edit/book-form.component.ts:93:5
 
   private fillForm(book: Book) {
     this.editForm.get('title')?.setValue(book.title);
-    this.editForm.get('subtitle')?.setValue(book.subtitle + '');
+    this.editForm.get('subtitle').setValue(book.subtitle + '');
     this.editForm.get('isbn')?.setValue(book.isbn + '');
     this.editForm.get('description')?.setValue(book.description + '');

[Survived] StringLiteral
app/admin/book-edit/book-form.component.ts:93:23
 
   private fillForm(book: Book) {
     this.editForm.get('title')?.setValue(book.title);
-    this.editForm.get('subtitle')?.setValue(book.subtitle + '');
+    this.editForm.get("")?.setValue(book.subtitle + '');
     this.editForm.get('isbn')?.setValue(book.isbn + '');
     this.editForm.get('description')?.setValue(book.description + '');

[Survived] OptionalChaining
app/admin/book-edit/book-form.component.ts:94:5
   private fillForm(book: Book) {
     this.editForm.get('title')?.setValue(book.title);
     this.editForm.get('subtitle')?.setValue(book.subtitle + '');
-    this.editForm.get('isbn')?.setValue(book.isbn + '');
+    this.editForm.get('isbn').setValue(book.isbn + '');
     this.editForm.get('description')?.setValue(book.description + '');
     this.editForm.get('published')?.setValue(book.published);

[Killed] StringLiteral
app/admin/book-edit/book-form.component.ts:94:23
   private fillForm(book: Book) {
     this.editForm.get('title')?.setValue(book.title);
     this.editForm.get('subtitle')?.setValue(book.subtitle + '');
-    this.editForm.get('isbn')?.setValue(book.isbn + '');
+    this.editForm.get("")?.setValue(book.isbn + '');
     this.editForm.get('description')?.setValue(book.description + '');
     this.editForm.get('published')?.setValue(book.published);
killedBy: BookFormsComponent with existing book and AsyncValidatorFn that returns a isbnExists-Error  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given
statusReason: Expected false to be true.

[Survived] OptionalChaining
app/admin/book-edit/book-form.component.ts:95:5
     this.editForm.get('title')?.setValue(book.title);
     this.editForm.get('subtitle')?.setValue(book.subtitle + '');
     this.editForm.get('isbn')?.setValue(book.isbn + '');
-    this.editForm.get('description')?.setValue(book.description + '');
+    this.editForm.get('description').setValue(book.description + '');
     this.editForm.get('published')?.setValue(book.published);
     this.editForm.get('rating')?.setValue(book.rating);

[Survived] OptionalChaining
app/admin/book-edit/book-form.component.ts:96:5
     this.editForm.get('subtitle')?.setValue(book.subtitle + '');
     this.editForm.get('isbn')?.setValue(book.isbn + '');
     this.editForm.get('description')?.setValue(book.description + '');
-    this.editForm.get('published')?.setValue(book.published);
+    this.editForm.get('published').setValue(book.published);
     this.editForm.get('rating')?.setValue(book.rating);
 

[Survived] OptionalChaining
app/admin/book-edit/book-form.component.ts:97:5
     this.editForm.get('isbn')?.setValue(book.isbn + '');
     this.editForm.get('description')?.setValue(book.description + '');
     this.editForm.get('published')?.setValue(book.published);
-    this.editForm.get('rating')?.setValue(book.rating);
+    this.editForm.get('rating').setValue(book.rating);
 
     let authors = this.fb.array([]);

[Killed] ArrayDeclaration
app/admin/book-edit/book-form.component.ts:99:33
     this.editForm.get('published')?.setValue(book.published);
     this.editForm.get('rating')?.setValue(book.rating);
 
-    let authors = this.fb.array([]);
+    let authors = this.fb.array(["Stryker was here"]);
     for (let author of book.authors) {
       const fcAuthor = new FormControl(author);
killedBy: BookFormsComponent with existing book and AsyncValidatorFn that returns a isbnExists-Error  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given
statusReason: Expected spy emit to have been called with:
  [ Object({ authors: [ 'author' ], isbn: '1234567890', published: Date(Tue Feb 01 2022 19:00:00 GMT-0500 (Eastern Standard Time)), title: 'a title', subtitle: '', description: '', rating: 3, thumbnails: [ Object({ title: '', url: '' }) ] }) ]
but actual calls were:
  [ Object({ title: 'a title', subtitle: '', isbn: '1234567890', published: Date(Tue Feb

[Killed] BlockStatement
app/admin/book-edit/book-form.component.ts:100:38
     this.editForm.get('rating')?.setValue(book.rating);
 
     let authors = this.fb.array([]);
-    for (let author of book.authors) {
-      const fcAuthor = new FormControl(author);
-      authors.push(fcAuthor);
-    }
+    for (let author of book.authors) {}
     this.editForm.setControl('authors', authors);
 
killedBy: BookFormsComponent with existing book and AsyncValidatorFn that returns a isbnExists-Error  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given
statusReason: Expected spy emit to have been called with:
  [ Object({ authors: [ 'author' ], isbn: '1234567890', published: Date(Tue Feb 01 2022 19:00:00 GMT-0500 (Eastern Standard Time)), title: 'a title', subtitle: '', description: '', rating: 3, thumbnails: [ Object({ title: '', url: '' }) ] }) ]
but actual calls were:
  [ Object({ title: 'a title', subtitle: '', isbn: '1234567890', published: Date(Tue Feb

[Killed] BlockStatement
app/admin/book-edit/book-form.component.ts:106:26
     }
     this.editForm.setControl('authors', authors);
 
-    if (book.thumbnails) {
-      let thumbnails = this.fb.array([] as FormGroup[]);
-      for (let thumb of book.thumbnails) {
-        const thumbG = this.fb.group({
-          url: thumb.url,
-          title: thumb.title
-        });
-        thumbnails.push(thumbG);
-      }
-      this.editForm.setControl('thumbnails', thumbnails);
-    }
+    if (book.thumbnails) {}
   }
 
killedBy: BookFormsComponent with existing book and AsyncValidatorFn that returns a isbnExists-Error  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given
statusReason: Expected spy emit to have been called with:
  [ Object({ authors: [ 'author' ], isbn: '1234567890', published: Date(Tue Feb 01 2022 19:00:00 GMT-0500 (Eastern Standard Time)), title: 'a title', subtitle: '', description: '', rating: 3, thumbnails: [ Object({ title: '', url: '' }) ] }) ]
but actual calls were:
  [ Object({ title: 'a title', subtitle: '', isbn: '1234567890', published: Date(Tue Feb

[Killed] ConditionalExpression
app/admin/book-edit/book-form.component.ts:106:9
     }
     this.editForm.setControl('authors', authors);
 
-    if (book.thumbnails) {
+    if (false) {
       let thumbnails = this.fb.array([] as FormGroup[]);
       for (let thumb of book.thumbnails) {
killedBy: BookFormsComponent with existing book and AsyncValidatorFn that returns a isbnExists-Error  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given
statusReason: Expected spy emit to have been called with:
  [ Object({ authors: [ 'author' ], isbn: '1234567890', published: Date(Tue Feb 01 2022 19:00:00 GMT-0500 (Eastern Standard Time)), title: 'a title', subtitle: '', description: '', rating: 3, thumbnails: [ Object({ title: '', url: '' }) ] }) ]
but actual calls were:
  [ Object({ title: 'a title', subtitle: '', isbn: '1234567890', published: Date(Tue Feb

[Killed] BlockStatement
app/admin/book-edit/book-form.component.ts:119:17
     }
   }
 
-  get authors() {
-    return this.editForm.get('authors') as FormArray;
-  }
+  get authors() {}
   get isbn() {
     return this.editForm.get('isbn');
killedBy: BookFormsComponent with existing book and AsyncValidatorFn that returns a isbnExists-Error should add an author ; BookFormsComponent with new book and AsyncValidatorFn that returns no errors should call addAuthor method, when add Author is clicked, same with removeAuthor
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
app/admin/book-edit/book-form.component.ts:122:14
   get authors() {
     return this.editForm.get('authors') as FormArray;
   }
-  get isbn() {
-    return this.editForm.get('isbn');
-  }
+  get isbn() {}
   get thumbnails() {
     return this.editForm.get('thumbnails') as FormArray;
killedBy: BookFormsComponent with new book and AsyncValidatorFn that returns a isbnExists-Error should not be valid, if BodosValidatorService.asyncIsbnExistsValidator finds an error
statusReason: Expected undefined to be true.

[Killed] BlockStatement
app/admin/book-edit/book-form.component.ts:125:20
   get isbn() {
     return this.editForm.get('isbn');
   }
-  get thumbnails() {
-    return this.editForm.get('thumbnails') as FormArray;
-  }
+  get thumbnails() {}
 
   bookFormSaveBook() {
killedBy: BookFormsComponent with new book and AsyncValidatorFn that returns no errors should call addThumb method, when add Thumb is clicked, same with ThumbAuthor
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
app/admin/book-edit/book-form.component.ts:130:30
   }
 
   bookFormSaveBook() {
-    if (this.editForm.valid) {
-      this.saveBookEventEmitter.emit(this.editForm.value as Book);
-    } else {
+    if (this.editForm.valid) {} else {
       throw new Error('bookFormSave called although form is not valid!');
     }
killedBy: BookFormsComponent with existing book and AsyncValidatorFn that returns a isbnExists-Error  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given; BookFormsComponent with new book and AsyncValidatorFn that returns no errors should call bookFormSaveBook method, when button is clicked, and emit Event if Form is  valid
statusReason: Expected spy emit to have been called with:
  [ Object({ authors: [ 'author' ], isbn: '1234567890', published: Date(Tue Feb 01 2022 19:00:00 GMT-0500 (Eastern Standard Time)), title: 'a title', subtitle: '', description: '', rating: 3, thumbnails: [ Object({ title: '', url: '' }) ] }) ]
but it was never called.

[Killed] BlockStatement
app/admin/book-edit/book-form.component.ts:137:15
     }
   }
 
-  addAuthor() {
-    const fcAuthor = new FormControl('');
-    this.authors.push(fcAuthor);
-  }
+  addAuthor() {}
 
   removeAuthor(i: number) {
killedBy: BookFormsComponent with existing book and AsyncValidatorFn that returns a isbnExists-Error should add an author ; BookFormsComponent with new book and AsyncValidatorFn that returns no errors should call addAuthor method, when add Author is clicked, same with removeAuthor
statusReason: Expected 1 to equal 2.

[Killed] BlockStatement
app/admin/book-edit/book-form.component.ts:146:14
     this.authors.removeAt(i);
   }
 
-  addThumb() {
-    //console.log('add thumb called in book-form');
-    const thumbG = this.fb.group({
-      url: '',
-      title: ''
-    });
-    this.thumbnails.push(thumbG);
-  }
+  addThumb() {}
 
   removeThumb(j: number) {
killedBy: BookFormsComponent with new book and AsyncValidatorFn that returns no errors should call addThumb method, when add Thumb is clicked, same with ThumbAuthor
statusReason: Expected 1 to equal 2.

[Survived] ObjectLiteral
app/admin/book-edit/book-form.component.ts:148:34
 
   addThumb() {
     //console.log('add thumb called in book-form');
-    const thumbG = this.fb.group({
-      url: '',
-      title: ''
-    });
+    const thumbG = this.fb.group({});
     this.thumbnails.push(thumbG);
   }

[Survived] StringLiteral
app/admin/book-edit/book-form.component.ts:149:12
   addThumb() {
     //console.log('add thumb called in book-form');
     const thumbG = this.fb.group({
-      url: '',
+      url: "Stryker was here!",
       title: ''
     });
