[Survived] ConditionalExpression
app/admin/create-book/create-book.component.ts:32:9
     });
   }
   ngOnDestroy() {
-    if (this.subscription) {
+    if (false) {
       this.subscription.unsubscribe();
     }

[Survived] ConditionalExpression
app/admin/create-book/create-book.component.ts:32:9
     });
   }
   ngOnDestroy() {
-    if (this.subscription) {
+    if (true) {
       this.subscription.unsubscribe();
     }
