[Timeout] BlockStatement
src/app/custom-router-state-serializer.ts:15:30
 {
   serialize(routerState: RouterStateSnapshot): RouterState {
     let route = routerState.root;
-    while (route.firstChild) {
-      route = route.firstChild;
-    }
+    while (route.firstChild) {}
     const {
       url,
