[Killed] BlockStatement
src/app/error-page/error-page.component.ts:16:16
   error$ = this.store.select(selectErrorState);
   constructor(private store: Store, private router: Router) {}
 
-  closeError() {
-    this.store.dispatch(resetErrorsAction());
-    this.router.navigate(['/home']);
-  }
+  closeError() {}
 }
 
killedBy: ErrorPageComponent should call router and store if close() is called
statusReason: Expected spy dispatch to have been called with:
  [ Object({ type: '[BookEntity/API] Error reset' }) ]
but it was never called.
