[Killed] BlockStatement
app/admin/form-messages/form-messages.component.ts:31:32
 
   constructor() {}
 
-  errorsForControl(): string[] {
-    if (this.control?.errors) {
-      let valErrors: ValidationErrors = this.control
-        ?.errors as ValidationErrors;
-      const errorMsgs =
-        this.errorstruct[this.controlName as keyof typeof this.errorstruct];
-      return Object.keys(valErrors).map(
-        (key) => errorMsgs[key as keyof typeof errorMsgs]
-      );
-    }
-    return [];
-  }
+  errorsForControl(): string[] {}
 }
 
killedBy: FormMessagesComponent should create an array of errormessage that fit to a "title" control 
statusReason: Expected undefined to equal [ 'A Title is required' ].

[Killed] ArrowFunction
app/admin/form-messages/form-messages.component.ts:38:9
       const errorMsgs =
         this.errorstruct[this.controlName as keyof typeof this.errorstruct];
       return Object.keys(valErrors).map(
-        (key) => errorMsgs[key as keyof typeof errorMsgs]
+        () => undefined
       );
     }
killedBy: FormMessagesComponent should create an array of errormessage that fit to a "title" control 
statusReason: Expected $[0] = undefined to equal 'A Title is required'.
