[Killed] BlockStatement
src/app/search/search.component.ts:34:20
 
   constructor(private store: Store) {}
 
-  ngOnInit(): void {
-    this.searchStringFromKeyBoard$ = new Subject<string>();
-    this.searchStringFromKeyBoard$
-      .pipe(
-        filter((text: string) => text.length > 2),
-        debounceTime(400),
-        distinctUntilChanged()
-      )
-      .subscribe((searchString) => {
-        this.store.dispatch(loadSearchs({ searchString }));
-        return;
-      });
-  }
+  ngOnInit(): void {}
 
   keyup(text: string) {
killedBy: SearchComponent should store.dispatch(loadSearchs) after 400ms if keyup() is called with a string longer then 2 chars and should subscribe and set foundBooks
statusReason: Expected spy dispatch to have been called with:
  [ Object({ searchString: 'test', type: '[Search] Load Book Searchs' }) ]
but it was never called.

[Killed] EqualityOperator
src/app/search/search.component.ts:38:34
     this.searchStringFromKeyBoard$ = new Subject<string>();
     this.searchStringFromKeyBoard$
       .pipe(
-        filter((text: string) => text.length > 2),
+        filter((text: string) => text.length >= 2),
         debounceTime(400),
         distinctUntilChanged()
killedBy: SearchComponent should not store.dispatch(loadSearchs) after 400ms if keyup() is called with a string of only  2 chars and should not subscribe and set foundBooks
statusReason: Expected spy dispatch to have been called 0 times. It was called 1 times.

[Killed] BlockStatement
src/app/search/search.component.ts:42:36
         debounceTime(400),
         distinctUntilChanged()
       )
-      .subscribe((searchString) => {
-        this.store.dispatch(loadSearchs({ searchString }));
-        return;
-      });
+      .subscribe((searchString) => {});
   }
 
killedBy: SearchComponent should store.dispatch(loadSearchs) after 400ms if keyup() is called with a string longer then 2 chars and should subscribe and set foundBooks
statusReason: Expected spy dispatch to have been called with:
  [ Object({ searchString: 'test', type: '[Search] Load Book Searchs' }) ]
but it was never called.

[Killed] BlockStatement
src/app/search/search.component.ts:48:23
       });
   }
 
-  keyup(text: string) {
-    this.searchStringFromKeyBoard$?.next(text);
-  }
+  keyup(text: string) {}
 }
 
killedBy: SearchComponent should store.dispatch(loadSearchs) after 400ms if keyup() is called with a string longer then 2 chars and should subscribe and set foundBooks
statusReason: Expected spy dispatch to have been called with:
  [ Object({ searchString: 'test', type: '[Search] Load Book Searchs' }) ]
but it was never called.
