[Killed] BlockStatement
app/admin/shared/bodos-validator.service.ts:17:64
 })
 export class BodosValidatorService {
   constructor(private bookService: BookStoreService) {}
-  checkIsbn(control: AbstractControl): ValidationErrors | null {
-    //console.log('checkIsbn static ; formControl.value=' + control.value);
-    if (control.value.length != 10 && control.value.length != 13)
-      return { isbnLength: { valid: false } };
-    return null;
-  }
+  checkIsbn(control: AbstractControl): ValidationErrors | null {}
   checkAuthors(authorsFormArray: AbstractControl): ValidationErrors | null {
     if (
killedBy: BodosValidatorService should return null if value.length is 10 or 13
statusReason: Expected undefined to be null.

[Killed] ConditionalExpression
app/admin/shared/bodos-validator.service.ts:19:9
   constructor(private bookService: BookStoreService) {}
   checkIsbn(control: AbstractControl): ValidationErrors | null {
     //console.log('checkIsbn static ; formControl.value=' + control.value);
-    if (control.value.length != 10 && control.value.length != 13)
+    if (false)
       return { isbnLength: { valid: false } };
     return null;
killedBy: BodosValidatorService should return an error if value.length is not 10 or 13
statusReason: Expected null to equal Object({ isbnLength: Object({ valid: false }) }).

[Killed] ConditionalExpression
app/admin/shared/bodos-validator.service.ts:19:9
   constructor(private bookService: BookStoreService) {}
   checkIsbn(control: AbstractControl): ValidationErrors | null {
     //console.log('checkIsbn static ; formControl.value=' + control.value);
-    if (control.value.length != 10 && control.value.length != 13)
+    if (true)
       return { isbnLength: { valid: false } };
     return null;
killedBy: BodosValidatorService should return null if value.length is 10 or 13
statusReason: Expected Object({ isbnLength: Object({ valid: false }) }) to be null.

[Killed] BlockStatement
app/admin/shared/bodos-validator.service.ts:23:76
       return { isbnLength: { valid: false } };
     return null;
   }
-  checkAuthors(authorsFormArray: AbstractControl): ValidationErrors | null {
-    if (
-      (authorsFormArray as FormArray).controls.some(
-        (ele) => ele.value?.length > 0
-      )
-    ) {
-      return null;
-    } else {
-      return { oneAuthor: { valid: false } };
-    }
-  }
+  checkAuthors(authorsFormArray: AbstractControl): ValidationErrors | null {}
   asyncIsbnExistsValidator(): AsyncValidatorFn {
     return (control: AbstractControl): Observable<ValidationErrors | null> => {
killedBy: BodosValidatorService should return null if FormControlArray has at least one author
statusReason: Expected undefined to be null.

[Killed] BlockStatement
app/admin/shared/bodos-validator.service.ts:28:7
       (authorsFormArray as FormArray).controls.some(
         (ele) => ele.value?.length > 0
       )
-    ) {
-      return null;
-    } else {
+    ) {} else {
       return { oneAuthor: { valid: false } };
     }
killedBy: BodosValidatorService should return null if FormControlArray has at least one author
statusReason: Expected undefined to be null.

[Killed] BlockStatement
app/admin/shared/bodos-validator.service.ts:30:12
       )
     ) {
       return null;
-    } else {
-      return { oneAuthor: { valid: false } };
-    }
+    } else {}
   }
   asyncIsbnExistsValidator(): AsyncValidatorFn {
killedBy: BodosValidatorService should return { oneAuthor: { valid: false } } if FormControlArray has no author
statusReason: Expected undefined to equal Object({ oneAuthor: Object({ valid: false }) }).

[Killed] BlockStatement
app/admin/shared/bodos-validator.service.ts:34:48
       return { oneAuthor: { valid: false } };
     }
   }
-  asyncIsbnExistsValidator(): AsyncValidatorFn {
-    return (control: AbstractControl): Observable<ValidationErrors | null> => {
-      console.log('calling book Service for validation of isbn');
-      return this.bookService.getBookFast(control.value).pipe(
-        map((book) => {
-          return book ? { isbnExists: { valid: false } } : null;
-        }),
-        catchError(() => {
-          console.log('all good, since isbn does not yet exist');
-          return of(null);
-        })
-      );
-    };
-  }
+  asyncIsbnExistsValidator(): AsyncValidatorFn {}
 }
 
killedBy: BodosValidatorService should return error observable if book with this ISBN already exists
statusReason: TypeError: valFn is not a function

[Killed] BlockStatement
app/admin/shared/bodos-validator.service.ts:35:79
     }
   }
   asyncIsbnExistsValidator(): AsyncValidatorFn {
-    return (control: AbstractControl): Observable<ValidationErrors | null> => {
-      console.log('calling book Service for validation of isbn');
-      return this.bookService.getBookFast(control.value).pipe(
-        map((book) => {
-          return book ? { isbnExists: { valid: false } } : null;
-        }),
-        catchError(() => {
-          console.log('all good, since isbn does not yet exist');
-          return of(null);
-        })
-      );
-    };
+    return (control: AbstractControl): Observable<ValidationErrors | null> => {};
   }
 }
killedBy: BodosValidatorService should return error observable if book with this ISBN already exists
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] BlockStatement
app/admin/shared/bodos-validator.service.ts:38:23
     return (control: AbstractControl): Observable<ValidationErrors | null> => {
       console.log('calling book Service for validation of isbn');
       return this.bookService.getBookFast(control.value).pipe(
-        map((book) => {
-          return book ? { isbnExists: { valid: false } } : null;
-        }),
+        map((book) => {}),
         catchError(() => {
           console.log('all good, since isbn does not yet exist');
killedBy: BodosValidatorService should return error observable if book with this ISBN already exists
statusReason: Expected $[0].notification.value = undefined to equal Object({ isbnExists: Object({ valid: false }) }).

[Killed] BlockStatement
app/admin/shared/bodos-validator.service.ts:41:26
         map((book) => {
           return book ? { isbnExists: { valid: false } } : null;
         }),
-        catchError(() => {
-          console.log('all good, since isbn does not yet exist');
-          return of(null);
-        })
+        catchError(() => {})
       );
     };
killedBy: BodosValidatorService should return  observable of(null) if book with this ISBN does not exists yet
statusReason: Expected $.length = 1 to equal 2.
Expected $[0].notification.kind = 'E' to equal 'N'.
Expected $[0].notification.value = undefined to equal null.
Expected $[0].notification.error = TypeError: You provided 'undefined' where a stream was expected. You can provide an Observable, Promise, ReadableStream, Array, AsyncIterable, or Iterable. to equal undefined.
Expected $[1] = undefined to equal Object({
