[Killed] BlockStatement
src/app/shared/can-navigate-to-admin.guard.ts:22:15
     | Observable<boolean | UrlTree>
     | Promise<boolean | UrlTree>
     | boolean
-    | UrlTree {
-    if (!this.adminOk) {
-      const question = $localize`:@@CanCanvigateToAdminGuard\:question:Realy want to be Admin`;
-      this.adminOk = window.confirm(question);
-    }
-    return this.adminOk;
-  }
+    | UrlTree {}
 }
 
killedBy: CanNavigateToAdminGuard should return true if window.confirm is true
statusReason: Expected undefined to be true.
