[Killed] StringLiteral
src/app/search/search.actions.ts:15:3
 );
 
 export const loadSearchsFailure = createAction(
-  '[Search] Load Searchs Failure',
+  "",
   props<{ error: any }>()
 );
killedBy: SearchEffects  error case  should return a error action 
statusReason: Expected '' to equal '[Search] Load Searchs Failure'.
