[Killed] BooleanLiteral
src/app/search/search.reducer.ts:18:20
 
 export const initialSearchState: SearchState = {
   books: [],
-  searchPerformed: false,
+  searchPerformed: true,
   httpError: undefined
 };
killedBy: Search Reducer an unknown action should return the previous state
statusReason: Expected true to be false.

[Killed] BooleanLiteral
src/app/search/search.reducer.ts:28:24
     //do nothing, handled by effect, and don't delete the old search results yet!
     return {
       ...state,
-      searchPerformed: false
+      searchPerformed: true
     };
   }),
killedBy: Search Reducer an unknown action should delete the searchPerformed flag if loadSearchs action
statusReason: Expected $.searchPerformed = true to equal false.

[Killed] BooleanLiteral
src/app/search/search.reducer.ts:35:24
     return {
       ...state,
       books: action.searchResults,
-      searchPerformed: true
+      searchPerformed: false
     };
   }),
killedBy: Search Reducer an unknown action should delete the searchPerformed flag if loadSearchSuccess action
statusReason: Expected $.searchPerformed = false to equal true.

[Killed] BooleanLiteral
src/app/search/search.reducer.ts:42:24
   on(loadSearchsFailure, (state, action): SearchState => {
     return {
       ...state,
-      searchPerformed: true,
+      searchPerformed: false,
       httpError: action.error
     };
killedBy: Search Reducer an unknown action should delete the searchPerformed flag if loadSearchFailure action
statusReason: Expected $.searchPerformed = false to equal true.
