[Killed] StringLiteral
app/admin/book-edit/book-form.component.ts:96:61
 
   fillForm(book: Book) {
     this.editForm.get('title')?.setValue(book.title);
-    this.editForm.get('subtitle')?.setValue(book.subtitle + '');
+    this.editForm.get('subtitle')?.setValue(book.subtitle + "Stryker was here!");
     this.editForm.get('isbn')?.setValue(book.isbn + '');
     this.editForm.get('description')?.setValue(book.description + '');
killedBy: BookFormsComponent with existing book where AsyncValidatorFn is not used,  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given to ngOnChanges
statusReason: Expected spy emit to have been called with:
  [ Object({ authors: [ 'author' ], isbn: '1234567890', published: Date(Tue Feb 01 2022 19:00:00 GMT-0500 (Eastern Standard Time)), title: 'a title', subtitle: '', description: '', rating: 3 }) ]
but actual calls were:
  [ Object({ title: 'a title', subtitle: 'Stryker was here!', isbn: '1234567890', published: Date(Tue Feb 01 2022 19:00:00 GMT-0500 (East

[Killed] StringLiteral
app/admin/book-edit/book-form.component.ts:97:53
   fillForm(book: Book) {
     this.editForm.get('title')?.setValue(book.title);
     this.editForm.get('subtitle')?.setValue(book.subtitle + '');
-    this.editForm.get('isbn')?.setValue(book.isbn + '');
+    this.editForm.get('isbn')?.setValue(book.isbn + "Stryker was here!");
     this.editForm.get('description')?.setValue(book.description + '');
     this.editForm.get('published')?.setValue(book.published);
killedBy: BookFormsComponent with existing book where AsyncValidatorFn is not used,  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given to ngOnChanges
statusReason: Expected spy emit to have been called with:
  [ Object({ authors: [ 'author' ], isbn: '1234567890', published: Date(Tue Feb 01 2022 19:00:00 GMT-0500 (Eastern Standard Time)), title: 'a title', subtitle: '', description: '', rating: 3 }) ]
but actual calls were:
  [ Object({ title: 'a title', subtitle: '', isbn: '1234567890Stryker was here!', published: Date(Tue Feb 01 2022 19:00:00 GMT-0500 (East
