[Killed] ArrowFunction
src/app/search/search.selectors.ts:12:3
 
 export const selectSearchResults = createSelector(
   selectSearchState,
-  (state): BookEntity[] => state.books
+  () => undefined
 );
 
killedBy: SearchComponent should store.dispatch(loadSearchs) after 400ms if keyup() is called with a string longer then 2 chars and should subscribe and set foundBooks; Search Selectors should select the SearchResults
statusReason: Expected null to be truthy.
