[Killed] BooleanLiteral
app/admin/book-edit/book-edit.component.ts:17:11
 export class BookEditComponent implements OnInit {
   book$!: Observable<Book>;
 
-  saved = false;
+  saved = true;
   successMsg = '';
   loadingError$ = new Subject<string>();
killedBy: BookEditComponent with existing isbn number should call bookstoreservice and subscribe on saveBook() , error case
statusReason: Expected true to equal false.

[Killed] StringLiteral
app/admin/book-edit/book-edit.component.ts:21:22
   successMsg = '';
   loadingError$ = new Subject<string>();
   emptyDataError = 'got empty data from backend';
-  putSaveBookError = 'ERROR in http.put saveBook: ';
+  putSaveBookError = "";
   constructor(
     private route: ActivatedRoute,
killedBy: BookEditComponent with existing isbn number should call bookstoreservice and subscribe on saveBook() , error case
statusReason: Expected '{"headers":{"normalizedNames":{},"lazyUpdate":null,"headers":{}},"status":404,"statusText":"Unknown Error","url":null,"ok":false,"name":"HttpErrorResponse","message":"Http failure response for (unknown url): 404 undefined","error":null}' to contain 'ERROR in http.put saveBook: '.

[Killed] BlockStatement
app/admin/book-edit/book-edit.component.ts:27:20
     private bookStoreService: BookStoreService
   ) {}
 
-  ngOnInit(): void {
-    this.route.paramMap.subscribe((params) => {
-      let isbn = params.get('isbn');
-      this.book$ = this.bookStoreService.getBook(isbn).pipe(
-        tap((data) => {
-          if (data.title === undefined) {
-            setTimeout(() => this.loadingError$.next(this.emptyDataError), 0);
-            console.error(this.emptyDataError);
-          }
-        }),
-        catchError((error: HttpErrorResponse) => {
-          console.error(error.message);
-          // to avoid "Expression has changed after it was checked" - error
-          // to get the  error  displayed in the next change detection cycle, use "setTimeout"
-          setTimeout(() => this.loadingError$.next(error.message), 0);
-          return of({} as Book);
-        })
-      );
-    });
-  }
+  ngOnInit(): void {}
 
   saveBook(book: Book) {
killedBy: BookEditComponent but  isbn number does not exist and service thorws an error  should  show an error if isbn number does not exist ; BookEditComponent but  isbn number does not exist and service thorws NO error but an empty response  should  show an error if isbn number does not exist ; BookEditComponent with existing isbn number should create component and should call bookStoreService.get() with ISBN number on ngOnInit()
statusReason: Expected spy paramMap to have been called only once, and with given args:
  [  ]
But it was never called.


Error: Expected spy paramMap to have been called only once, and with given args:
  [  ]
But it was never called.

[Killed] BlockStatement
app/admin/book-edit/book-edit.component.ts:28:47
   ) {}
 
   ngOnInit(): void {
-    this.route.paramMap.subscribe((params) => {
-      let isbn = params.get('isbn');
-      this.book$ = this.bookStoreService.getBook(isbn).pipe(
-        tap((data) => {
-          if (data.title === undefined) {
-            setTimeout(() => this.loadingError$.next(this.emptyDataError), 0);
-            console.error(this.emptyDataError);
-          }
-        }),
-        catchError((error: HttpErrorResponse) => {
-          console.error(error.message);
-          // to avoid "Expression has changed after it was checked" - error
-          // to get the  error  displayed in the next change detection cycle, use "setTimeout"
-          setTimeout(() => this.loadingError$.next(error.message), 0);
-          return of({} as Book);
-        })
-      );
-    });
+    this.route.paramMap.subscribe((params) => {});
   }
 
killedBy: BookEditComponent but  isbn number does not exist and service thorws an error  should  show an error if isbn number does not exist ; BookEditComponent but  isbn number does not exist and service thorws NO error but an empty response  should  show an error if isbn number does not exist ; BookEditComponent with existing isbn number should create component and should call bookStoreService.get() with ISBN number on ngOnInit()
statusReason: Expected spy paramMap.get().get to have been called only once, and with given args:
  [ 'isbn' ]
But it was never called.


Error: Expected spy paramMap.get().get to have been called only once, and with given args:
  [ 'isbn' ]
But it was never called.

[Killed] BlockStatement
app/admin/book-edit/book-edit.component.ts:31:23
     this.route.paramMap.subscribe((params) => {
       let isbn = params.get('isbn');
       this.book$ = this.bookStoreService.getBook(isbn).pipe(
-        tap((data) => {
-          if (data.title === undefined) {
-            setTimeout(() => this.loadingError$.next(this.emptyDataError), 0);
-            console.error(this.emptyDataError);
-          }
-        }),
+        tap((data) => {}),
         catchError((error: HttpErrorResponse) => {
           console.error(error.message);
killedBy: BookEditComponent but  isbn number does not exist and service thorws NO error but an empty response  should  show an error if isbn number does not exist 
statusReason: TypeError: Cannot read properties of null (reading 'nativeElement')

[Killed] ConditionalExpression
app/admin/book-edit/book-edit.component.ts:32:15
       let isbn = params.get('isbn');
       this.book$ = this.bookStoreService.getBook(isbn).pipe(
         tap((data) => {
-          if (data.title === undefined) {
+          if (true) {
             setTimeout(() => this.loadingError$.next(this.emptyDataError), 0);
             console.error(this.emptyDataError);
killedBy: BookEditComponent with existing isbn number should create component and should call bookStoreService.get() with ISBN number on ngOnInit()
statusReason: Expected DebugElement({ nativeNode: <span _ngcontent-a-c48 id="errorMessage">...</span> }) to be null.

[Killed] BlockStatement
app/admin/book-edit/book-edit.component.ts:32:41
       let isbn = params.get('isbn');
       this.book$ = this.bookStoreService.getBook(isbn).pipe(
         tap((data) => {
-          if (data.title === undefined) {
-            setTimeout(() => this.loadingError$.next(this.emptyDataError), 0);
-            console.error(this.emptyDataError);
-          }
+          if (data.title === undefined) {}
         }),
         catchError((error: HttpErrorResponse) => {
killedBy: BookEditComponent but  isbn number does not exist and service thorws NO error but an empty response  should  show an error if isbn number does not exist 
statusReason: TypeError: Cannot read properties of null (reading 'nativeElement')

[Killed] ArrowFunction
app/admin/book-edit/book-edit.component.ts:33:24
       this.book$ = this.bookStoreService.getBook(isbn).pipe(
         tap((data) => {
           if (data.title === undefined) {
-            setTimeout(() => this.loadingError$.next(this.emptyDataError), 0);
+            setTimeout(() => undefined, 0);
             console.error(this.emptyDataError);
           }
killedBy: BookEditComponent but  isbn number does not exist and service thorws NO error but an empty response  should  show an error if isbn number does not exist 
statusReason: TypeError: Cannot read properties of null (reading 'nativeElement')

[Killed] ArrowFunction
app/admin/book-edit/book-edit.component.ts:41:22
           console.error(error.message);
           // to avoid "Expression has changed after it was checked" - error
           // to get the  error  displayed in the next change detection cycle, use "setTimeout"
-          setTimeout(() => this.loadingError$.next(error.message), 0);
+          setTimeout(() => undefined, 0);
           return of({} as Book);
         })
killedBy: BookEditComponent but  isbn number does not exist and service thorws an error  should  show an error if isbn number does not exist 
statusReason: TypeError: Cannot read properties of null (reading 'nativeElement')

[Killed] BlockStatement
app/admin/book-edit/book-edit.component.ts:48:24
     });
   }
 
-  saveBook(book: Book) {
-    this.bookStoreService.putBook(book).subscribe({
-      next: (res) => {
-        this.saved = true;
-        this.successMsg = res;
-        this.book$ = of(book);
-        setTimeout(() => (this.saved = false), 5000);
-      },
-      error: (error: HttpErrorResponse) => {
-        this.loadingError$.next(error.message);
-        console.error(this.putSaveBookError + JSON.stringify(error));
-      }
-    });
-  }
+  saveBook(book: Book) {}
 }
 
killedBy: BookEditComponent with existing isbn number to save a book, it should call bookstoreservice and subscribe on saveBook(), success case
statusReason: Expected spy unknown to have been called only once, and with given args:
  [ Object({ title: 'The Book Title', authors: [  ], published: Date(Thu Aug 25 2022 09:03:50 GMT-0700 (Pacific Daylight Time)), isbn: '' }) ]
But it was never called.


Error: Expected spy unknown to have been called only once, and with given args:
  [ Object({ title: 'The Book Title', authors: [  ], published: Date(Thu Aug

[Killed] ObjectLiteral
app/admin/book-edit/book-edit.component.ts:49:51
   }
 
   saveBook(book: Book) {
-    this.bookStoreService.putBook(book).subscribe({
-      next: (res) => {
-        this.saved = true;
-        this.successMsg = res;
-        this.book$ = of(book);
-        setTimeout(() => (this.saved = false), 5000);
-      },
-      error: (error: HttpErrorResponse) => {
-        this.loadingError$.next(error.message);
-        console.error(this.putSaveBookError + JSON.stringify(error));
-      }
-    });
+    this.bookStoreService.putBook(book).subscribe({});
   }
 }
killedBy: BookEditComponent with existing isbn number to save a book, it should call bookstoreservice and subscribe on saveBook(), success case
statusReason: Expected false to equal true.

[Killed] BlockStatement
app/admin/book-edit/book-edit.component.ts:50:22
 
   saveBook(book: Book) {
     this.bookStoreService.putBook(book).subscribe({
-      next: (res) => {
-        this.saved = true;
-        this.successMsg = res;
-        this.book$ = of(book);
-        setTimeout(() => (this.saved = false), 5000);
-      },
+      next: (res) => {},
       error: (error: HttpErrorResponse) => {
         this.loadingError$.next(error.message);
killedBy: BookEditComponent with existing isbn number to save a book, it should call bookstoreservice and subscribe on saveBook(), success case
statusReason: Expected false to equal true.

[Killed] BooleanLiteral
app/admin/book-edit/book-edit.component.ts:51:22
   saveBook(book: Book) {
     this.bookStoreService.putBook(book).subscribe({
       next: (res) => {
-        this.saved = true;
+        this.saved = false;
         this.successMsg = res;
         this.book$ = of(book);
killedBy: BookEditComponent with existing isbn number to save a book, it should call bookstoreservice and subscribe on saveBook(), success case
statusReason: Expected false to equal true.

[Killed] ArrowFunction
app/admin/book-edit/book-edit.component.ts:54:20
         this.saved = true;
         this.successMsg = res;
         this.book$ = of(book);
-        setTimeout(() => (this.saved = false), 5000);
+        setTimeout(() => undefined, 5000);
       },
       error: (error: HttpErrorResponse) => {
killedBy: BookEditComponent with existing isbn number to save a book, it should call bookstoreservice and subscribe on saveBook(), success case
statusReason: Expected true to equal false.

[Killed] BooleanLiteral
app/admin/book-edit/book-edit.component.ts:54:40
         this.saved = true;
         this.successMsg = res;
         this.book$ = of(book);
-        setTimeout(() => (this.saved = false), 5000);
+        setTimeout(() => (this.saved = true), 5000);
       },
       error: (error: HttpErrorResponse) => {
killedBy: BookEditComponent with existing isbn number to save a book, it should call bookstoreservice and subscribe on saveBook(), success case
statusReason: Expected true to equal false.

[Killed] BlockStatement
app/admin/book-edit/book-edit.component.ts:56:44
         this.book$ = of(book);
         setTimeout(() => (this.saved = false), 5000);
       },
-      error: (error: HttpErrorResponse) => {
-        this.loadingError$.next(error.message);
-        console.error(this.putSaveBookError + JSON.stringify(error));
-      }
+      error: (error: HttpErrorResponse) => {}
     });
   }
killedBy: BookEditComponent with existing isbn number should call bookstoreservice and subscribe on saveBook() , error case
statusReason: Expected spy error to have been called once. It was called 0 times.
