[Killed] ConditionalExpression
app/admin/book-edit/book-form.component.ts:44:9
 
   ngOnInit(): void {
     let isbnControl!: FormControl;
-    if (this.isNew) {
+    if (false) {
       isbnControl = new FormControl('', {
         validators: [this.bodosValidatorService.checkIsbn],
killedBy: BookFormsComponent with new book and AsyncValidatorFn or the checkAuthors validator  returns an error  should create the edit form, which should not be valid; BookFormsComponent with new book and isbnLength validator  returns an error  should create the edit form, which should not be valid
statusReason: Expected $.isbn = null to equal ''.

[Killed] ConditionalExpression
app/admin/book-edit/book-form.component.ts:44:9
 
   ngOnInit(): void {
     let isbnControl!: FormControl;
-    if (this.isNew) {
+    if (true) {
       isbnControl = new FormControl('', {
         validators: [this.bodosValidatorService.checkIsbn],
killedBy: BookFormsComponent with existing book where AsyncValidatorFn is not used,  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given to ngOnChanges
statusReason: Expected false to be true.

[Killed] ObjectLiteral
app/admin/book-edit/book-form.component.ts:45:41
   ngOnInit(): void {
     let isbnControl!: FormControl;
     if (this.isNew) {
-      isbnControl = new FormControl('', {
-        validators: [this.bodosValidatorService.checkIsbn],
-        asyncValidators: [this.bodosValidatorService.asyncIsbnExistsValidator()]
-      });
+      isbnControl = new FormControl('', {});
     } else {
       isbnControl = new FormControl(null, [
killedBy: BookFormsComponent with new book and AsyncValidatorFn or the checkAuthors validator  returns an error  should not be valid, if BodosValidatorService.asyncIsbnExistsValidator or checkAuthors finds an e; BookFormsComponent with new book and required or isbn validator that returns an error form should not be valid, when there is no isbn number, or rating is not valid
statusReason: Expected true to be false.

[Killed] BlockStatement
app/admin/book-edit/book-form.component.ts:49:12
         validators: [this.bodosValidatorService.checkIsbn],
         asyncValidators: [this.bodosValidatorService.asyncIsbnExistsValidator()]
       });
-    } else {
-      isbnControl = new FormControl(null, [
-        Validators.required,
-        this.bodosValidatorService.checkIsbn
-      ]);
-    }
+    } else {}
 
     this.editForm = this.fb.group({
killedBy: BookFormsComponent with existing book where AsyncValidatorFn is not used,  should disable the SAVE button, and show the error if ISBN is invalid or if there are no authors
statusReason: Expected spy unknown to have been called.

[Killed] StringLiteral
app/admin/book-edit/book-form.component.ts:58:17
 
     this.editForm = this.fb.group({
       title: ['', Validators.required],
-      subtitle: '',
+      subtitle: "Stryker was here!",
       isbn: isbnControl,
       published: [new Date('2022-08-10'), Validators.required],
killedBy: BookFormsComponent with new book and AsyncValidatorFn or the checkAuthors validator  returns an error  should create the edit form, which should not be valid; BookFormsComponent with new book and isbnLength validator  returns an error  should create the edit form, which should not be valid
statusReason: Expected $.subtitle = 'Stryker was here!' to equal ''.

[Killed] StringLiteral
app/admin/book-edit/book-form.component.ts:61:20
       subtitle: '',
       isbn: isbnControl,
       published: [new Date('2022-08-10'), Validators.required],
-      description: '',
+      description: "Stryker was here!",
       rating: [null, [Validators.min(0), Validators.max(5)]]
     });
killedBy: BookFormsComponent with new book and AsyncValidatorFn or the checkAuthors validator  returns an error  should create the edit form, which should not be valid; BookFormsComponent with new book and isbnLength validator  returns an error  should create the edit form, which should not be valid
statusReason: Expected $.description = 'Stryker was here!' to equal ''.

[Killed] ConditionalExpression
app/admin/book-edit/book-form.component.ts:64:9
       description: '',
       rating: [null, [Validators.min(0), Validators.max(5)]]
     });
-    if (this.isNew) {
+    if (false) {
       this.fillEmptyBook();
     } else if (this.aBook) {
killedBy: BookFormsComponent with new book and AsyncValidatorFn or the checkAuthors validator  returns an error  should create the edit form, which should not be valid; BookFormsComponent with new book and isbnLength validator  returns an error  should create the edit form, which should not be valid; BookFormsComponent with new book and AsyncValidatorFn that returns no errors should call bookFormSaveBook method, when button is clicked, and emit Event if Form is  valid
statusReason: Expected object to have properties
    authors: [ '' ]
    thumbnails: [ Object({ title: '', url: '' }) ]

[Killed] BlockStatement
app/admin/book-edit/book-form.component.ts:64:21
       description: '',
       rating: [null, [Validators.min(0), Validators.max(5)]]
     });
-    if (this.isNew) {
-      this.fillEmptyBook();
-    } else if (this.aBook) {
+    if (this.isNew) {} else if (this.aBook) {
       this.fillForm(this.aBook);
     }
killedBy: BookFormsComponent with new book and AsyncValidatorFn or the checkAuthors validator  returns an error  should create the edit form, which should not be valid; BookFormsComponent with new book and isbnLength validator  returns an error  should create the edit form, which should not be valid; BookFormsComponent with new book and AsyncValidatorFn that returns no errors should call bookFormSaveBook method, when button is clicked, and emit Event if Form is  valid
statusReason: Expected object to have properties
    authors: [ '' ]
    thumbnails: [ Object({ title: '', url: '' }) ]

[Killed] BlockStatement
app/admin/book-edit/book-form.component.ts:66:28
     });
     if (this.isNew) {
       this.fillEmptyBook();
-    } else if (this.aBook) {
-      this.fillForm(this.aBook);
-    }
+    } else if (this.aBook) {}
   }
   ngOnChanges(changes: SimpleChanges) {
killedBy: BookFormsComponent with existing book where AsyncValidatorFn is not used,  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given in advance to th
statusReason: Expected false to be true.

[Killed] BlockStatement
app/admin/book-edit/book-form.component.ts:70:39
       this.fillForm(this.aBook);
     }
   }
-  ngOnChanges(changes: SimpleChanges) {
-    const { aBook } = changes;
-    if (aBook.currentValue && !this.isNew) {
-      this.fillForm(aBook.currentValue);
-    }
-  }
+  ngOnChanges(changes: SimpleChanges) {}
 
   private fillEmptyBook() {
killedBy: BookFormsComponent with existing book where AsyncValidatorFn is not used,  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given to ngOnChanges
statusReason: Expected false to be true.

[Killed] BooleanLiteral
app/admin/book-edit/book-form.component.ts:72:31
   }
   ngOnChanges(changes: SimpleChanges) {
     const { aBook } = changes;
-    if (aBook.currentValue && !this.isNew) {
+    if (aBook.currentValue && this.isNew) {
       this.fillForm(aBook.currentValue);
     }
killedBy: BookFormsComponent with existing book where AsyncValidatorFn is not used,  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given to ngOnChanges
statusReason: Expected false to be true.

[Killed] ConditionalExpression
app/admin/book-edit/book-form.component.ts:72:9
   }
   ngOnChanges(changes: SimpleChanges) {
     const { aBook } = changes;
-    if (aBook.currentValue && !this.isNew) {
+    if (true) {
       this.fillForm(aBook.currentValue);
     }
killedBy: BookFormsComponent with existing book where AsyncValidatorFn is not used,  should not call fillForm if  ngOnChanges has no book 
statusReason: Expected spy fillForm to have been called 0 times. It was called 1 times.

[Killed] BlockStatement
app/admin/book-edit/book-form.component.ts:77:27
     }
   }
 
-  private fillEmptyBook() {
-    const authors = this.fb.array(
-      [],
-      [this.bodosValidatorService.checkAuthors]
-    );
-    authors.push(new FormControl(''));
-    this.editForm.setControl('authors', authors);
-    const thbArray = this.fb.array([]) as FormArray;
-    thbArray.push(
-      this.fb.group({
-        url: '',
-        title: ''
-      })
-    );
-    this.editForm.setControl('thumbnails', thbArray);
-  }
+  private fillEmptyBook() {}
 
   fillForm(book: Book) {
killedBy: BookFormsComponent with new book and AsyncValidatorFn or the checkAuthors validator  returns an error  should create the edit form, which should not be valid; BookFormsComponent with new book and isbnLength validator  returns an error  should create the edit form, which should not be valid; BookFormsComponent with new book and AsyncValidatorFn that returns no errors should call bookFormSaveBook method, when button is clicked, and emit Event if Form is  valid
statusReason: Expected object to have properties
    authors: [ '' ]
    thumbnails: [ Object({ title: '', url: '' }) ]

[Killed] ArrayDeclaration
app/admin/book-edit/book-form.component.ts:79:7
 
   private fillEmptyBook() {
     const authors = this.fb.array(
-      [],
+      ["Stryker was here"],
       [this.bodosValidatorService.checkAuthors]
     );
killedBy: BookFormsComponent with new book and AsyncValidatorFn or the checkAuthors validator  returns an error  should create the edit form, which should not be valid; BookFormsComponent with new book and isbnLength validator  returns an error  should create the edit form, which should not be valid; BookFormsComponent with new book and AsyncValidatorFn that returns no errors should call bookFormSaveBook method, when button is clicked, and emit Event if Form is  valid
statusReason: Expected $.authors.length = 2 to equal 1.
Expected $.authors[0] = 'Stryker was here' to equal ''.
Unexpected $.authors[1] = '' in array.

[Killed] ArrayDeclaration
app/admin/book-edit/book-form.component.ts:80:7
   private fillEmptyBook() {
     const authors = this.fb.array(
       [],
-      [this.bodosValidatorService.checkAuthors]
+      []
     );
     authors.push(new FormControl(''));
killedBy: BookFormsComponent with new book and AsyncValidatorFn or the checkAuthors validator  returns an error  should not be valid, if BodosValidatorService.asyncIsbnExistsValidator or checkAuthors finds an e
statusReason: Expected true to be false.

[Killed] StringLiteral
app/admin/book-edit/book-form.component.ts:82:34
       [],
       [this.bodosValidatorService.checkAuthors]
     );
-    authors.push(new FormControl(''));
+    authors.push(new FormControl("Stryker was here!"));
     this.editForm.setControl('authors', authors);
     const thbArray = this.fb.array([]) as FormArray;
killedBy: BookFormsComponent with new book and AsyncValidatorFn or the checkAuthors validator  returns an error  should create the edit form, which should not be valid; BookFormsComponent with new book and isbnLength validator  returns an error  should create the edit form, which should not be valid
statusReason: Expected $.authors[0] = 'Stryker was here!' to equal ''.

[Killed] StringLiteral
app/admin/book-edit/book-form.component.ts:83:30
       [this.bodosValidatorService.checkAuthors]
     );
     authors.push(new FormControl(''));
-    this.editForm.setControl('authors', authors);
+    this.editForm.setControl("", authors);
     const thbArray = this.fb.array([]) as FormArray;
     thbArray.push(
killedBy: BookFormsComponent with new book and AsyncValidatorFn or the checkAuthors validator  returns an error  should create the edit form, which should not be valid; BookFormsComponent with new book and isbnLength validator  returns an error  should create the edit form, which should not be valid; BookFormsComponent with new book and AsyncValidatorFn that returns no errors should call bookFormSaveBook method, when button is clicked, and emit Event if Form is  valid
statusReason: Expected object to have properties
    authors: [ '' ]
Expected object not to have properties
    : [ '' ]

[Killed] StringLiteral
app/admin/book-edit/book-form.component.ts:87:14
     const thbArray = this.fb.array([]) as FormArray;
     thbArray.push(
       this.fb.group({
-        url: '',
+        url: "Stryker was here!",
         title: ''
       })
killedBy: BookFormsComponent with new book and AsyncValidatorFn or the checkAuthors validator  returns an error  should create the edit form, which should not be valid; BookFormsComponent with new book and isbnLength validator  returns an error  should create the edit form, which should not be valid
statusReason: Expected $.thumbnails[0].url = 'Stryker was here!' to equal ''.

[Killed] StringLiteral
app/admin/book-edit/book-form.component.ts:91:30
         title: ''
       })
     );
-    this.editForm.setControl('thumbnails', thbArray);
+    this.editForm.setControl("", thbArray);
   }
 
killedBy: BookFormsComponent with new book and AsyncValidatorFn or the checkAuthors validator  returns an error  should create the edit form, which should not be valid; BookFormsComponent with new book and isbnLength validator  returns an error  should create the edit form, which should not be valid; BookFormsComponent with new book and AsyncValidatorFn that returns no errors should call bookFormSaveBook method, when button is clicked, and emit Event if Form is  valid
statusReason: Expected object to have properties
    thumbnails: [ Object({ title: '', url: '' }) ]
Expected object not to have properties
    : [ Object({ url: '', title: '' }) ]

[Killed] StringLiteral
app/admin/book-edit/book-form.component.ts:97:53
   fillForm(book: Book) {
     this.editForm.get('title')?.setValue(book.title);
     this.editForm.get('subtitle')?.setValue(book.subtitle);
-    this.editForm.get('isbn')?.setValue(book.isbn + '');
+    this.editForm.get('isbn')?.setValue(book.isbn + "Stryker was here!");
     this.editForm.get('description')?.setValue(book.description);
     this.editForm.get('published')?.setValue(book.published);
killedBy: BookFormsComponent with existing book where AsyncValidatorFn is not used,  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given to ngOnChanges
statusReason: Expected spy emit to have been called with:
  [ Object({ authors: [ 'author' ], isbn: '1234567890', published: Date(Tue Feb 01 2022 16:00:00 GMT-0800 (Pacific Standard Time)), title: 'a title', subtitle: 'a subtitle', description: 'a description', rating: 3 }) ]
but actual calls were:
  [ Object({ title: 'a title', subtitle: 'a subtitle', isbn: '1234567890Stryker was here!', published: Date(Tue Fe

[Killed] BlockStatement
app/admin/book-edit/book-form.component.ts:103:38
     this.editForm.get('rating')?.setValue(book.rating);
 
     let authors = this.fb.array([], [this.bodosValidatorService.checkAuthors]);
-    for (let author of book.authors) {
-      const fcAuthor = new FormControl(author);
-      authors.push(fcAuthor);
-    }
+    for (let author of book.authors) {}
     this.editForm.setControl('authors', authors);
     if (book.thumbnails) {
killedBy: BookFormsComponent with existing book where AsyncValidatorFn is not used,  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given to ngOnChanges
statusReason: Expected spy emit to have been called with:
  [ Object({ authors: [ 'author' ], isbn: '1234567890', published: Date(Tue Feb 01 2022 16:00:00 GMT-0800 (Pacific Standard Time)), title: 'a title', subtitle: 'a subtitle', description: 'a description', rating: 3 }) ]
but actual calls were:
  [ Object({ title: 'a title', subtitle: 'a subtitle', isbn: '1234567890', published: Date(Tue Feb 01 2022 16:00:0

[Killed] BlockStatement
app/admin/book-edit/book-form.component.ts:108:26
       authors.push(fcAuthor);
     }
     this.editForm.setControl('authors', authors);
-    if (book.thumbnails) {
-      let thumbnails = this.fb.array([] as FormGroup[]);
-      for (let thumb of book.thumbnails) {
-        const thumbG = this.fb.group({
-          url: thumb.url,
-          title: thumb.title
-        });
-        thumbnails.push(thumbG);
-      }
-      this.editForm.setControl('thumbnails', thumbnails);
-    }
+    if (book.thumbnails) {}
   }
 
killedBy: BookFormsComponent with existing book where AsyncValidatorFn is not used,  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given to ngOnChanges
statusReason: Expected spy emit to have been called with:
  [ Object({ authors: [ 'author' ], isbn: '1234567890', published: Date(Tue Feb 01 2022 16:00:00 GMT-0800 (Pacific Standard Time)), title: 'a title', subtitle: 'a subtitle', description: 'a description', rating: 3, thumbnails: [ Object({ title: '', url: '' }) ] }) ]
but actual calls were:
  [ Object({ title: 'a title', subtitle: 'a subtitle', isbn: '1234

[Killed] BlockStatement
app/admin/book-edit/book-form.component.ts:110:42
     this.editForm.setControl('authors', authors);
     if (book.thumbnails) {
       let thumbnails = this.fb.array([] as FormGroup[]);
-      for (let thumb of book.thumbnails) {
-        const thumbG = this.fb.group({
-          url: thumb.url,
-          title: thumb.title
-        });
-        thumbnails.push(thumbG);
-      }
+      for (let thumb of book.thumbnails) {}
       this.editForm.setControl('thumbnails', thumbnails);
     }
killedBy: BookFormsComponent with existing book where AsyncValidatorFn is not used,  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given to ngOnChanges
statusReason: Expected spy emit to have been called with:
  [ Object({ authors: [ 'author' ], isbn: '1234567890', published: Date(Tue Feb 01 2022 16:00:00 GMT-0800 (Pacific Standard Time)), title: 'a title', subtitle: 'a subtitle', description: 'a description', rating: 3, thumbnails: [ Object({ title: '', url: '' }) ] }) ]
but actual calls were:
  [ Object({ title: 'a title', subtitle: 'a subtitle', isbn: '1234

[Killed] ObjectLiteral
app/admin/book-edit/book-form.component.ts:111:38
     if (book.thumbnails) {
       let thumbnails = this.fb.array([] as FormGroup[]);
       for (let thumb of book.thumbnails) {
-        const thumbG = this.fb.group({
-          url: thumb.url,
-          title: thumb.title
-        });
+        const thumbG = this.fb.group({});
         thumbnails.push(thumbG);
       }
killedBy: BookFormsComponent with existing book where AsyncValidatorFn is not used,  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given to ngOnChanges
statusReason: Error: Cannot find control with path: 'thumbnails -> 0 -> url'

[Killed] BlockStatement
app/admin/book-edit/book-form.component.ts:131:22
     return this.editForm.get('thumbnails') as FormArray;
   }
 
-  bookFormSaveBook() {
-    if (this.editForm.valid) {
-      this.saveBookEventEmitter.emit(this.editForm.value as Book);
-    } else {
-      throw new Error('bookFormSave called although form is not valid!');
-    }
-  }
+  bookFormSaveBook() {}
 
   addAuthor() {
killedBy: BookFormsComponent with existing book where AsyncValidatorFn is not used,  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given to ngOnChanges; BookFormsComponent with new book and AsyncValidatorFn or the checkAuthors validator  returns an error  should call bookFormSaveBook method, when button is clicked, but not emit Event if Form is not va; BookFormsComponent with new book and AsyncValidatorFn that returns no errors should call bookFormSaveBook method, when button is clicked, and emit Event if Form is  valid
statusReason: Expected spy emit to have been called with:
  [ Object({ authors: [ 'author' ], isbn: '1234567890', published: Date(Tue Feb 01 2022 16:00:00 GMT-0800 (Pacific Standard Time)), title: 'a title', subtitle: 'a subtitle', description: 'a description', rating: 3 }) ]
but it was never called.

[Killed] ConditionalExpression
app/admin/book-edit/book-form.component.ts:132:9
   }
 
   bookFormSaveBook() {
-    if (this.editForm.valid) {
+    if (false) {
       this.saveBookEventEmitter.emit(this.editForm.value as Book);
     } else {
killedBy: BookFormsComponent with existing book where AsyncValidatorFn is not used,  form should be valid and emit the new book data to the saveBookEventEmitter Output emitterif a book is given to ngOnChanges; BookFormsComponent with new book and AsyncValidatorFn that returns no errors should call bookFormSaveBook method, when button is clicked, and emit Event if Form is  valid
statusReason: Expected spy emit to have been called with:
  [ Object({ authors: [ 'author' ], isbn: '1234567890', published: Date(Tue Feb 01 2022 16:00:00 GMT-0800 (Pacific Standard Time)), title: 'a title', subtitle: 'a subtitle', description: 'a description', rating: 3 }) ]
but it was never called.

[Killed] ConditionalExpression
app/admin/book-edit/book-form.component.ts:132:9
   }
 
   bookFormSaveBook() {
-    if (this.editForm.valid) {
+    if (true) {
       this.saveBookEventEmitter.emit(this.editForm.value as Book);
     } else {
killedBy: BookFormsComponent with new book and AsyncValidatorFn or the checkAuthors validator  returns an error  should call bookFormSaveBook method, when button is clicked, but not emit Event if Form is not va
statusReason: Expected function to throw an Error.

[Killed] BlockStatement
app/admin/book-edit/book-form.component.ts:134:12
   bookFormSaveBook() {
     if (this.editForm.valid) {
       this.saveBookEventEmitter.emit(this.editForm.value as Book);
-    } else {
-      throw new Error('bookFormSave called although form is not valid!');
-    }
+    } else {}
   }
 
killedBy: BookFormsComponent with new book and AsyncValidatorFn or the checkAuthors validator  returns an error  should call bookFormSaveBook method, when button is clicked, but not emit Event if Form is not va
statusReason: Expected function to throw an Error.

[Killed] StringLiteral
app/admin/book-edit/book-form.component.ts:135:23
     if (this.editForm.valid) {
       this.saveBookEventEmitter.emit(this.editForm.value as Book);
     } else {
-      throw new Error('bookFormSave called although form is not valid!');
+      throw new Error("");
     }
   }
killedBy: BookFormsComponent with new book and AsyncValidatorFn or the checkAuthors validator  returns an error  should call bookFormSaveBook method, when button is clicked, but not emit Event if Form is not va
statusReason: Expected function to throw an exception with message 'bookFormSave called although form is not valid!', but it threw an exception with message ''.

[Killed] BlockStatement
app/admin/book-edit/book-form.component.ts:139:15
     }
   }
 
-  addAuthor() {
-    const fcAuthor = new FormControl(null);
-    this.authors.push(fcAuthor);
-  }
+  addAuthor() {}
 
   removeAuthor(i: number) {
killedBy: BookFormsComponent with existing book where AsyncValidatorFn is not used,  should add an author, if add button is clicked; BookFormsComponent with new book and AsyncValidatorFn that returns no errors should call addAuthor method, when add Author is clicked, same with removeAuthor
statusReason: Expected 1 to equal 2.

[Killed] BlockStatement
app/admin/book-edit/book-form.component.ts:144:27
     this.authors.push(fcAuthor);
   }
 
-  removeAuthor(i: number) {
-    this.authors.removeAt(i);
-  }
+  removeAuthor(i: number) {}
 
   addThumb() {
killedBy: BookFormsComponent with existing book where AsyncValidatorFn is not used,  should disable the SAVE button, and show the error if ISBN is invalid or if there are no authors; BookFormsComponent with new book and AsyncValidatorFn that returns no errors should call addAuthor method, when add Author is clicked, same with removeAuthor
statusReason: Expected 1 to equal 0.

[Killed] BlockStatement
app/admin/book-edit/book-form.component.ts:148:14
     this.authors.removeAt(i);
   }
 
-  addThumb() {
-    //console.log('add thumb called in book-form');
-    // const thumbG = this.fb.group({
-    //   url: '',
-    //   title: ''
-    // });
-    const thumbG = this.fb.group({});
-    this.thumbnails.push(thumbG);
-  }
+  addThumb() {}
 
   removeThumb(j: number) {
killedBy: BookFormsComponent with new book and AsyncValidatorFn that returns no errors should call addThumb method, when add Thumb is clicked, same with ThumbAuthor
statusReason: Expected 1 to equal 2.

[Killed] BlockStatement
app/admin/book-edit/book-form.component.ts:158:26
     this.thumbnails.push(thumbG);
   }
 
-  removeThumb(j: number) {
-    this.thumbnails.removeAt(j);
-  }
+  removeThumb(j: number) {}
 }
 
killedBy: BookFormsComponent with new book and AsyncValidatorFn that returns no errors should call addThumb method, when add Thumb is clicked, same with ThumbAuthor
statusReason: Expected 2 to equal 1.
