[Killed] StringLiteral
src/app/shared/book-factory.service.ts:37:14
   }
   static getEmptyBook(): BookEntity {
     return {
-      title: '',
+      title: "Stryker was here!",
       subtitle: '',
       authors: [],
killedBy: BookFactoryService should get an empty book
statusReason: Expected 'Stryker was here!' to equal ''.

[Killed] StringLiteral
src/app/shared/book-factory.service.ts:40:27
       title: '',
       subtitle: '',
       authors: [],
-      published: new Date('1970-01-01'),
+      published: new Date(""),
       isbn: '',
       thumbnails: [],
killedBy: BookFactoryService should get an empty book
statusReason: RangeError: Invalid time value
