[Killed] StringLiteral
src/app/shared/book-store.service.ts:16:12
   providedIn: 'root'
 })
 export class BookStoreService {
-  server = `https://api4.angular-buch.com/secure`;
+  server = ``;
   //server = 'http://localhost:3000';
   constructor(private http: HttpClient) {}
killedBy: BookStoreService  with Testbed should call deleteBook() and delete a book with isbn with 3 retries , if the first and second try fails; BookStoreService  but without Testbed getAllEntities() should call http GET with url and return a Book array converted from BookRaw array
statusReason: Error: Expected one matching request for criteria "Match URL: https://api4.angular-buch.com/secure/book/123", found none. Requests received are: DELETE /book/123.

[Killed] StringLiteral
src/app/shared/book-store.service.ts:22:15
 
   deleteBook(isbn: string | undefined): Observable<string> {
     return this.http
-      .delete(`${this.server}/book/${isbn}`, {
+      .delete(``, {
         responseType: 'text' // needed because the api will not answer with JSON, but Angulars HttpClient defaults zu JSON
       })
killedBy: BookStoreService  with Testbed should call deleteBook() and delete a book with isbn with 3 retries , if the first and second try fails
statusReason: Error: Expected one matching request for criteria "Match URL: https://api4.angular-buch.com/secure/book/123", found none. Requests received are: DELETE .

[Killed] StringLiteral
src/app/shared/book-store.service.ts:32:13
     const bookRaw = BookFactoryService.getRawFromBook(book);
 
     return this.http
-      .post(`${this.server}/book`, bookRaw, {
+      .post(``, bookRaw, {
         responseType: 'text'
       })
killedBy: BookStoreService  but without Testbed postBook() should call http POST with book and return ok
statusReason: Expected spy httpStub.post to have been called only once, and with given args:
  [ 'https://api4.angular-buch.com/secure/book', Object({ title: 'string', authors: [  ], published: '2020-02-01T01:00:00+0100', isbn: '123' }), Object({ responseType: 'text' }) ]
But the actual call was:
  [ '', Object({ title: 'string', authors: [  ], published: '2020-02-01T01:00:00+0100', isbn: '123' }), Object({ res

[Killed] StringLiteral
src/app/shared/book-store.service.ts:40:12
   putBook(book: BookEntity): Observable<string> {
     const bookRaw = BookFactoryService.getRawFromBook(book);
     return this.http
-      .put(`${this.server}/book/${book.isbn}`, bookRaw, {
+      .put(``, bookRaw, {
         responseType: 'text'
       })
killedBy: BookStoreService  but without Testbed putBook() should call http PUT with book and return ok
statusReason: Expected spy httpStub.put to have been called only once, and with given args:
  [ 'https://api4.angular-buch.com/secure/book/123', Object({ title: 'string', authors: [  ], published: '2020-02-01T01:00:00+0100', isbn: '123' }), Object({ responseType: 'text' }) ]
But the actual call was:
  [ '', Object({ title: 'string', authors: [  ], published: '2020-02-01T01:00:00+0100', isbn: '123' }), Object({

[Killed] StringLiteral
src/app/shared/book-store.service.ts:62:37
   }
 
   getAllEntities(): Observable<BookEntity[]> {
-    return this.http.get<BookRaw[]>(`${this.server}/books`).pipe(
+    return this.http.get<BookRaw[]>(``).pipe(
       retry({ count: 2, delay: 400 }),
       catchError(this.processError),
killedBy: BookStoreService  with Testbed should call getAllEntities() to get a book with isbn with 3 retries , if the first and second try fails; BookStoreService  but without Testbed getAllEntities() should call http GET with url and return a Book array converted from BookRaw array
statusReason: Error: Expected one matching request for criteria "Match URL: https://api4.angular-buch.com/secure/books", found none. Requests received are: GET .

[Killed] StringLiteral
src/app/shared/book-store.service.ts:75:37
   }
 
   getAllSearch(text: string): Observable<BookEntity[]> {
-    return this.http.get<BookRaw[]>(`${this.server}/books/search/${text}`).pipe(
+    return this.http.get<BookRaw[]>(``).pipe(
       retry({ count: 2, delay: 100 }),
       catchError(this.processError),
killedBy: BookStoreService  with Testbed should call getAllSearch() to get a book with isbn with 3 retries , if the first and second try fails; BookStoreService  but without Testbed getAllSearch() should call http get with search string and return list of books
statusReason: Error: Expected one matching request for criteria "Match URL: https://api4.angular-buch.com/secure/books/search/searchstring", found none. Requests received are: GET .

[Killed] ObjectLiteral
src/app/shared/book-store.service.ts:76:13
 
   getAllSearch(text: string): Observable<BookEntity[]> {
     return this.http.get<BookRaw[]>(`${this.server}/books/search/${text}`).pipe(
-      retry({ count: 2, delay: 100 }),
+      retry({}),
       catchError(this.processError),
       map((rawBooksArray: BookRaw[]): BookEntity[] =>
killedBy: BookStoreService  with Testbed should call getAllSearch() to get a book with isbn with 3 retries , but all 3 retrials fail
statusReason: Error: Expected no open requests, found 1: GET https://api4.angular-buch.com/secure/books/search/searchstring
