[Killed] BooleanLiteral
app/admin/create-book/create-book.component.ts:13:11
 })
 export class CreateBookComponent implements OnDestroy {
   errorMessage: string | undefined;
-  saved = false;
+  saved = true;
   successMsg = '';
   subscription: Subscription | undefined;
killedBy: CreateBookComponent should create, set "save" to true for 5 sec and set successmessage to the result
statusReason: Expected true to be false.

[Killed] BlockStatement
app/admin/create-book/create-book.component.ts:18:30
   subscription: Subscription | undefined;
   constructor(private bookStoreService: BookStoreService) {}
 
-  createBookSave(book: Book) {
-    this.subscription = this.bookStoreService.postBook(book).subscribe({
-      next: (res) => {
-        this.saved = true;
-        this.successMsg = res;
-        setTimeout(() => (this.saved = false), 5000);
-      },
-      error: (err) => {
-        console.error('ERROR in createBookSave: ' + JSON.stringify(err));
-        this.errorMessage = JSON.stringify(err);
-      }
-    });
-  }
+  createBookSave(book: Book) {}
   ngOnDestroy() {
     if (this.subscription) {
killedBy: CreateBookComponent should create, set "save" to true for 5 sec and set successmessage to the result
statusReason: Expected spy unknown to have been called only once, and with given args:
  [ Object({ authors: [ 'author' ], isbn: '1234567890', published: Date(Tue Feb 01 2022 16:00:00 GMT-0800 (Pacific Standard Time)), title: 'a title', subtitle: '', description: '', rating: 3, thumbnails: [ Object({ title: '', url: '' }) ] }) ]
But it was never called.


Error: Expected spy unknown to have been called only onc

[Killed] BlockStatement
app/admin/create-book/create-book.component.ts:20:22
 
   createBookSave(book: Book) {
     this.subscription = this.bookStoreService.postBook(book).subscribe({
-      next: (res) => {
-        this.saved = true;
-        this.successMsg = res;
-        setTimeout(() => (this.saved = false), 5000);
-      },
+      next: (res) => {},
       error: (err) => {
         console.error('ERROR in createBookSave: ' + JSON.stringify(err));
killedBy: CreateBookComponent should create, set "save" to true for 5 sec and set successmessage to the result
statusReason: Expected false to be true.

[Killed] BooleanLiteral
app/admin/create-book/create-book.component.ts:23:40
       next: (res) => {
         this.saved = true;
         this.successMsg = res;
-        setTimeout(() => (this.saved = false), 5000);
+        setTimeout(() => (this.saved = true), 5000);
       },
       error: (err) => {
killedBy: CreateBookComponent should create, set "save" to true for 5 sec and set successmessage to the result
statusReason: Expected true to be false.

[Killed] ArrowFunction
app/admin/create-book/create-book.component.ts:23:20
       next: (res) => {
         this.saved = true;
         this.successMsg = res;
-        setTimeout(() => (this.saved = false), 5000);
+        setTimeout(() => undefined, 5000);
       },
       error: (err) => {
killedBy: CreateBookComponent should create, set "save" to true for 5 sec and set successmessage to the result
statusReason: Expected true to be false.

[Killed] BlockStatement
app/admin/create-book/create-book.component.ts:25:23
         this.successMsg = res;
         setTimeout(() => (this.saved = false), 5000);
       },
-      error: (err) => {
-        console.error('ERROR in createBookSave: ' + JSON.stringify(err));
-        this.errorMessage = JSON.stringify(err);
-      }
+      error: (err) => {}
     });
   }
killedBy: CreateBookComponent should create, set errorMsg 
statusReason: Expected undefined to contain '404'.

[Killed] BlockStatement
app/admin/create-book/create-book.component.ts:31:17
       }
     });
   }
-  ngOnDestroy() {
-    if (this.subscription) {
-      this.subscription.unsubscribe();
-    }
-  }
+  ngOnDestroy() {}
 }
 
killedBy: CreateBookComponent should unsubscribe when component is disposed 
statusReason: Expected spy unsubscribe to have been called.

[Killed] BlockStatement
app/admin/create-book/create-book.component.ts:32:28
     });
   }
   ngOnDestroy() {
-    if (this.subscription) {
-      this.subscription.unsubscribe();
-    }
+    if (this.subscription) {}
   }
 }
killedBy: CreateBookComponent should unsubscribe when component is disposed 
statusReason: Expected spy unsubscribe to have been called.
