[Killed] ObjectLiteral
app/admin/form-messages/form-messages.component.ts:13:17
   @Input() control: AbstractControl | null = null;
   @Input() controlName: string | null = null;
 
-  errorstruct = {
-    title: {
-      required: 'A Title is required'
-    },
-    isbn: {
-      required: 'ISBN Number is required',
-      maxlength: 'not longer then 13 chars',
-      minlength: 'at least 11 chars',
-      isbnLength: 'ISBN not valid, must be 10 or 13 digits',
-      isbnExists: 'ISBN already exists'
-    },
-    authors: {
-      oneAuthor: 'we need at least one Author'
-    }
-  };
+  errorstruct = {};
 
   constructor() {}
killedBy: FormMessagesComponent should create an array of errormessage that fit to a "title" control 
statusReason: TypeError: Cannot read properties of undefined (reading 'required')

[Killed] ObjectLiteral
app/admin/form-messages/form-messages.component.ts:17:11
     title: {
       required: 'A Title is required'
     },
-    isbn: {
-      required: 'ISBN Number is required',
-      maxlength: 'not longer then 13 chars',
-      minlength: 'at least 11 chars',
-      isbnLength: 'ISBN not valid, must be 10 or 13 digits',
-      isbnExists: 'ISBN already exists'
-    },
+    isbn: {},
     authors: {
       oneAuthor: 'we need at least one Author'
killedBy: FormMessagesComponent should create an array of errormessage that fit to a "isbn" control 
statusReason: Expected $[0] = undefined to equal 'at least 11 chars'.

[Killed] StringLiteral
app/admin/form-messages/form-messages.component.ts:19:18
     },
     isbn: {
       required: 'ISBN Number is required',
-      maxlength: 'not longer then 13 chars',
+      maxlength: "",
       minlength: 'at least 11 chars',
       isbnLength: 'ISBN not valid, must be 10 or 13 digits',
killedBy: FormMessagesComponent should create re maxlen errormessage that fit to a "isbn" control 
statusReason: Expected $[0] = '' to equal 'not longer then 13 chars'.

[Killed] StringLiteral
app/admin/form-messages/form-messages.component.ts:21:19
       required: 'ISBN Number is required',
       maxlength: 'not longer then 13 chars',
       minlength: 'at least 11 chars',
-      isbnLength: 'ISBN not valid, must be 10 or 13 digits',
+      isbnLength: "",
       isbnExists: 'ISBN already exists'
     },
killedBy: FormMessagesComponent should create  ISBN not valid, must be 10 or 13 digits errormessage that fit to a "isbn" control 
statusReason: Expected $[0] = '' to equal 'ISBN not valid, must be 10 or 13 digits'.

[Killed] StringLiteral
app/admin/form-messages/form-messages.component.ts:22:19
       maxlength: 'not longer then 13 chars',
       minlength: 'at least 11 chars',
       isbnLength: 'ISBN not valid, must be 10 or 13 digits',
-      isbnExists: 'ISBN already exists'
+      isbnExists: ""
     },
     authors: {
killedBy: FormMessagesComponent should create  ISBN already exists errormessage that fit to a "isbn" control 
statusReason: Expected $[0] = '' to equal 'ISBN already exists'.

[Killed] ObjectLiteral
app/admin/form-messages/form-messages.component.ts:24:14
       isbnLength: 'ISBN not valid, must be 10 or 13 digits',
       isbnExists: 'ISBN already exists'
     },
-    authors: {
-      oneAuthor: 'we need at least one Author'
-    }
+    authors: {}
   };
 
killedBy: FormMessagesComponent should create an array of errormessage that fit to a "authors" control 
statusReason: Expected $[0] = undefined to equal 'we need at least one Author'.

[Killed] ConditionalExpression
app/admin/form-messages/form-messages.component.ts:32:9
   constructor() {}
 
   errorsForControl(): string[] {
-    if (this.control?.errors) {
+    if (false) {
       let valErrors: ValidationErrors = this.control
         ?.errors as ValidationErrors;
killedBy: FormMessagesComponent should create an array of errormessage that fit to a "title" control 
statusReason: Expected $.length = 0 to equal 1.
Expected $[0] = undefined to equal 'A Title is required'.

[Killed] ConditionalExpression
app/admin/form-messages/form-messages.component.ts:32:9
   constructor() {}
 
   errorsForControl(): string[] {
-    if (this.control?.errors) {
+    if (true) {
       let valErrors: ValidationErrors = this.control
         ?.errors as ValidationErrors;
killedBy: FormMessagesComponent should create no errormessage  
statusReason: TypeError: Cannot convert undefined or null to object
