[Killed] BlockStatement
app/shared/notification-alert/notification-alert.component.ts:19:11
 
   constructor() {}
 
-  close() {
-    this.closeErrorEventEmitter.emit();
-  }
+  close() {}
 
   stringify(error: any, param2: any, param3: any) {
killedBy: BookDetailsComponent and IsbnPipe should show  http errors if any  and if clicked on close, the error message should disapear; NotificationAlertComponent should close messsage when click() on close svg
statusReason: Expected spy dispatch to have been called only once, and with given args:
  [ Object({ type: '[BookEntity/API] Error reset' }) ]
But it was never called.


Error: Expected spy dispatch to have been called only once, and with given args:
  [ Object({ type: '[BookEntity/API] Error reset' }) ]
But it was never called.

[Killed] BlockStatement
app/shared/notification-alert/notification-alert.component.ts:23:51
     this.closeErrorEventEmitter.emit();
   }
 
-  stringify(error: any, param2: any, param3: any) {
-    //error?.http?.error
-    const parser = new DOMParser();
-    const doc = parser.parseFromString(error.httpError.error, 'text/html');
-    const errorTxt = doc.getElementsByTagName('pre')[0]?.textContent;
-    error = { ...error, http: { ...error.httpError, error: errorTxt } };
-    return JSON.stringify(error.http, param2, param3);
-  }
+  stringify(error: any, param2: any, param3: any) {}
 }
 
killedBy: NotificationAlertComponent should show httpError and error message
statusReason: Expected ' Status: 404  HTTP-Error-Response: ' to contain 'message3'.

[Killed] OptionalChaining
app/shared/notification-alert/notification-alert.component.ts:27:22
     //error?.http?.error
     const parser = new DOMParser();
     const doc = parser.parseFromString(error.httpError.error, 'text/html');
-    const errorTxt = doc.getElementsByTagName('pre')[0]?.textContent;
+    const errorTxt = doc.getElementsByTagName('pre')[0].textContent;
     error = { ...error, http: { ...error.httpError, error: errorTxt } };
     return JSON.stringify(error.http, param2, param3);
killedBy: BookDetailsComponent and IsbnPipe should show  http errors if any  and if clicked on close, the error message should disapear; NotificationAlertComponent should close messsage when click() on close svg
statusReason: TypeError: Cannot read properties of undefined (reading 'textContent')

[Killed] StringLiteral
app/shared/notification-alert/notification-alert.component.ts:27:47
     //error?.http?.error
     const parser = new DOMParser();
     const doc = parser.parseFromString(error.httpError.error, 'text/html');
-    const errorTxt = doc.getElementsByTagName('pre')[0]?.textContent;
+    const errorTxt = doc.getElementsByTagName("")[0]?.textContent;
     error = { ...error, http: { ...error.httpError, error: errorTxt } };
     return JSON.stringify(error.http, param2, param3);
killedBy: NotificationAlertComponent should show httpError and error message
statusReason: Expected ' Status: 404  HTTP-Error-Response: {
  "headers": {
    "normalizedNames": {},
    "lazyUpdate": null,
    "headers": {}
  },
  "status": 404,
  "statusText": "message1",

[Killed] ObjectLiteral
app/shared/notification-alert/notification-alert.component.ts:28:13
     const parser = new DOMParser();
     const doc = parser.parseFromString(error.httpError.error, 'text/html');
     const errorTxt = doc.getElementsByTagName('pre')[0]?.textContent;
-    error = { ...error, http: { ...error.httpError, error: errorTxt } };
+    error = {};
     return JSON.stringify(error.http, param2, param3);
   }
killedBy: NotificationAlertComponent should show httpError and error message
statusReason: Expected ' Status: 404  HTTP-Error-Response: ' to contain 'message3'.
