[Killed] ConditionalExpression
app/admin/shared/bodos-validator.service.ts:18:9
 export class BodosValidatorService {
   constructor(private bookService: BookStoreService) {}
   checkIsbn(control: AbstractControl): ValidationErrors | null {
-    if (!control.value) return { isbnLength: { valid: false } };
+    if (true) return { isbnLength: { valid: false } };
     if (control.value.length != 10 && control.value.length != 13)
       return { isbnLength: { valid: false } };
killedBy: BodosValidatorService should return null if value.length is 10 or 13
statusReason: Expected Object({ isbnLength: Object({ valid: false }) }) to be null.

[Killed] BooleanLiteral
app/admin/shared/bodos-validator.service.ts:18:55
 export class BodosValidatorService {
   constructor(private bookService: BookStoreService) {}
   checkIsbn(control: AbstractControl): ValidationErrors | null {
-    if (!control.value) return { isbnLength: { valid: false } };
+    if (!control.value) return { isbnLength: { valid: true } };
     if (control.value.length != 10 && control.value.length != 13)
       return { isbnLength: { valid: false } };
killedBy: BodosValidatorService should return an error if control.value is not defined
statusReason: Expected $.isbnLength.valid = true to equal false.

[Killed] ConditionalExpression
app/admin/shared/bodos-validator.service.ts:19:9
   constructor(private bookService: BookStoreService) {}
   checkIsbn(control: AbstractControl): ValidationErrors | null {
     if (!control.value) return { isbnLength: { valid: false } };
-    if (control.value.length != 10 && control.value.length != 13)
+    if (false)
       return { isbnLength: { valid: false } };
     return null;
killedBy: BodosValidatorService should return an error if value.length is not 10 or 13
statusReason: Expected null to equal Object({ isbnLength: Object({ valid: false }) }).

[Killed] ConditionalExpression
app/admin/shared/bodos-validator.service.ts:19:9
   constructor(private bookService: BookStoreService) {}
   checkIsbn(control: AbstractControl): ValidationErrors | null {
     if (!control.value) return { isbnLength: { valid: false } };
-    if (control.value.length != 10 && control.value.length != 13)
+    if (true)
       return { isbnLength: { valid: false } };
     return null;
killedBy: BodosValidatorService should return null if value.length is 10 or 13
statusReason: Expected Object({ isbnLength: Object({ valid: false }) }) to be null.

[Killed] BooleanLiteral
app/admin/shared/bodos-validator.service.ts:20:37
   checkIsbn(control: AbstractControl): ValidationErrors | null {
     if (!control.value) return { isbnLength: { valid: false } };
     if (control.value.length != 10 && control.value.length != 13)
-      return { isbnLength: { valid: false } };
+      return { isbnLength: { valid: true } };
     return null;
   }
killedBy: BodosValidatorService should return an error if value.length is not 10 or 13
statusReason: Expected $.isbnLength.valid = true to equal false.

[Killed] ObjectLiteral
app/admin/shared/bodos-validator.service.ts:20:28
   checkIsbn(control: AbstractControl): ValidationErrors | null {
     if (!control.value) return { isbnLength: { valid: false } };
     if (control.value.length != 10 && control.value.length != 13)
-      return { isbnLength: { valid: false } };
+      return { isbnLength: {} };
     return null;
   }
killedBy: BodosValidatorService should return an error if value.length is not 10 or 13
statusReason: Expected $.isbnLength to have properties
    valid: false

[Killed] ConditionalExpression
app/admin/shared/bodos-validator.service.ts:25:7
   }
   checkAuthors(authorsFormArray: AbstractControl): ValidationErrors | null {
     if (
-      (authorsFormArray as FormArray).controls.some(
-        (ele) => ele.value?.length > 0
-      )
+      false
     ) {
       return null;
killedBy: BodosValidatorService should return null if FormControlArray has at least one author
statusReason: Expected Object({ oneAuthor: Object({ valid: false }) }) to be null.

[Killed] ConditionalExpression
app/admin/shared/bodos-validator.service.ts:25:7
   }
   checkAuthors(authorsFormArray: AbstractControl): ValidationErrors | null {
     if (
-      (authorsFormArray as FormArray).controls.some(
-        (ele) => ele.value?.length > 0
-      )
+      true
     ) {
       return null;
killedBy: BodosValidatorService should return { oneAuthor: { valid: false } } if FormControlArray has no author
statusReason: Expected null to equal Object({ oneAuthor: Object({ valid: false }) }).

[Killed] OptionalChaining
app/admin/shared/bodos-validator.service.ts:26:18
   checkAuthors(authorsFormArray: AbstractControl): ValidationErrors | null {
     if (
       (authorsFormArray as FormArray).controls.some(
-        (ele) => ele.value?.length > 0
+        (ele) => ele.value.length > 0
       )
     ) {
killedBy: BodosValidatorService should return { oneAuthor: { valid: false } } if FormControlArray has no author
statusReason: TypeError: Cannot read properties of null (reading 'length')

[Killed] ArrowFunction
app/admin/shared/bodos-validator.service.ts:26:9
   checkAuthors(authorsFormArray: AbstractControl): ValidationErrors | null {
     if (
       (authorsFormArray as FormArray).controls.some(
-        (ele) => ele.value?.length > 0
+        () => undefined
       )
     ) {
killedBy: BodosValidatorService should return null if FormControlArray has at least one author
statusReason: Expected Object({ oneAuthor: Object({ valid: false }) }) to be null.

[Killed] BooleanLiteral
app/admin/shared/bodos-validator.service.ts:31:36
     ) {
       return null;
     } else {
-      return { oneAuthor: { valid: false } };
+      return { oneAuthor: { valid: true } };
     }
   }
killedBy: BodosValidatorService should return { oneAuthor: { valid: false } } if FormControlArray has no author
statusReason: Expected $.oneAuthor.valid = true to equal false.

[Killed] BooleanLiteral
app/admin/shared/bodos-validator.service.ts:39:48
       //console.log('calling book Service for validation of isbn');
       return this.bookService.getBookFast(control.value).pipe(
         map((book) => {
-          return book ? { isbnExists: { valid: false } } : null;
+          return book ? { isbnExists: { valid: true } } : null;
         }),
         catchError(() => {
killedBy: BodosValidatorService should return error observable if book with this ISBN already exists
statusReason: Expected $[0].notification.value.isbnExists.valid = true to equal false.
