[Killed] BlockStatement
app/shared/success-alert/success-alert.component.ts:15:38
 export class SuccessAlertComponent {
   _saved!: boolean;
   @Input() successMsg!: string;
-  @Input() set saved(value: boolean) {
-    this._saved = value;
-    if (this._saved) {
-      setTimeout(() => {
-        this.store.dispatch(resetSavedSuccessFlag());
-      }, 5000);
-    }
-  }
+  @Input() set saved(value: boolean) {}
   get saved(): boolean {
     return this._saved;
killedBy: SuccessAlertComponent should fire a resetSavedSuccessFlag action after 5 sec
statusReason: TypeError: Cannot read properties of null (reading 'nativeElement')

[Killed] ConditionalExpression
app/shared/success-alert/success-alert.component.ts:17:9
   @Input() successMsg!: string;
   @Input() set saved(value: boolean) {
     this._saved = value;
-    if (this._saved) {
+    if (false) {
       setTimeout(() => {
         this.store.dispatch(resetSavedSuccessFlag());
killedBy: SuccessAlertComponent should fire a resetSavedSuccessFlag action after 5 sec
statusReason: Expected spy dispatch to have been called once. It was called 0 times.

[Killed] ConditionalExpression
app/shared/success-alert/success-alert.component.ts:17:9
   @Input() successMsg!: string;
   @Input() set saved(value: boolean) {
     this._saved = value;
-    if (this._saved) {
+    if (true) {
       setTimeout(() => {
         this.store.dispatch(resetSavedSuccessFlag());
killedBy: SuccessAlertComponent should fire a resetSavedSuccessFlag action after 5 sec
statusReason: Expected spy dispatch to have been called 0 times. It was called 1 times.

[Killed] BlockStatement
app/shared/success-alert/success-alert.component.ts:18:24
   @Input() set saved(value: boolean) {
     this._saved = value;
     if (this._saved) {
-      setTimeout(() => {
-        this.store.dispatch(resetSavedSuccessFlag());
-      }, 5000);
+      setTimeout(() => {}, 5000);
     }
   }
killedBy: SuccessAlertComponent should fire a resetSavedSuccessFlag action after 5 sec
statusReason: Expected spy dispatch to have been called once. It was called 0 times.
