[Killed] BooleanLiteral
src/app/store/router.reducer.ts:14:12
 }
 
 export const loaderState: LoaderState = {
-  loading: false
+  loading: true
 };
 
killedBy: AppComponent should create the app without loading spinner; Router Reducer and unknown action should have loading=false initially
statusReason: Expected DebugElement({ nativeNode: <svg _ngcontent-a-c53 data-id="loadingSpinner" xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24" class="animate-spin h-5 w-5 text-gray-600">...</svg> }) to be falsy.

[Killed] BooleanLiteral
src/app/store/router.reducer.ts:19:62
 
 export const reducer = createReducer(
   loaderState,
-  on(routerNavigationAction, (_): LoaderState => ({ loading: true })),
+  on(routerNavigationAction, (_): LoaderState => ({ loading: false })),
   on(routerNavigatedAction, (_): LoaderState => ({ loading: false })),
   on(routerCancelAction, (_): LoaderState => ({ loading: false })),
killedBy: Router Reducer and routerNavigationAction action should change the previous  state to true
statusReason: Expected $.loading = false to equal true.

[Killed] BooleanLiteral
src/app/store/router.reducer.ts:20:61
 export const reducer = createReducer(
   loaderState,
   on(routerNavigationAction, (_): LoaderState => ({ loading: true })),
-  on(routerNavigatedAction, (_): LoaderState => ({ loading: false })),
+  on(routerNavigatedAction, (_): LoaderState => ({ loading: true })),
   on(routerCancelAction, (_): LoaderState => ({ loading: false })),
   on(routerErrorAction, (_): LoaderState => ({ loading: false }))
killedBy: Router Reducer and routerNavigatedAction action should  false state
statusReason: Expected $.loading = true to equal false.

[Killed] BooleanLiteral
src/app/store/router.reducer.ts:21:58
   loaderState,
   on(routerNavigationAction, (_): LoaderState => ({ loading: true })),
   on(routerNavigatedAction, (_): LoaderState => ({ loading: false })),
-  on(routerCancelAction, (_): LoaderState => ({ loading: false })),
+  on(routerCancelAction, (_): LoaderState => ({ loading: true })),
   on(routerErrorAction, (_): LoaderState => ({ loading: false }))
 );
killedBy: Router Reducer and routerCancelAction action should return the previous false state
statusReason: Expected $.loading = true to equal false.

[Killed] BooleanLiteral
src/app/store/router.reducer.ts:22:57
   on(routerNavigationAction, (_): LoaderState => ({ loading: true })),
   on(routerNavigatedAction, (_): LoaderState => ({ loading: false })),
   on(routerCancelAction, (_): LoaderState => ({ loading: false })),
-  on(routerErrorAction, (_): LoaderState => ({ loading: false }))
+  on(routerErrorAction, (_): LoaderState => ({ loading: true }))
 );
 
killedBy: Router Reducer and routerErrorAction action should  false state
statusReason: Expected $.loading = true to equal false.
