[Killed] BooleanLiteral
src/app/shared/can-navigate-to-admin.guard.ts:14:13
   providedIn: 'root'
 })
 export class CanNavigateToAdminGuard implements CanActivate {
-  adminOk = false;
+  adminOk = true;
   canActivate(
     route: ActivatedRouteSnapshot,
killedBy: CanNavigateToAdminGuard should return true if window.confirm is true
statusReason: Expected spy confirm to have been called once. It was called 0 times.

[Killed] ConditionalExpression
src/app/shared/can-navigate-to-admin.guard.ts:23:9
     | Promise<boolean | UrlTree>
     | boolean
     | UrlTree {
-    if (!this.adminOk) {
+    if (true) {
       const question = $localize`:@@CanCanvigateToAdminGuard\:question:Really want to be Admin?`;
       this.adminOk = window.confirm(question);
killedBy: CanNavigateToAdminGuard should return true if previous answer was  true
statusReason: Expected spy confirm to have been called once. It was called 2 times.

[Killed] ConditionalExpression
src/app/shared/can-navigate-to-admin.guard.ts:23:9
     | Promise<boolean | UrlTree>
     | boolean
     | UrlTree {
-    if (!this.adminOk) {
+    if (false) {
       const question = $localize`:@@CanCanvigateToAdminGuard\:question:Really want to be Admin?`;
       this.adminOk = window.confirm(question);
killedBy: CanNavigateToAdminGuard should return true if window.confirm is true
statusReason: Expected false to be true.
