[Killed] ObjectLiteral
src/app/shared/token.interceptor.ts:17:35
     request: HttpRequest<unknown>,
     next: HttpHandler
   ): Observable<HttpEvent<unknown>> {
-    let myRequest = request.clone({
-      headers: request.headers.set('Authorization', 'Bearer 1234567890')
-    });
+    let myRequest = request.clone({});
     return next.handle(myRequest);
   }
killedBy: TokenInterceptor should increment the counter for all apis except getUsers
statusReason: Expected null to equal 'Bearer 1234567890'.

[Killed] StringLiteral
src/app/shared/token.interceptor.ts:18:53
     next: HttpHandler
   ): Observable<HttpEvent<unknown>> {
     let myRequest = request.clone({
-      headers: request.headers.set('Authorization', 'Bearer 1234567890')
+      headers: request.headers.set('Authorization', "")
     });
     return next.handle(myRequest);
killedBy: TokenInterceptor should increment the counter for all apis except getUsers
statusReason: Expected '' to equal 'Bearer 1234567890'.
