[Killed] BlockStatement
src/app/store/router.selectors.ts:19:20
 
 export const selectPageLoading = createSelector(
   selectLoaderState,
-  (loaderState) => {
-    return loaderState.loading;
-  }
+  (loaderState) => {}
 );
 
killedBy: AppComponent should show loading spinner; router selectors should select feature  loader state and initial loading-state=false
statusReason: Expected null to be truthy.
