[NoCoverage] StringLiteral
app/books/book-details/book-details.guard.ts:41:35
     route: ActivatedRouteSnapshot,
     state: RouterStateSnapshot
   ): Observable<boolean | UrlTree> {
-    let isbn = route.paramMap.get('isbn');
+    let isbn = route.paramMap.get("");
     if (!isbn) {
       this.store.dispatch(

[NoCoverage] StringLiteral
app/books/book-details/book-details.guard.ts:48:38
           message: 'isbn number not found in paramMap of route'
         })
       );
-      return of(this.router.parseUrl('/error'));
+      return of(this.router.parseUrl(""));
     }
     return this.getFromStoreOrAPI(isbn).pipe(

[NoCoverage] EqualityOperator
app/books/book-details/book-details.guard.ts:52:13
     }
     return this.getFromStoreOrAPI(isbn).pipe(
       switchMap((data) => {
-        if (data.currentBookId === isbn) return of(true);
+        if (data.currentBookId !== isbn) return of(true);
         else return of(this.router.parseUrl('/error'));
       }),

[NoCoverage] ConditionalExpression
app/books/book-details/book-details.guard.ts:52:13
     }
     return this.getFromStoreOrAPI(isbn).pipe(
       switchMap((data) => {
-        if (data.currentBookId === isbn) return of(true);
+        if (true) return of(true);
         else return of(this.router.parseUrl('/error'));
       }),

[NoCoverage] StringLiteral
app/books/book-details/book-details.guard.ts:53:45
     return this.getFromStoreOrAPI(isbn).pipe(
       switchMap((data) => {
         if (data.currentBookId === isbn) return of(true);
-        else return of(this.router.parseUrl('/error'));
+        else return of(this.router.parseUrl(""));
       }),
       catchError((error: Error) => {

[NoCoverage] StringLiteral
app/books/book-details/book-details.guard.ts:60:23
         error instanceof HttpErrorResponse
           ? (errorMsg = JSON.stringify(error))
           : (errorMsg = error.toString());
-        console.error('errorMsg=' + errorMsg);
+        console.error("" + errorMsg);
         this.store.dispatch(
           bookErrorAction({

[NoCoverage] BlockStatement
app/books/book-details/book-details.guard.ts:79:21
   }> {
     return this.store.select(selectCurrentBookAndAll).pipe(
       distinctUntilChanged((previous, current) => isEqual(previous, current)),
-      tap((data) => {
-        if (!this.isCurrentBookOrErrorAndUpToDate(data, isbn)) {
-          this.dispatchLoadAction(data.allBooks, data.lastUpdateTS, isbn);
-        }
-      }),
+      tap((data) => {}),
       filter((data) => this.isCurrentBookOrErrorAndUpToDate(data, isbn)),
       take(1)

[NoCoverage] BooleanLiteral
app/books/book-details/book-details.guard.ts:80:13
     return this.store.select(selectCurrentBookAndAll).pipe(
       distinctUntilChanged((previous, current) => isEqual(previous, current)),
       tap((data) => {
-        if (!this.isCurrentBookOrErrorAndUpToDate(data, isbn)) {
+        if (this.isCurrentBookOrErrorAndUpToDate(data, isbn)) {
           this.dispatchLoadAction(data.allBooks, data.lastUpdateTS, isbn);
         }

[NoCoverage] ConditionalExpression
app/books/book-details/book-details.guard.ts:80:13
     return this.store.select(selectCurrentBookAndAll).pipe(
       distinctUntilChanged((previous, current) => isEqual(previous, current)),
       tap((data) => {
-        if (!this.isCurrentBookOrErrorAndUpToDate(data, isbn)) {
+        if (true) {
           this.dispatchLoadAction(data.allBooks, data.lastUpdateTS, isbn);
         }

[NoCoverage] ConditionalExpression
app/books/book-details/book-details.guard.ts:99:7
     isbn: string
   ) {
     return (
-      data.currentBookId === isbn ||
-      (!!data.httpError?.message &&
-        data.lastUpdateTS >= Date.now() - 1000 * 60) ||
-      (data.errorMessage !== null &&
-        data.lastUpdateTS >= Date.now() - 1000 * 60)
+      true
     );
   }

[NoCoverage] ConditionalExpression
app/books/book-details/book-details.guard.ts:99:7
     isbn: string
   ) {
     return (
-      data.currentBookId === isbn ||
-      (!!data.httpError?.message &&
-        data.lastUpdateTS >= Date.now() - 1000 * 60) ||
-      (data.errorMessage !== null &&
-        data.lastUpdateTS >= Date.now() - 1000 * 60)
+      false
     );
   }

[NoCoverage] ConditionalExpression
app/books/book-details/book-details.guard.ts:100:8
   ) {
     return (
       data.currentBookId === isbn ||
-      (!!data.httpError?.message &&
-        data.lastUpdateTS >= Date.now() - 1000 * 60) ||
+      (false) ||
       (data.errorMessage !== null &&
         data.lastUpdateTS >= Date.now() - 1000 * 60)

[NoCoverage] BooleanLiteral
app/books/book-details/book-details.guard.ts:100:8
   ) {
     return (
       data.currentBookId === isbn ||
-      (!!data.httpError?.message &&
+      (!data.httpError?.message &&
         data.lastUpdateTS >= Date.now() - 1000 * 60) ||
       (data.errorMessage !== null &&

[NoCoverage] ArithmeticOperator
app/books/book-details/book-details.guard.ts:101:43
     return (
       data.currentBookId === isbn ||
       (!!data.httpError?.message &&
-        data.lastUpdateTS >= Date.now() - 1000 * 60) ||
+        data.lastUpdateTS >= Date.now() - 1000 / 60) ||
       (data.errorMessage !== null &&
         data.lastUpdateTS >= Date.now() - 1000 * 60)

[NoCoverage] ArithmeticOperator
app/books/book-details/book-details.guard.ts:101:30
     return (
       data.currentBookId === isbn ||
       (!!data.httpError?.message &&
-        data.lastUpdateTS >= Date.now() - 1000 * 60) ||
+        data.lastUpdateTS >= Date.now() + 1000 * 60) ||
       (data.errorMessage !== null &&
         data.lastUpdateTS >= Date.now() - 1000 * 60)

[NoCoverage] EqualityOperator
app/books/book-details/book-details.guard.ts:102:8
       data.currentBookId === isbn ||
       (!!data.httpError?.message &&
         data.lastUpdateTS >= Date.now() - 1000 * 60) ||
-      (data.errorMessage !== null &&
+      (data.errorMessage === null &&
         data.lastUpdateTS >= Date.now() - 1000 * 60)
     );

[NoCoverage] LogicalOperator
app/books/book-details/book-details.guard.ts:102:8
       data.currentBookId === isbn ||
       (!!data.httpError?.message &&
         data.lastUpdateTS >= Date.now() - 1000 * 60) ||
-      (data.errorMessage !== null &&
-        data.lastUpdateTS >= Date.now() - 1000 * 60)
+      (data.errorMessage !== null || data.lastUpdateTS >= Date.now() - 1000 * 60)
     );
   }

[NoCoverage] EqualityOperator
app/books/book-details/book-details.guard.ts:103:9
       (!!data.httpError?.message &&
         data.lastUpdateTS >= Date.now() - 1000 * 60) ||
       (data.errorMessage !== null &&
-        data.lastUpdateTS >= Date.now() - 1000 * 60)
+        data.lastUpdateTS < Date.now() - 1000 * 60)
     );
   }

[NoCoverage] ConditionalExpression
app/books/book-details/book-details.guard.ts:103:9
       (!!data.httpError?.message &&
         data.lastUpdateTS >= Date.now() - 1000 * 60) ||
       (data.errorMessage !== null &&
-        data.lastUpdateTS >= Date.now() - 1000 * 60)
+        true)
     );
   }

[NoCoverage] BlockStatement
app/books/book-details/book-details.guard.ts:110:5
     allBooks: BookEntity[],
     lastUpdateTS: number,
     isbn: string
-  ) {
-    if (!allBooks?.length && lastUpdateTS < Date.now() - 1000 * 60) {
-      this.store.dispatch(loadBookEntities());
-    } else {
-      const currentBook = allBooks?.find((book) => book.isbn == isbn);
-      if (!!currentBook) {
-        this.store.dispatch(setCurrentBookSuccess({ currentBookId: isbn }));
-      } else {
-        const nowMinus1Min = Date.now() - 1000 * 60;
-        if (lastUpdateTS < nowMinus1Min) {
-          this.store.dispatch(loadAllAndSetCurrentBook({ isbn }));
-        } else {
-          this.store.dispatch(
-            isbnNotFound({
-              errorMessage:
-                'reloaded books less then 1 min ago, but isbn not found'
-            })
-          );
-        }
-      }
-    }
-  }
+  ) {}
 }
 

[NoCoverage] ConditionalExpression
app/books/book-details/book-details.guard.ts:111:30
     lastUpdateTS: number,
     isbn: string
   ) {
-    if (!allBooks?.length && lastUpdateTS < Date.now() - 1000 * 60) {
+    if (!allBooks?.length && true) {
       this.store.dispatch(loadBookEntities());
     } else {

[NoCoverage] ArithmeticOperator
app/books/book-details/book-details.guard.ts:111:45
     lastUpdateTS: number,
     isbn: string
   ) {
-    if (!allBooks?.length && lastUpdateTS < Date.now() - 1000 * 60) {
+    if (!allBooks?.length && lastUpdateTS < Date.now() + 1000 * 60) {
       this.store.dispatch(loadBookEntities());
     } else {

[NoCoverage] BlockStatement
app/books/book-details/book-details.guard.ts:113:12
   ) {
     if (!allBooks?.length && lastUpdateTS < Date.now() - 1000 * 60) {
       this.store.dispatch(loadBookEntities());
-    } else {
-      const currentBook = allBooks?.find((book) => book.isbn == isbn);
-      if (!!currentBook) {
-        this.store.dispatch(setCurrentBookSuccess({ currentBookId: isbn }));
-      } else {
-        const nowMinus1Min = Date.now() - 1000 * 60;
-        if (lastUpdateTS < nowMinus1Min) {
-          this.store.dispatch(loadAllAndSetCurrentBook({ isbn }));
-        } else {
-          this.store.dispatch(
-            isbnNotFound({
-              errorMessage:
-                'reloaded books less then 1 min ago, but isbn not found'
-            })
-          );
-        }
-      }
-    }
+    } else {}
   }
 }

[NoCoverage] ConditionalExpression
app/books/book-details/book-details.guard.ts:114:52
     if (!allBooks?.length && lastUpdateTS < Date.now() - 1000 * 60) {
       this.store.dispatch(loadBookEntities());
     } else {
-      const currentBook = allBooks?.find((book) => book.isbn == isbn);
+      const currentBook = allBooks?.find((book) => false);
       if (!!currentBook) {
         this.store.dispatch(setCurrentBookSuccess({ currentBookId: isbn }));

[NoCoverage] ConditionalExpression
app/books/book-details/book-details.guard.ts:114:52
     if (!allBooks?.length && lastUpdateTS < Date.now() - 1000 * 60) {
       this.store.dispatch(loadBookEntities());
     } else {
-      const currentBook = allBooks?.find((book) => book.isbn == isbn);
+      const currentBook = allBooks?.find((book) => true);
       if (!!currentBook) {
         this.store.dispatch(setCurrentBookSuccess({ currentBookId: isbn }));

[NoCoverage] BlockStatement
app/books/book-details/book-details.guard.ts:115:26
       this.store.dispatch(loadBookEntities());
     } else {
       const currentBook = allBooks?.find((book) => book.isbn == isbn);
-      if (!!currentBook) {
-        this.store.dispatch(setCurrentBookSuccess({ currentBookId: isbn }));
-      } else {
+      if (!!currentBook) {} else {
         const nowMinus1Min = Date.now() - 1000 * 60;
         if (lastUpdateTS < nowMinus1Min) {

[NoCoverage] ConditionalExpression
app/books/book-details/book-details.guard.ts:115:11
       this.store.dispatch(loadBookEntities());
     } else {
       const currentBook = allBooks?.find((book) => book.isbn == isbn);
-      if (!!currentBook) {
+      if (true) {
         this.store.dispatch(setCurrentBookSuccess({ currentBookId: isbn }));
       } else {

[NoCoverage] BlockStatement
app/books/book-details/book-details.guard.ts:117:14
       const currentBook = allBooks?.find((book) => book.isbn == isbn);
       if (!!currentBook) {
         this.store.dispatch(setCurrentBookSuccess({ currentBookId: isbn }));
-      } else {
-        const nowMinus1Min = Date.now() - 1000 * 60;
-        if (lastUpdateTS < nowMinus1Min) {
-          this.store.dispatch(loadAllAndSetCurrentBook({ isbn }));
-        } else {
-          this.store.dispatch(
-            isbnNotFound({
-              errorMessage:
-                'reloaded books less then 1 min ago, but isbn not found'
-            })
-          );
-        }
-      }
+      } else {}
     }
   }

[NoCoverage] ArithmeticOperator
app/books/book-details/book-details.guard.ts:118:30
       if (!!currentBook) {
         this.store.dispatch(setCurrentBookSuccess({ currentBookId: isbn }));
       } else {
-        const nowMinus1Min = Date.now() - 1000 * 60;
+        const nowMinus1Min = Date.now() + 1000 * 60;
         if (lastUpdateTS < nowMinus1Min) {
           this.store.dispatch(loadAllAndSetCurrentBook({ isbn }));

[NoCoverage] ArithmeticOperator
app/books/book-details/book-details.guard.ts:118:43
       if (!!currentBook) {
         this.store.dispatch(setCurrentBookSuccess({ currentBookId: isbn }));
       } else {
-        const nowMinus1Min = Date.now() - 1000 * 60;
+        const nowMinus1Min = Date.now() - 1000 / 60;
         if (lastUpdateTS < nowMinus1Min) {
           this.store.dispatch(loadAllAndSetCurrentBook({ isbn }));

[NoCoverage] ConditionalExpression
app/books/book-details/book-details.guard.ts:119:13
         this.store.dispatch(setCurrentBookSuccess({ currentBookId: isbn }));
       } else {
         const nowMinus1Min = Date.now() - 1000 * 60;
-        if (lastUpdateTS < nowMinus1Min) {
+        if (false) {
           this.store.dispatch(loadAllAndSetCurrentBook({ isbn }));
         } else {

[NoCoverage] BlockStatement
app/books/book-details/book-details.guard.ts:119:42
         this.store.dispatch(setCurrentBookSuccess({ currentBookId: isbn }));
       } else {
         const nowMinus1Min = Date.now() - 1000 * 60;
-        if (lastUpdateTS < nowMinus1Min) {
-          this.store.dispatch(loadAllAndSetCurrentBook({ isbn }));
-        } else {
+        if (lastUpdateTS < nowMinus1Min) {} else {
           this.store.dispatch(
             isbnNotFound({

[NoCoverage] BlockStatement
app/books/book-details/book-details.guard.ts:121:16
         const nowMinus1Min = Date.now() - 1000 * 60;
         if (lastUpdateTS < nowMinus1Min) {
           this.store.dispatch(loadAllAndSetCurrentBook({ isbn }));
-        } else {
-          this.store.dispatch(
-            isbnNotFound({
-              errorMessage:
-                'reloaded books less then 1 min ago, but isbn not found'
-            })
-          );
-        }
+        } else {}
       }
     }
