[Killed] LogicalOperator
app/books/book-details/book-details2.guard.ts:48:7
   private proceedRoute(data: curBookTS, isbn: string): boolean {
     if (data.currentBookId === isbn) return true;
     if (
-      this.isNewTimeStamp(data) &&
-      !data.allBooks.find((book) => book.isbn === isbn)
+      this.isNewTimeStamp(data) || !data.allBooks.find(book => book.isbn === isbn)
     )
       return true;
killedBy: BookDetailsGuard2 canActivate with NEW timestamp in the store,  but isbn param doesn't match that in the store.currentBook  and if there is ONE other book in the store with the requested ISBN,  should; BookDetailsGuard2 canActivate with old timestamp in the store should not return anything in the Observable yet but emit a dispatch(loadAllAndSetCurrentBook)if  there is no Book at all with the request
statusReason: Expected $.length = 1 to equal 0.
Unexpected $[0] = Object({ frame: 0, notification: Object({ kind: 'N', value: has-invalid-toString-method, error: undefined }) }) in array.

[Killed] BooleanLiteral
app/books/book-details/book-details2.guard.ts:49:7
     if (data.currentBookId === isbn) return true;
     if (
       this.isNewTimeStamp(data) &&
-      !data.allBooks.find((book) => book.isbn === isbn)
+      data.allBooks.find(book => book.isbn === isbn)
     )
       return true;
killedBy: BookDetailsGuard2 canActivate with NEW timestamp in the store,  but isbn param doesn't match that in the store.currentBook  and if there is ONE other book in the store with the requested ISBN,  should
statusReason: Expected $.length = 1 to equal 0.
Unexpected $[0] = Object({ frame: 0, notification: Object({ kind: 'N', value: has-invalid-toString-method, error: undefined }) }) in array.

[Killed] BlockStatement
app/books/book-details/book-details2.guard.ts:54:57
       return true;
     return false;
   }
-  private dispatchAction(data: curBookTS, isbn: string) {
-    if (this.isOldTimeStamp(data)) {
-      this.store.dispatch(loadAllAndSetCurrentBook({ isbn }));
-    }
-    if (
-      this.isNewTimeStamp(data) &&
-      data.currentBookId != isbn &&
-      data.allBooks.find((book) => book.isbn === isbn)
-    ) {
-      this.store.dispatch(setCurrentBookSuccess({ currentBookId: isbn }));
-    }
-    if (
-      this.isNewTimeStamp(data) &&
-      data.currentBookId != isbn &&
-      !data.allBooks.find((book) => book.isbn === isbn)
-    ) {
-      this.store.dispatch(
-        bookErrorAction({ message: 'isbn number not found' })
-      );
-    }
-  }
+  private dispatchAction(data: curBookTS, isbn: string) {}
   private isNewTimeStamp(data: curBookTS) {
     return !this.isOldTimeStamp(data);
killedBy: BookDetailsGuard2 canActivate with NEW timestamp in the store,  but isbn param doesn't match that in the store.currentBook  and if there is ONE other book in the store with the requested ISBN,  should; BookDetailsGuard2 canActivate with old timestamp in the store should not return anything in the Observable yet but emit a dispatch(loadAllAndSetCurrentBook)if  there is no Book at all with the request
statusReason: Expected spy mockStore.dispatch to have been called only once, and with given args:
  [ Object({ currentBookId: '1234567890', type: '[BookEntity/API] Set Current Book Success' }) ]
But it was never called.


Error: Expected spy mockStore.dispatch to have been called only once, and with given args:
  [ Object({ currentBookId: '1234567890', type: '[BookEntity/API] Set Current Book Success' }) ]
But

[Killed] ConditionalExpression
app/books/book-details/book-details2.guard.ts:55:9
     return false;
   }
   private dispatchAction(data: curBookTS, isbn: string) {
-    if (this.isOldTimeStamp(data)) {
+    if (false) {
       this.store.dispatch(loadAllAndSetCurrentBook({ isbn }));
     }
killedBy: BookDetailsGuard2 canActivate with old timestamp in the store should not return anything in the Observable yet but emit a dispatch(loadAllAndSetCurrentBook)if  there is no Book at all with the request
statusReason: Expected spy mockStore.dispatch to have been called only once, and with given args:
  [ Object({ isbn: 'differentIsbn', type: '[BookEntity/API] Load all and set Current Book' }) ]
But it was never called.


Error: Expected spy mockStore.dispatch to have been called only once, and with given args:
  [ Object({ isbn: 'differentIsbn', type: '[BookEntity/API] Load all and set Current Book' }) ]
But it

[Killed] LogicalOperator
app/books/book-details/book-details2.guard.ts:66:7
       this.store.dispatch(setCurrentBookSuccess({ currentBookId: isbn }));
     }
     if (
-      this.isNewTimeStamp(data) &&
-      data.currentBookId != isbn &&
-      !data.allBooks.find((book) => book.isbn === isbn)
+      this.isNewTimeStamp(data) && data.currentBookId != isbn || !data.allBooks.find(book => book.isbn === isbn)
     ) {
       this.store.dispatch(
killedBy: BookDetailsGuard2 canActivate with NEW timestamp in the store,  but isbn param doesn't match that in the store.currentBook  and if there is ONE other book in the store with the requested ISBN,  should; BookDetailsGuard2 canActivate with old timestamp in the store should not return anything in the Observable yet but emit a dispatch(loadAllAndSetCurrentBook)if  there is no Book at all with the request
statusReason: Expected spy mockStore.dispatch to have been called only once, and with given args:
  [ Object({ currentBookId: '1234567890', type: '[BookEntity/API] Set Current Book Success' }) ]
But the actual calls were:
  [ Object({ currentBookId: '1234567890', type: '[BookEntity/API] Set Current Book Success' }) ],
  [ Object({ message: 'isbn number not found', type: '[BookEntity/API]  Error' }) ].


Error:

[Killed] ConditionalExpression
app/books/book-details/book-details2.guard.ts:66:7
       this.store.dispatch(setCurrentBookSuccess({ currentBookId: isbn }));
     }
     if (
-      this.isNewTimeStamp(data) &&
-      data.currentBookId != isbn &&
-      !data.allBooks.find((book) => book.isbn === isbn)
+      false
     ) {
       this.store.dispatch(
killedBy: BookDetailsGuard2 canActivate with NEW timestamp in the store,  but isbn param doesn't match that in the store.currentBook  and if there is NO book in the store with the requested ISBN should  return 
statusReason: Expected spy mockStore.dispatch to have been called only once, and with given args:
  [ Object({ message: 'isbn number not found', type: '[BookEntity/API]  Error' }) ]
But it was never called.


Error: Expected spy mockStore.dispatch to have been called only once, and with given args:
  [ Object({ message: 'isbn number not found', type: '[BookEntity/API]  Error' }) ]
But it was never called.

[Killed] ConditionalExpression
app/books/book-details/book-details2.guard.ts:68:37
     if (
       this.isNewTimeStamp(data) &&
       data.currentBookId != isbn &&
-      !data.allBooks.find((book) => book.isbn === isbn)
+      !data.allBooks.find((book) => true)
     ) {
       this.store.dispatch(
killedBy: BookDetailsGuard2 canActivate with NEW timestamp in the store,  but isbn param doesn't match that in the store.currentBook  and if there is NO book in the store with the requested ISBN should  return 
statusReason: Expected spy mockStore.dispatch to have been called only once, and with given args:
  [ Object({ message: 'isbn number not found', type: '[BookEntity/API]  Error' }) ]
But it was never called.


Error: Expected spy mockStore.dispatch to have been called only once, and with given args:
  [ Object({ message: 'isbn number not found', type: '[BookEntity/API]  Error' }) ]
But it was never called.

[Killed] BooleanLiteral
app/books/book-details/book-details2.guard.ts:68:7
     if (
       this.isNewTimeStamp(data) &&
       data.currentBookId != isbn &&
-      !data.allBooks.find((book) => book.isbn === isbn)
+      data.allBooks.find(book => book.isbn === isbn)
     ) {
       this.store.dispatch(
killedBy: BookDetailsGuard2 canActivate with NEW timestamp in the store,  but isbn param doesn't match that in the store.currentBook  and if there is ONE other book in the store with the requested ISBN,  should
statusReason: Expected spy mockStore.dispatch to have been called only once, and with given args:
  [ Object({ currentBookId: '1234567890', type: '[BookEntity/API] Set Current Book Success' }) ]
But the actual calls were:
  [ Object({ currentBookId: '1234567890', type: '[BookEntity/API] Set Current Book Success' }) ],
  [ Object({ message: 'isbn number not found', type: '[BookEntity/API]  Error' }) ].


Error:

[Killed] StringLiteral
app/books/book-details/book-details2.guard.ts:71:36
       !data.allBooks.find((book) => book.isbn === isbn)
     ) {
       this.store.dispatch(
-        bookErrorAction({ message: 'isbn number not found' })
+        bookErrorAction({ message: "" })
       );
     }
killedBy: BookDetailsGuard2 canActivate with NEW timestamp in the store,  but isbn param doesn't match that in the store.currentBook  and if there is NO book in the store with the requested ISBN should  return 
statusReason: Expected spy mockStore.dispatch to have been called only once, and with given args:
  [ Object({ message: 'isbn number not found', type: '[BookEntity/API]  Error' }) ]
But the actual call was:
  [ Object({ message: '', type: '[BookEntity/API]  Error' }) ].
Expected $[0].message = '' to equal 'isbn number not found'.


Error: Expected spy mockStore.dispatch to have been called only once, and with g

[Killed] EqualityOperator
app/books/book-details/book-details2.guard.ts:79:12
     return !this.isOldTimeStamp(data);
   }
   private isOldTimeStamp(data: curBookTS) {
-    return data.lastUpdateTS < Date.now() - 1000 * 60;
+    return data.lastUpdateTS >= Date.now() - 1000 * 60;
   }
 }
killedBy: BookDetailsGuard2 canActivate with NEW timestamp in the store, and isbn param matches that in the store, should return of(true) ; BookDetailsGuard2 canActivate with old timestamp in the store should not return anything in the Observable yet but emit a dispatch(loadAllAndSetCurrentBook)if  there is no Book at all with the request
statusReason: Expected spy mockStore.dispatch not to have been called.
