[NoCoverage] StringLiteral
book-monkey/src/app/app-routing.module.ts:12:11
     redirectTo: '/home',
     pathMatch: 'full'
   },
-  { path: 'home', component: HomeComponent },
+  { path: "", component: HomeComponent },
   {
     path: 'books',

[NoCoverage] ArrowFunction
book-monkey/src/app/app-routing.module.ts:15:19
   { path: 'home', component: HomeComponent },
   {
     path: 'books',
-    loadChildren: () =>
-      import('./books/books.module').then((m) => m.BooksModule)
+    loadChildren: () => undefined
   },
   {

[NoCoverage] ArrowFunction
book-monkey/src/app/app-routing.module.ts:16:43
   {
     path: 'books',
     loadChildren: () =>
-      import('./books/books.module').then((m) => m.BooksModule)
+      import('./books/books.module').then(() => undefined)
   },
   {

[NoCoverage] StringLiteral
book-monkey/src/app/app-routing.module.ts:16:14
   {
     path: 'books',
     loadChildren: () =>
-      import('./books/books.module').then((m) => m.BooksModule)
+      import("").then((m) => m.BooksModule)
   },
   {

[NoCoverage] StringLiteral
book-monkey/src/app/app-routing.module.ts:19:11
       import('./books/books.module').then((m) => m.BooksModule)
   },
   {
-    path: 'admin',
+    path: "",
     loadChildren: () =>
       import('./admin/admin.module').then((m) => m.AdminModule),

[NoCoverage] ArrowFunction
book-monkey/src/app/app-routing.module.ts:20:19
   },
   {
     path: 'admin',
-    loadChildren: () =>
-      import('./admin/admin.module').then((m) => m.AdminModule),
+    loadChildren: () => undefined,
     canActivate: [CanNavigateToAdminGuard]
   }

[NoCoverage] ArrowFunction
book-monkey/src/app/app-routing.module.ts:21:43
   {
     path: 'admin',
     loadChildren: () =>
-      import('./admin/admin.module').then((m) => m.AdminModule),
+      import('./admin/admin.module').then(() => undefined),
     canActivate: [CanNavigateToAdminGuard]
   }

[NoCoverage] StringLiteral
book-monkey/src/app/app-routing.module.ts:21:14
   {
     path: 'admin',
     loadChildren: () =>
-      import('./admin/admin.module').then((m) => m.AdminModule),
+      import("").then((m) => m.AdminModule),
     canActivate: [CanNavigateToAdminGuard]
   }

[NoCoverage] ArrayDeclaration
book-monkey/src/app/app-routing.module.ts:22:18
     path: 'admin',
     loadChildren: () =>
       import('./admin/admin.module').then((m) => m.AdminModule),
-    canActivate: [CanNavigateToAdminGuard]
+    canActivate: []
   }
 ];
