[NoCoverage] BooleanLiteral
book-monkey/src/app/app.module.ts:12:68
 import { NgHeroiconsModule } from '@dimaslz/ng-heroicons';
 
 const httpInterceptorProviders = [
-  { provide: HTTP_INTERCEPTORS, useClass: TokenInterceptor, multi: true }
+  { provide: HTTP_INTERCEPTORS, useClass: TokenInterceptor, multi: false }
 ];
 @NgModule({

[NoCoverage] BlockStatement
book-monkey/src/app/app.module.ts:29:50
   bootstrap: [AppComponent]
 })
 export class AppModule {
-  constructor(@Inject(LOCALE_ID) locale: string) {
-    //registerLocaleData(localeDe);
-    console.log('locale: ' + locale);
-  }
+  constructor(@Inject(LOCALE_ID) locale: string) {}
 }
 
