[NoCoverage] ArrayDeclaration
src/app/books/books-routing.module.ts:6:24
 import { BookListComponent } from './book-list/book-list.component';
 import { BookDetailsComponent } from './book-details/book-details.component';
 
-const routes: Routes = [
-  { path: 'list', component: BookListComponent },
-  { path: 'detail/:isbn', component: BookDetailsComponent }
-];
+const routes: Routes = [];
 
 @NgModule({

[NoCoverage] StringLiteral
src/app/books/books-routing.module.ts:8:11
 
 const routes: Routes = [
   { path: 'list', component: BookListComponent },
-  { path: 'detail/:isbn', component: BookDetailsComponent }
+  { path: "", component: BookDetailsComponent }
 ];
 
