[Killed] BlockStatement
app/books/book-details/book-details.component.ts:25:20
     private bookService: BookStoreService
   ) {}
 
-  ngOnInit(): void {
-    this.route.paramMap.subscribe((params) => {
-      let isbn: string | null;
-      if ((isbn = params?.get('isbn')) != null) {
-        this.getABook(isbn);
-      }
-    });
-  }
+  ngOnInit(): void {}
 
   getABook(isbn: string) {
killedBy: BookDetailsComponent and IsbnPipe when initializes properly should subscribe to route.paramMap onInit() and get the isbn param and get the book with that isbn from bookstoreServiceand show all the boo; BookDetailsComponent and IsbnPipe should subscribe to route.paramMap onInit() and get the isbn param and show the error html if  bookstoreService returns an error
statusReason: Expected spy paramMap to have been called once. It was called 0 times.

[Killed] BlockStatement
app/books/book-details/book-details.component.ts:26:47
   ) {}
 
   ngOnInit(): void {
-    this.route.paramMap.subscribe((params) => {
-      let isbn: string | null;
-      if ((isbn = params?.get('isbn')) != null) {
-        this.getABook(isbn);
-      }
-    });
+    this.route.paramMap.subscribe((params) => {});
   }
 
killedBy: BookDetailsComponent and IsbnPipe when initializes properly should subscribe to route.paramMap onInit() and get the isbn param and get the book with that isbn from bookstoreServiceand show all the boo; BookDetailsComponent and IsbnPipe should subscribe to route.paramMap onInit() and get the isbn param and show the error html if  bookstoreService returns an error
statusReason: Expected spy unknown to have been called once. It was called 0 times.

[Killed] ConditionalExpression
app/books/book-details/book-details.component.ts:28:11
   ngOnInit(): void {
     this.route.paramMap.subscribe((params) => {
       let isbn: string | null;
-      if ((isbn = params?.get('isbn')) != null) {
+      if (false) {
         this.getABook(isbn);
       }
killedBy: BookDetailsComponent and IsbnPipe when initializes properly should subscribe to route.paramMap onInit() and get the isbn param and get the book with that isbn from bookstoreServiceand show all the boo; BookDetailsComponent and IsbnPipe should subscribe to route.paramMap onInit() and get the isbn param and show the error html if  bookstoreService returns an error
statusReason: Expected spy unknown to have been called once. It was called 0 times.

[Killed] BlockStatement
app/books/book-details/book-details.component.ts:28:49
   ngOnInit(): void {
     this.route.paramMap.subscribe((params) => {
       let isbn: string | null;
-      if ((isbn = params?.get('isbn')) != null) {
-        this.getABook(isbn);
-      }
+      if ((isbn = params?.get('isbn')) != null) {}
     });
   }
killedBy: BookDetailsComponent and IsbnPipe when initializes properly should subscribe to route.paramMap onInit() and get the isbn param and get the book with that isbn from bookstoreServiceand show all the boo; BookDetailsComponent and IsbnPipe should subscribe to route.paramMap onInit() and get the isbn param and show the error html if  bookstoreService returns an error
statusReason: Expected spy unknown to have been called once. It was called 0 times.

[Survived] StringLiteral
app/books/book-details/book-details.component.ts:43:29
     });
   }
 
-  readonly confirmMessage = 'Really delete book?';
+  readonly confirmMessage = "";
 
   delete(isbn: string | undefined): void {

[Killed] BlockStatement
app/books/book-details/book-details.component.ts:64:50
     });
   }
 
-  confirm(message?: string): Observable<boolean> {
-    const confirmation = window.confirm(message);
-    return of(confirmation);
-  }
+  confirm(message?: string): Observable<boolean> {}
 }
 
killedBy: BookDetailsComponent and IsbnPipe when initializes properly should subscribe a to a confirmation window, and call this.bookService.deleteBook(isbn) if the confirmation is true, and show an error when ; BookDetailsComponent and IsbnPipe should subscribe a to a confirmation window, and call this.bookService.deleteBook(isbn) if the confirmation is true, and navigate to "/books/list" when the bookServic
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')
