[Survived] BlockStatement
app/books/book-list/book-list.component.ts:19:76
   detailBook!: Book;
   error: HttpErrorResponse | undefined;
 
-  constructor(private bs: BookStoreService, private cd: ChangeDetectorRef) {
-    this.bs = bs;
-  }
+  constructor(private bs: BookStoreService, private cd: ChangeDetectorRef) {}
 
   ngOnInit(): void {

[Killed] BlockStatement
app/books/book-list/book-list.component.ts:25:27
 
   ngOnInit(): void {
     this.books$ = this.bs.getAll().pipe(
-      catchError((err) => {
-        this.error = err;
-        this.cd.detectChanges();
-        return of(null);
-      })
+      catchError((err) => {})
     );
     this.listView = true;
killedBy: BookListComponent should show error if BookStoreService runs into an error 
statusReason: Expected DebugElement({ nativeNode: <div _ngcontent-a-c55 class="flex items-center justify-center">...</div> }) to be null.
