[Killed] BlockStatement
app/books/shared/delay.directive.ts:12:20
 
   constructor() {}
 
-  ngOnInit(): void {
-    if (this.bmDelay) {
-      setTimeout(() => {
-        this.visibility = 'visible';
-      }, this.bmDelay);
-    }
-  }
+  ngOnInit(): void {}
 }
 
killedBy: DelayDirective should create an instance of the parent test component with style.visiblity = hidden, after 10ms should change to visible 
statusReason: Expected 'hidden' to be 'visible'.

[Killed] ConditionalExpression
app/books/shared/delay.directive.ts:13:9
   constructor() {}
 
   ngOnInit(): void {
-    if (this.bmDelay) {
+    if (false) {
       setTimeout(() => {
         this.visibility = 'visible';
killedBy: DelayDirective should create an instance of the parent test component with style.visiblity = hidden, after 10ms should change to visible 
statusReason: Expected 'hidden' to be 'visible'.

[Killed] BlockStatement
app/books/shared/delay.directive.ts:13:23
   constructor() {}
 
   ngOnInit(): void {
-    if (this.bmDelay) {
-      setTimeout(() => {
-        this.visibility = 'visible';
-      }, this.bmDelay);
-    }
+    if (this.bmDelay) {}
   }
 }
killedBy: DelayDirective should create an instance of the parent test component with style.visiblity = hidden, after 10ms should change to visible 
statusReason: Expected 'hidden' to be 'visible'.

[Killed] BlockStatement
app/books/shared/delay.directive.ts:14:24
 
   ngOnInit(): void {
     if (this.bmDelay) {
-      setTimeout(() => {
-        this.visibility = 'visible';
-      }, this.bmDelay);
+      setTimeout(() => {}, this.bmDelay);
     }
   }
killedBy: DelayDirective should create an instance of the parent test component with style.visiblity = hidden, after 10ms should change to visible 
statusReason: Expected 'hidden' to be 'visible'.
