[Killed] BlockStatement
app/books/shared/isbn.pipe.ts:7:58
   name: 'isbn'
 })
 export class IsbnPipe implements PipeTransform {
-  transform(value: unknown, ...args: unknown[]): unknown {
-    if (value) {
-      return (value as string).slice(0, 3) + '-' + (value as string).slice(3);
-    } else {
-      return undefined;
-    }
-  }
+  transform(value: unknown, ...args: unknown[]): unknown {}
 }
 
killedBy: BookDetailsComponent and IsbnPipe when initializes properly should subscribe to route.paramMap onInit() and get the isbn param and get the book with that isbn from bookstoreServiceand show all the boo; IsbnPipe should transform an ISBN number with dash
statusReason: Expected -1 to be greater than -1.

[Survived] BlockStatement
app/books/shared/isbn.pipe.ts:10:12
   transform(value: unknown, ...args: unknown[]): unknown {
     if (value) {
       return (value as string).slice(0, 3) + '-' + (value as string).slice(3);
-    } else {
-      return undefined;
-    }
+    } else {}
   }
 }
