[Killed] BlockStatement
app/books/shared/zoom.directive.ts:13:24
   smallActive: boolean = true;
 
   @HostBinding('class')
-  get elementClasses() {
-    return {
-      'px-10': this.smallActive,
-      'pt-10': this.smallActive,
-      'pb-10': this.smallActive
-    };
-  }
+  get elementClasses() {}
 
   @HostListener('mouseenter')
killedBy: ZoomDirective should create an instance
statusReason: Expected  to contain 'px-10'.
