[Killed] BlockStatement
src/app/search/search.component.ts:25:20
 
   constructor(private bookStoreService: BookStoreService) {}
 
-  ngOnInit(): void {
-    this.search$ = new Subject<string>();
-    this.search$
-      .pipe(
-        filter((text: string) => text.length > 2),
-        debounceTime(400),
-        tap(() => (this.isLoading = true)),
-        distinctUntilChanged(),
-        tap(() => (this.isLoading = true)),
-        switchMap((text) => this.bookStoreService.getAllSearch(text)),
-        tap(() => (this.isLoading = false))
-      )
-      .subscribe({
-        next: (books) => {
-          console.log('books: ');
-          console.table(books);
-          this.foundBooks = books as Book[];
-          return;
-        },
-        error: (e) => {
-          console.error(e);
-          this.isLoading = false;
-        }
-      });
-  }
+  ngOnInit(): void {}
 
   keyup(text: string) {
killedBy: SearchComponent should call BookStoreService.getAllSearch after 400ms if keyup() is called with a string longer then 2 chars and should subscribe and set foundBooks
statusReason: Expected false to be true.

[Killed] ArrowFunction
src/app/search/search.component.ts:29:16
     this.search$ = new Subject<string>();
     this.search$
       .pipe(
-        filter((text: string) => text.length > 2),
+        filter(() => undefined),
         debounceTime(400),
         tap(() => (this.isLoading = true)),
killedBy: SearchComponent should call BookStoreService.getAllSearch after 400ms if keyup() is called with a string longer then 2 chars and should subscribe and set foundBooks
statusReason: Expected false to be true.

[Survived] ArrowFunction
src/app/search/search.component.ts:31:13
       .pipe(
         filter((text: string) => text.length > 2),
         debounceTime(400),
-        tap(() => (this.isLoading = true)),
+        tap(() => undefined),
         distinctUntilChanged(),
         tap(() => (this.isLoading = true)),

[Survived] BooleanLiteral
src/app/search/search.component.ts:31:37
       .pipe(
         filter((text: string) => text.length > 2),
         debounceTime(400),
-        tap(() => (this.isLoading = true)),
+        tap(() => (this.isLoading = false)),
         distinctUntilChanged(),
         tap(() => (this.isLoading = true)),

[Killed] ArrowFunction
src/app/search/search.component.ts:34:19
         tap(() => (this.isLoading = true)),
         distinctUntilChanged(),
         tap(() => (this.isLoading = true)),
-        switchMap((text) => this.bookStoreService.getAllSearch(text)),
+        switchMap(() => undefined),
         tap(() => (this.isLoading = false))
       )
killedBy: SearchComponent should call BookStoreService.getAllSearch after 400ms if keyup() is called with a string longer then 2 chars and should subscribe and set foundBooks
statusReason: Expected false to be true.

[Killed] ObjectLiteral
src/app/search/search.component.ts:37:18
         switchMap((text) => this.bookStoreService.getAllSearch(text)),
         tap(() => (this.isLoading = false))
       )
-      .subscribe({
-        next: (books) => {
-          console.log('books: ');
-          console.table(books);
-          this.foundBooks = books as Book[];
-          return;
-        },
-        error: (e) => {
-          console.error(e);
-          this.isLoading = false;
-        }
-      });
+      .subscribe({});
   }
 
killedBy: SearchComponent should call BookStoreService.getAllSearch after 400ms if keyup() is called with a string longer then 2 chars and should subscribe and set foundBooks
statusReason: Expected undefined to equal [ Object({ authors: [ 'author' ], isbn: '1234567890', published: Date(Tue Feb 01 2022 19:00:00 GMT-0500 (Eastern Standard Time)), title: 'a title', subtitle: '', description: '', rating: 3, thumbnails: [ Object({ title: '', url: '' }) ] }) ].

[Killed] BlockStatement
src/app/search/search.component.ts:38:26
         tap(() => (this.isLoading = false))
       )
       .subscribe({
-        next: (books) => {
-          console.log('books: ');
-          console.table(books);
-          this.foundBooks = books as Book[];
-          return;
-        },
+        next: (books) => {},
         error: (e) => {
           console.error(e);
killedBy: SearchComponent should call BookStoreService.getAllSearch after 400ms if keyup() is called with a string longer then 2 chars and should subscribe and set foundBooks
statusReason: Expected undefined to equal [ Object({ authors: [ 'author' ], isbn: '1234567890', published: Date(Tue Feb 01 2022 19:00:00 GMT-0500 (Eastern Standard Time)), title: 'a title', subtitle: '', description: '', rating: 3, thumbnails: [ Object({ title: '', url: '' }) ] }) ].

[Survived] OptionalChaining
src/app/search/search.component.ts:52:5
   }
 
   keyup(text: string) {
-    this.search$?.next(text);
+    this.search$.next(text);
   }
 }
