[Killed] BlockStatement
src/app/shared/book-factory.service.ts:12:45
 export class BookFactoryService {
   constructor() {}
 
-  static getFromRaw(bookRaw: BookRaw): Book {
-    return {
-      ...bookRaw,
-      published: new Date(bookRaw.published)
-    };
-  }
+  static getFromRaw(bookRaw: BookRaw): Book {}
   static getRawFromBook(book: Book): BookRaw {
     return <BookRaw>{
killedBy: BookFactoryService should convert from Book to BookRaw; BookStoreService .delete(isbn) with Testbed should get a book with isbn with 3 retries , if the first and second try fails; BookStoreService .getAll() but without Testbed should call http GET with url and return a Book converted from BookRaw
statusReason: Expected undefined to equal Object({ authors: [ 'author' ], isbn: '1234567890', published: Date(Tue Feb 01 2022 19:00:00 GMT-0500 (Eastern Standard Time)), title: 'a title', subtitle: '', description: '', rating: 3, thumbnails: [ Object({ title: '', url: '' }) ] }).

[Killed] BlockStatement
src/app/shared/book-factory.service.ts:18:46
       published: new Date(bookRaw.published)
     };
   }
-  static getRawFromBook(book: Book): BookRaw {
-    return <BookRaw>{
-      ...book,
-      published: formatDate(book.published, 'YYYY-MM-dd', 'en', 'Z')
-    };
-  }
+  static getRawFromBook(book: Book): BookRaw {}
   static getEmptyBook(): Book {
     return {
killedBy: BookFactoryService should convert from BookRaw to Book; BookStoreService .getAll() but without Testbed should call http PUT with book and return ok
statusReason: Expected undefined to equal Object({ authors: [ 'author' ], isbn: '1234567890', published: '2022-02-02', title: 'a title', subtitle: '', description: '', rating: 3, thumbnails: [ Object({ title: '', url: '' }) ] }).

[Killed] BlockStatement
src/app/shared/book-factory.service.ts:24:31
       published: formatDate(book.published, 'YYYY-MM-dd', 'en', 'Z')
     };
   }
-  static getEmptyBook(): Book {
-    return {
-      title: '',
-      subtitle: '',
-      authors: [],
-      published: new Date('2022-02-02'),
-      isbn: '',
-      thumbnails: [],
-      rating: 0,
-      description: ''
-    };
-  }
+  static getEmptyBook(): Book {}
 }
 
killedBy: BookFactoryService should get an empty book
statusReason: TypeError: Cannot read properties of undefined (reading 'title')

[Killed] ObjectLiteral
src/app/shared/book-factory.service.ts:25:12
     };
   }
   static getEmptyBook(): Book {
-    return {
-      title: '',
-      subtitle: '',
-      authors: [],
-      published: new Date('2022-02-02'),
-      isbn: '',
-      thumbnails: [],
-      rating: 0,
-      description: ''
-    };
+    return {};
   }
 }
killedBy: BookFactoryService should get an empty book
statusReason: Expected undefined to equal ''.

[Survived] ArrayDeclaration
src/app/shared/book-factory.service.ts:31:19
       authors: [],
       published: new Date('2022-02-02'),
       isbn: '',
-      thumbnails: [],
+      thumbnails: ["Stryker was here"],
       rating: 0,
       description: ''
