[Killed] BlockStatement
src/app/shared/book-store.service.ts:18:60
 export class BookStoreService {
   constructor(private http: HttpClient) {}
 
-  deleteBook(isbn: string | undefined): Observable<string> {
-    return this.http
-      .delete(`https://api4.angular-buch.com/secure/book/${isbn}`, {
-        responseType: 'text' // needed because the api will not answer with JSON, but Angulars HttpClient defaults zu JSON
-      })
-      .pipe(retry({ count: 3, delay: 1000 }), catchError(this.processError));
-  }
+  deleteBook(isbn: string | undefined): Observable<string> {}
 
   postBook(book: Book): Observable<string> {
killedBy: BookStoreService .delete(isbn) with Testbed should delete a book with isbn with 3 retries , if the first and second try fails
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Survived] ObjectLiteral
src/app/shared/book-store.service.ts:20:68
 
   deleteBook(isbn: string | undefined): Observable<string> {
     return this.http
-      .delete(`https://api4.angular-buch.com/secure/book/${isbn}`, {
-        responseType: 'text' // needed because the api will not answer with JSON, but Angulars HttpClient defaults zu JSON
-      })
+      .delete(`https://api4.angular-buch.com/secure/book/${isbn}`, {})
       .pipe(retry({ count: 3, delay: 1000 }), catchError(this.processError));
   }

[Killed] BlockStatement
src/app/shared/book-store.service.ts:26:44
       .pipe(retry({ count: 3, delay: 1000 }), catchError(this.processError));
   }
 
-  postBook(book: Book): Observable<string> {
-    const bookRaw = BookFactoryService.getRawFromBook(book);
-
-    return this.http
-      .post('https://api4.angular-buch.com/secure/book', bookRaw, {
-        responseType: 'text'
-      })
-      .pipe(
-        tap((val) => console.log('post book return: ' + JSON.stringify(val))),
-        catchError(this.processError)
-      );
-  }
+  postBook(book: Book): Observable<string> {}
   putBook(book: Book): Observable<string> {
     const bookRaw = BookFactoryService.getRawFromBook(book);
killedBy: BookStoreService .getAll() but without Testbed should call http POST with book and return ok
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Survived] ArrowFunction
src/app/shared/book-store.service.ts:34:13
         responseType: 'text'
       })
       .pipe(
-        tap((val) => console.log('post book return: ' + JSON.stringify(val))),
+        tap(() => undefined),
         catchError(this.processError)
       );

[Killed] BlockStatement
src/app/shared/book-store.service.ts:38:43
         catchError(this.processError)
       );
   }
-  putBook(book: Book): Observable<string> {
-    const bookRaw = BookFactoryService.getRawFromBook(book);
-    return this.http
-      .put(`https://api4.angular-buch.com/secure/book/${book.isbn}`, bookRaw, {
-        responseType: 'text'
-      })
-      .pipe(catchError(this.processError));
-  }
+  putBook(book: Book): Observable<string> {}
 
   getBook(isbn: string | null) {
killedBy: BookStoreService .getAll() but without Testbed should call http PUT with book and return ok
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] StringLiteral
src/app/shared/book-store.service.ts:42:23
     const bookRaw = BookFactoryService.getRawFromBook(book);
     return this.http
       .put(`https://api4.angular-buch.com/secure/book/${book.isbn}`, bookRaw, {
-        responseType: 'text'
+        responseType: ""
       })
       .pipe(catchError(this.processError));
killedBy: BookStoreService .getAll() but without Testbed should call http PUT with book and return ok
statusReason: Expected spy httpStub.put to have been called only once, and with given args:
  [ 'https://api4.angular-buch.com/secure/book/123', Object({ title: 'string', authors: [  ], published: '2020-02-01', isbn: '123' }), Object({ responseType: 'text' }) ]
But the actual call was:
  [ 'https://api4.angular-buch.com/secure/book/123', Object({ title: 'string', authors: [  ], published: '2020-02-01', isbn: '1

[Killed] BlockStatement
src/app/shared/book-store.service.ts:47:32
       .pipe(catchError(this.processError));
   }
 
-  getBook(isbn: string | null) {
-    return this.http
-      .get<BookRaw>(`https://api4.angular-buch.com/secure/book/${isbn}`)
-      .pipe(
-        retry({ count: 3, delay: 1000 }),
-        catchError(this.processError),
-        map((rawBook) => BookFactoryService.getFromRaw(rawBook)),
-        delay(1000)
-      );
-  }
+  getBook(isbn: string | null) {}
   getBookFast(isbn: string | null): Observable<Book | null> {
     return this.http
killedBy: BookStoreService .delete(isbn) with Testbed should get a book with isbn with 3 retries , if the first and second try fails; BookStoreService .getAll() but without Testbed should call http GET with url and isbn and try 3 times if an error occurs and return this Book converted from BookRaw
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] ArrowFunction
src/app/shared/book-store.service.ts:53:13
       .pipe(
         retry({ count: 3, delay: 1000 }),
         catchError(this.processError),
-        map((rawBook) => BookFactoryService.getFromRaw(rawBook)),
+        map(() => undefined),
         delay(1000)
       );
killedBy: BookStoreService .delete(isbn) with Testbed should get a book with isbn with 3 retries , if the first and second try fails; BookStoreService .getAll() but without Testbed should call http GET with url and isbn and try 3 times if an error occurs and return this Book converted from BookRaw
statusReason: TypeError: Cannot read properties of undefined (reading 'title')

[Killed] BlockStatement
src/app/shared/book-store.service.ts:57:61
         delay(1000)
       );
   }
-  getBookFast(isbn: string | null): Observable<Book | null> {
-    return this.http
-      .get<BookRaw>(`https://api4.angular-buch.com/secure/book/${isbn}`)
-      .pipe(
-        catchError(this.processError),
-        map((rawBook) => BookFactoryService.getFromRaw(rawBook))
-      );
-  }
+  getBookFast(isbn: string | null): Observable<Book | null> {}
 
   getAll(): Observable<Book[]> {
killedBy: BookStoreService .getAll() but without Testbed should call http GET with url and isbn and return this Book converted from BookRaw
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] ArrowFunction
src/app/shared/book-store.service.ts:62:13
       .get<BookRaw>(`https://api4.angular-buch.com/secure/book/${isbn}`)
       .pipe(
         catchError(this.processError),
-        map((rawBook) => BookFactoryService.getFromRaw(rawBook))
+        map(() => undefined)
       );
   }
killedBy: BookStoreService .getAll() but without Testbed should call http GET with url and isbn and return this Book converted from BookRaw
statusReason: Expected undefined to equal 'string'.

[Killed] BlockStatement
src/app/shared/book-store.service.ts:66:32
       );
   }
 
-  getAll(): Observable<Book[]> {
-    return this.http
-      .get<BookRaw[]>('https://api4.angular-buch.com/secure/books')
-      .pipe(
-        retry({ count: 3, delay: 1000 }),
-        catchError(this.processError),
-        map((rawBooksArray: BookRaw[]): Book[] =>
-          rawBooksArray.map((rawBook) => BookFactoryService.getFromRaw(rawBook))
-        ),
-        delay(1000)
-      );
-  }
+  getAll(): Observable<Book[]> {}
 
   getAllSearch(text: string): Observable<Book[]> {
killedBy: BookStoreService .getAll() but without Testbed should call http GET with url and return a Book converted from BookRaw
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] ArrowFunction
src/app/shared/book-store.service.ts:72:13
       .pipe(
         retry({ count: 3, delay: 1000 }),
         catchError(this.processError),
-        map((rawBooksArray: BookRaw[]): Book[] =>
-          rawBooksArray.map((rawBook) => BookFactoryService.getFromRaw(rawBook))
+        map(() => undefined
         ),
         delay(1000)
killedBy: BookStoreService .getAll() but without Testbed should call http GET with url and return a Book converted from BookRaw
statusReason: Uncaught TypeError: Cannot read properties of undefined (reading 'length') thrown, Error: Timeout - Async function did not complete within 5000ms (set by jasmine.DEFAULT_TIMEOUT_INTERVAL)

[Killed] ArrowFunction
src/app/shared/book-store.service.ts:73:29
         retry({ count: 3, delay: 1000 }),
         catchError(this.processError),
         map((rawBooksArray: BookRaw[]): Book[] =>
-          rawBooksArray.map((rawBook) => BookFactoryService.getFromRaw(rawBook))
+          rawBooksArray.map(() => undefined)
         ),
         delay(1000)
killedBy: BookStoreService .getAll() but without Testbed should call http GET with url and return a Book converted from BookRaw
statusReason: Uncaught TypeError: Cannot read properties of undefined (reading 'title') thrown, Error: Timeout - Async function did not complete within 5000ms (set by jasmine.DEFAULT_TIMEOUT_INTERVAL)

[Killed] BlockStatement
src/app/shared/book-store.service.ts:79:50
       );
   }
 
-  getAllSearch(text: string): Observable<Book[]> {
-    return this.http
-      .get<BookRaw[]>(
-        `https://api4.angular-buch.com/secure/books/search/${text}`
-      )
-      .pipe(
-        retry({ count: 3, delay: 1000 }),
-        catchError(this.processError),
-        map((rawBooksArray: BookRaw[]): Book[] =>
-          rawBooksArray.map((rawBook) => BookFactoryService.getFromRaw(rawBook))
-        )
-      );
-  }
+  getAllSearch(text: string): Observable<Book[]> {}
 
   private processError(err: HttpErrorResponse): Observable<any> {
killedBy: BookStoreService .getAll() but without Testbed should call http get with search string and return list of books
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] BlockStatement
src/app/shared/book-store.service.ts:93:65
       );
   }
 
-  private processError(err: HttpErrorResponse): Observable<any> {
-    //console.error('Service HttpErrorResponse: ' + JSON.stringify(err));
-    return throwError(() => err);
-  }
+  private processError(err: HttpErrorResponse): Observable<any> {}
 }
 
killedBy: BookStoreService .delete(isbn) with Testbed should throw error when even the 3rd retry fails 
statusReason: Expected undefined to equal 404.
