[Killed] BlockStatement
app/books/book-details/book-details.component.ts:25:20
     private bookService: BookStoreService
   ) {}
 
-  ngOnInit(): void {
-    this.route.paramMap.subscribe((params) => {
-      let isbn: string | null;
-      if ((isbn = params.get('isbn')) != null) {
-        this.getABook(isbn);
-      } else {
-        console.error(
-          'no isbn param found in route, rerouting to /home (should actually route to an error page) '
-        );
-        this.router.navigate(['/home']);
-      }
-    });
-  }
+  ngOnInit(): void {}
 
   getABook(isbn: string) {
killedBy: BookDetailsComponent and IsbnPipe when initializes properly should subscribe to route.paramMap onInit() and get the isbn param and get the book with that isbn from bookstoreServiceand show all the boo; BookDetailsComponent and IsbnPipe should subscribe to route.paramMap onInit() and get the isbn param and show the error html if  bookstoreService returns an error
statusReason: Expected spy paramMap to have been called once. It was called 0 times.

[Killed] BlockStatement
app/books/book-details/book-details.component.ts:26:47
   ) {}
 
   ngOnInit(): void {
-    this.route.paramMap.subscribe((params) => {
-      let isbn: string | null;
-      if ((isbn = params.get('isbn')) != null) {
-        this.getABook(isbn);
-      } else {
-        console.error(
-          'no isbn param found in route, rerouting to /home (should actually route to an error page) '
-        );
-        this.router.navigate(['/home']);
-      }
-    });
+    this.route.paramMap.subscribe((params) => {});
   }
 
killedBy: BookDetailsComponent and IsbnPipe when initializes properly should subscribe to route.paramMap onInit() and get the isbn param and get the book with that isbn from bookstoreServiceand show all the boo; BookDetailsComponent and IsbnPipe should subscribe to route.paramMap onInit() and get the isbn param and show the error html if  bookstoreService returns an error
statusReason: Expected spy unknown to have been called once. It was called 0 times.

[Killed] BlockStatement
app/books/book-details/book-details.component.ts:28:48
   ngOnInit(): void {
     this.route.paramMap.subscribe((params) => {
       let isbn: string | null;
-      if ((isbn = params.get('isbn')) != null) {
-        this.getABook(isbn);
-      } else {
+      if ((isbn = params.get('isbn')) != null) {} else {
         console.error(
           'no isbn param found in route, rerouting to /home (should actually route to an error page) '
killedBy: BookDetailsComponent and IsbnPipe when initializes properly should subscribe to route.paramMap onInit() and get the isbn param and get the book with that isbn from bookstoreServiceand show all the boo; BookDetailsComponent and IsbnPipe should subscribe to route.paramMap onInit() and get the isbn param and show the error html if  bookstoreService returns an error
statusReason: Expected spy unknown to have been called once. It was called 0 times.

[Killed] BlockStatement
app/books/book-details/book-details.component.ts:30:14
       let isbn: string | null;
       if ((isbn = params.get('isbn')) != null) {
         this.getABook(isbn);
-      } else {
-        console.error(
-          'no isbn param found in route, rerouting to /home (should actually route to an error page) '
-        );
-        this.router.navigate(['/home']);
-      }
+      } else {}
     });
   }
killedBy: BookDetailsComponent and IsbnPipe should log  an error to console and reroute to /home, if it tries to subscribe to route.paramMap onInit() and don't get the isbn param 
statusReason: Expected spy error to have been called once. It was called 0 times.

[Killed] BlockStatement
app/books/book-details/book-details.component.ts:39:26
     });
   }
 
-  getABook(isbn: string) {
-    this.bookService.getBook(isbn).subscribe({
-      next: (book) => {
-        this.book = book;
-      },
-      error: (err: HttpErrorResponse) => (this.error = err)
-    });
-  }
+  getABook(isbn: string) {}
 
   readonly confirmMessage = 'Really delete book?';
killedBy: BookDetailsComponent and IsbnPipe when initializes properly should subscribe to route.paramMap onInit() and get the isbn param and get the book with that isbn from bookstoreServiceand show all the boo; BookDetailsComponent and IsbnPipe should subscribe to route.paramMap onInit() and get the isbn param and show the error html if  bookstoreService returns an error
statusReason: Expected spy unknown to have been called once. It was called 0 times.

[Killed] BlockStatement
app/books/book-details/book-details.component.ts:41:23
 
   getABook(isbn: string) {
     this.bookService.getBook(isbn).subscribe({
-      next: (book) => {
-        this.book = book;
-      },
+      next: (book) => {},
       error: (err: HttpErrorResponse) => (this.error = err)
     });
killedBy: BookDetailsComponent and IsbnPipe when initializes properly should subscribe to route.paramMap onInit() and get the isbn param and get the book with that isbn from bookstoreServiceand show all the boo
statusReason: Expected undefined to equal Object({ authors: [ 'author' ], isbn: '1234567890', published: Date(Tue Feb 01 2022 16:00:00 GMT-0800 (Pacific Standard Time)), title: 'a title', subtitle: '', description: '', rating: 3, thumbnails: [ Object({ title: '', url: '' }) ] }).

[Killed] ArrowFunction
app/books/book-details/book-details.component.ts:44:14
       next: (book) => {
         this.book = book;
       },
-      error: (err: HttpErrorResponse) => (this.error = err)
+      error: () => undefined
     });
   }
killedBy: BookDetailsComponent and IsbnPipe should subscribe to route.paramMap onInit() and get the isbn param and show the error html if  bookstoreService returns an error
statusReason: Expected undefined to contain '"status":404'.

[Killed] BlockStatement
app/books/book-details/book-details.component.ts:50:42
 
   readonly confirmMessage = 'Really delete book?';
 
-  delete(isbn: string | undefined): void {
-    this.confirm(this.confirmMessage).subscribe((ok) => {
-      if (ok) {
-        this.reallyDelete(isbn);
-      }
-    });
-  }
+  delete(isbn: string | undefined): void {}
 
   reallyDelete(isbn: string | undefined): void {
killedBy: BookDetailsComponent and IsbnPipe when initializes properly should subscribe a to a confirmation window, and call this.bookService.deleteBook(isbn) if the confirmation is true, and show an error when ; BookDetailsComponent and IsbnPipe should subscribe a to a confirmation window, and call this.bookService.deleteBook(isbn) if the confirmation is true, and navigate to "/books/list" when the bookServic
statusReason: Expected spy unknown to have been called only once, and with given args:
  [ '1234567890' ]
But it was never called.


Error: Expected spy unknown to have been called only once, and with given args:
  [ '1234567890' ]
But it was never called.

[Killed] BlockStatement
app/books/book-details/book-details.component.ts:51:57
   readonly confirmMessage = 'Really delete book?';
 
   delete(isbn: string | undefined): void {
-    this.confirm(this.confirmMessage).subscribe((ok) => {
-      if (ok) {
-        this.reallyDelete(isbn);
-      }
-    });
+    this.confirm(this.confirmMessage).subscribe((ok) => {});
   }
 
killedBy: BookDetailsComponent and IsbnPipe when initializes properly should subscribe a to a confirmation window, and call this.bookService.deleteBook(isbn) if the confirmation is true, and show an error when ; BookDetailsComponent and IsbnPipe should subscribe a to a confirmation window, and call this.bookService.deleteBook(isbn) if the confirmation is true, and navigate to "/books/list" when the bookServic
statusReason: Expected spy unknown to have been called only once, and with given args:
  [ '1234567890' ]
But it was never called.


Error: Expected spy unknown to have been called only once, and with given args:
  [ '1234567890' ]
But it was never called.

[Killed] BlockStatement
app/books/book-details/book-details.component.ts:52:15
 
   delete(isbn: string | undefined): void {
     this.confirm(this.confirmMessage).subscribe((ok) => {
-      if (ok) {
-        this.reallyDelete(isbn);
-      }
+      if (ok) {}
     });
   }
killedBy: BookDetailsComponent and IsbnPipe when initializes properly should subscribe a to a confirmation window, and call this.bookService.deleteBook(isbn) if the confirmation is true, and show an error when ; BookDetailsComponent and IsbnPipe should subscribe a to a confirmation window, and call this.bookService.deleteBook(isbn) if the confirmation is true, and navigate to "/books/list" when the bookServic
statusReason: Expected spy unknown to have been called only once, and with given args:
  [ '1234567890' ]
But it was never called.


Error: Expected spy unknown to have been called only once, and with given args:
  [ '1234567890' ]
But it was never called.

[Killed] ConditionalExpression
app/books/book-details/book-details.component.ts:52:11
 
   delete(isbn: string | undefined): void {
     this.confirm(this.confirmMessage).subscribe((ok) => {
-      if (ok) {
+      if (false) {
         this.reallyDelete(isbn);
       }
killedBy: BookDetailsComponent and IsbnPipe when initializes properly should subscribe a to a confirmation window, and call this.bookService.deleteBook(isbn) if the confirmation is true, and show an error when ; BookDetailsComponent and IsbnPipe should subscribe a to a confirmation window, and call this.bookService.deleteBook(isbn) if the confirmation is true, and navigate to "/books/list" when the bookServic
statusReason: Expected spy unknown to have been called only once, and with given args:
  [ '1234567890' ]
But it was never called.


Error: Expected spy unknown to have been called only once, and with given args:
  [ '1234567890' ]
But it was never called.

[Killed] BlockStatement
app/books/book-details/book-details.component.ts:58:48
     });
   }
 
-  reallyDelete(isbn: string | undefined): void {
-    this.bookService.deleteBook(isbn).subscribe({
-      next: () => {
-        this.router.navigate(['/books/list']);
-      },
-      error: (err) => {
-        this.error = err;
-      }
-    });
-  }
+  reallyDelete(isbn: string | undefined): void {}
 
   confirm(message?: string): Observable<boolean> {
killedBy: BookDetailsComponent and IsbnPipe when initializes properly should subscribe a to a confirmation window, and call this.bookService.deleteBook(isbn) if the confirmation is true, and show an error when ; BookDetailsComponent and IsbnPipe should subscribe a to a confirmation window, and call this.bookService.deleteBook(isbn) if the confirmation is true, and navigate to "/books/list" when the bookServic
statusReason: Expected spy unknown to have been called only once, and with given args:
  [ '1234567890' ]
But it was never called.


Error: Expected spy unknown to have been called only once, and with given args:
  [ '1234567890' ]
But it was never called.

[Killed] BlockStatement
app/books/book-details/book-details.component.ts:60:19
 
   reallyDelete(isbn: string | undefined): void {
     this.bookService.deleteBook(isbn).subscribe({
-      next: () => {
-        this.router.navigate(['/books/list']);
-      },
+      next: () => {},
       error: (err) => {
         this.error = err;
killedBy: BookDetailsComponent and IsbnPipe should subscribe a to a confirmation window, and call this.bookService.deleteBook(isbn) if the confirmation is true, and navigate to "/books/list" when the bookServic
statusReason: Expected spy navigate to have been called only once, and with given args:
  [ [ '/books/list' ] ]
But it was never called.


Error: Expected spy navigate to have been called only once, and with given args:
  [ [ '/books/list' ] ]
But it was never called.

[Killed] ArrayDeclaration
app/books/book-details/book-details.component.ts:61:30
   reallyDelete(isbn: string | undefined): void {
     this.bookService.deleteBook(isbn).subscribe({
       next: () => {
-        this.router.navigate(['/books/list']);
+        this.router.navigate([]);
       },
       error: (err) => {
killedBy: BookDetailsComponent and IsbnPipe should subscribe a to a confirmation window, and call this.bookService.deleteBook(isbn) if the confirmation is true, and navigate to "/books/list" when the bookServic
statusReason: Expected spy navigate to have been called only once, and with given args:
  [ [ '/books/list' ] ]
But the actual call was:
  [ [  ] ].
Expected $[0].length = 0 to equal 1.
Expected $[0][0] = undefined to equal '/books/list'.

[Killed] BlockStatement
app/books/book-details/book-details.component.ts:63:23
       next: () => {
         this.router.navigate(['/books/list']);
       },
-      error: (err) => {
-        this.error = err;
-      }
+      error: (err) => {}
     });
   }
killedBy: BookDetailsComponent and IsbnPipe when initializes properly should subscribe a to a confirmation window, and call this.bookService.deleteBook(isbn) if the confirmation is true, and show an error when 
statusReason: Expected undefined to be defined.
