[Killed] BlockStatement
app/books/book-list/book-list.component.ts:21:20
 
   constructor(private bs: BookStoreService, private cd: ChangeDetectorRef) {}
 
-  ngOnInit(): void {
-    this.books$ = this.bs.getAll().pipe(
-      catchError((err) => {
-        this.error = err;
-        this.cd.detectChanges();
-        return of(null);
-      })
-    );
-    this.listView = true;
-  }
+  ngOnInit(): void {}
 }
 
killedBy: BookListComponent should create and get the of(book[]) 
statusReason: Expected undefined to be defined.

[Killed] BooleanLiteral
app/books/book-list/book-list.component.ts:29:21
         return of(null);
       })
     );
-    this.listView = true;
+    this.listView = false;
   }
 }
killedBy: BookListComponent should create and get the of(book[]) 
statusReason: Expected false to be true.
