[Killed] ConditionalExpression
app/books/shared/isbn.pipe.ts:8:9
 })
 export class IsbnPipe implements PipeTransform {
   transform(value: unknown, ...args: unknown[]): unknown {
-    if (value) {
+    if (false) {
       return (value as string).slice(0, 3) + '-' + (value as string).slice(3);
     } else {
killedBy: BookDetailsComponent and IsbnPipe when initializes properly should subscribe to route.paramMap onInit() and get the isbn param and get the book with that isbn from bookstoreServiceand show all the boo; IsbnPipe should transform an ISBN number with dash
statusReason: Expected -1 to be greater than -1.

[Killed] ConditionalExpression
app/books/shared/isbn.pipe.ts:8:9
 })
 export class IsbnPipe implements PipeTransform {
   transform(value: unknown, ...args: unknown[]): unknown {
-    if (value) {
+    if (true) {
       return (value as string).slice(0, 3) + '-' + (value as string).slice(3);
     } else {
killedBy: BookListItemComponent should create
statusReason: TypeError: Cannot read properties of null (reading 'slice')

[Killed] MethodExpression
app/books/shared/isbn.pipe.ts:9:14
 export class IsbnPipe implements PipeTransform {
   transform(value: unknown, ...args: unknown[]): unknown {
     if (value) {
-      return (value as string).slice(0, 3) + '-' + (value as string).slice(3);
+      return value as string + '-' + (value as string).slice(3);
     } else {
       return undefined;
killedBy: BookDetailsComponent and IsbnPipe when initializes properly should subscribe to route.paramMap onInit() and get the isbn param and get the book with that isbn from bookstoreServiceand show all the boo; IsbnPipe should transform an ISBN number with dash
statusReason: Expected -1 to be greater than -1.

[Killed] MethodExpression
app/books/shared/isbn.pipe.ts:9:52
 export class IsbnPipe implements PipeTransform {
   transform(value: unknown, ...args: unknown[]): unknown {
     if (value) {
-      return (value as string).slice(0, 3) + '-' + (value as string).slice(3);
+      return (value as string).slice(0, 3) + '-' + value as string;
     } else {
       return undefined;
killedBy: BookDetailsComponent and IsbnPipe when initializes properly should subscribe to route.paramMap onInit() and get the isbn param and get the book with that isbn from bookstoreServiceand show all the boo; IsbnPipe should transform an ISBN number with dash
statusReason: Expected -1 to be greater than -1.
