[Killed] BooleanLiteral
app/books/shared/zoom.directive.ts:10:26
   // make class="px-10 pt-10 pb-10 if mouse is NOT over , i.e. image is smaller because of padding 10,
   // otherwise,
   // if mouse is over, then no classes, so image appears bigger, no padding
-  smallActive: boolean = true;
+  smallActive: boolean = false;
 
   @HostBinding('class')
killedBy: ZoomDirective should create an instance
statusReason: Expected  to contain 'px-10'.

[Killed] BlockStatement
app/books/shared/zoom.directive.ts:22:13
   }
 
   @HostListener('mouseenter')
-  smallOn() {
-    this.smallActive = false;
-  }
+  smallOn() {}
   @HostListener('mouseleave')
   smallOff() {
killedBy: ZoomDirective should create an instance
statusReason: Expected pb-10 pt-10 px-10 not to contain 'px-10'.

[Killed] BooleanLiteral
app/books/shared/zoom.directive.ts:23:24
 
   @HostListener('mouseenter')
   smallOn() {
-    this.smallActive = false;
+    this.smallActive = true;
   }
   @HostListener('mouseleave')
killedBy: ZoomDirective should create an instance
statusReason: Expected pb-10 pt-10 px-10 not to contain 'px-10'.

[Killed] BlockStatement
app/books/shared/zoom.directive.ts:26:14
     this.smallActive = false;
   }
   @HostListener('mouseleave')
-  smallOff() {
-    this.smallActive = true;
-  }
+  smallOff() {}
   constructor() {}
 }
killedBy: ZoomDirective should create an instance
statusReason: Expected  to contain 'px-10'.

[Killed] BooleanLiteral
app/books/shared/zoom.directive.ts:27:24
   }
   @HostListener('mouseleave')
   smallOff() {
-    this.smallActive = true;
+    this.smallActive = false;
   }
   constructor() {}
killedBy: ZoomDirective should create an instance
statusReason: Expected  to contain 'px-10'.
