[Killed] BooleanLiteral
src/app/search/search.component.ts:21:24
 export class SearchComponent implements OnInit {
   private search$: Subject<string> | undefined;
   foundBooks: Book[] | undefined;
-  isLoading: boolean = false;
+  isLoading: boolean = true;
 
   constructor(private bookStoreService: BookStoreService) {}
killedBy: SearchComponent should call BookStoreService.getAllSearch after 400ms if keyup() is called with a string longer then 2 chars and should subscribe and set foundBooks
statusReason: Expected true to be false.

[Killed] BlockStatement
src/app/search/search.component.ts:25:20
 
   constructor(private bookStoreService: BookStoreService) {}
 
-  ngOnInit(): void {
-    this.search$ = new Subject<string>();
-    this.search$
-      .pipe(
-        filter((text: string) => text.length > 2),
-        debounceTime(400),
-        distinctUntilChanged(),
-        tap(() => (this.isLoading = true)),
-        switchMap((text) => this.bookStoreService.getAllSearch(text)),
-        tap(() => (this.isLoading = false))
-      )
-      .subscribe({
-        next: (books) => {
-          //console.log('books: ');
-          //console.table(books);
-          this.foundBooks = books as Book[];
-          return;
-        },
-        error: (e) => {
-          console.error(e);
-          this.isLoading = false;
-        }
-      });
-  }
+  ngOnInit(): void {}
 
   keyup(text: string) {
killedBy: SearchComponent should call BookStoreService.getAllSearch after 400ms if keyup() is called with a string longer then 2 chars and should subscribe and set foundBooks
statusReason: Expected false to be true.

[Killed] ConditionalExpression
src/app/search/search.component.ts:29:34
     this.search$ = new Subject<string>();
     this.search$
       .pipe(
-        filter((text: string) => text.length > 2),
+        filter((text: string) => true),
         debounceTime(400),
         distinctUntilChanged(),
killedBy: SearchComponent should not call BookStoreService.getAllSearch after 400ms if keyup() is called with a string of only  2 chars and should not subscribe and set foundBooks
statusReason: Expected true to be false.

[Killed] ConditionalExpression
src/app/search/search.component.ts:29:34
     this.search$ = new Subject<string>();
     this.search$
       .pipe(
-        filter((text: string) => text.length > 2),
+        filter((text: string) => false),
         debounceTime(400),
         distinctUntilChanged(),
killedBy: SearchComponent should call BookStoreService.getAllSearch after 400ms if keyup() is called with a string longer then 2 chars and should subscribe and set foundBooks
statusReason: Expected false to be true.

[Killed] ArrowFunction
src/app/search/search.component.ts:32:13
         filter((text: string) => text.length > 2),
         debounceTime(400),
         distinctUntilChanged(),
-        tap(() => (this.isLoading = true)),
+        tap(() => undefined),
         switchMap((text) => this.bookStoreService.getAllSearch(text)),
         tap(() => (this.isLoading = false))
killedBy: SearchComponent should call BookStoreService.getAllSearch after 400ms if keyup() is called with a string longer then 2 chars and should subscribe and set foundBooks
statusReason: Expected false to be true.

[Killed] BooleanLiteral
src/app/search/search.component.ts:32:37
         filter((text: string) => text.length > 2),
         debounceTime(400),
         distinctUntilChanged(),
-        tap(() => (this.isLoading = true)),
+        tap(() => (this.isLoading = false)),
         switchMap((text) => this.bookStoreService.getAllSearch(text)),
         tap(() => (this.isLoading = false))
killedBy: SearchComponent should call BookStoreService.getAllSearch after 400ms if keyup() is called with a string longer then 2 chars and should subscribe and set foundBooks
statusReason: Expected false to be true.

[Killed] BooleanLiteral
src/app/search/search.component.ts:34:37
         distinctUntilChanged(),
         tap(() => (this.isLoading = true)),
         switchMap((text) => this.bookStoreService.getAllSearch(text)),
-        tap(() => (this.isLoading = false))
+        tap(() => (this.isLoading = true))
       )
       .subscribe({
killedBy: SearchComponent should call BookStoreService.getAllSearch after 400ms if keyup() is called with a string longer then 2 chars and should subscribe and set foundBooks
statusReason: Expected true to be false.

[Killed] ArrowFunction
src/app/search/search.component.ts:34:13
         distinctUntilChanged(),
         tap(() => (this.isLoading = true)),
         switchMap((text) => this.bookStoreService.getAllSearch(text)),
-        tap(() => (this.isLoading = false))
+        tap(() => undefined)
       )
       .subscribe({
killedBy: SearchComponent should call BookStoreService.getAllSearch after 400ms if keyup() is called with a string longer then 2 chars and should subscribe and set foundBooks
statusReason: Expected true to be false.

[Killed] BlockStatement
src/app/search/search.component.ts:37:26
         tap(() => (this.isLoading = false))
       )
       .subscribe({
-        next: (books) => {
-          //console.log('books: ');
-          //console.table(books);
-          this.foundBooks = books as Book[];
-          return;
-        },
+        next: (books) => {},
         error: (e) => {
           console.error(e);
killedBy: SearchComponent should call BookStoreService.getAllSearch after 400ms if keyup() is called with a string longer then 2 chars and should subscribe and set foundBooks
statusReason: Expected undefined to equal [ Object({ authors: [ 'author' ], isbn: '1234567890', published: Date(Tue Feb 01 2022 16:00:00 GMT-0800 (Pacific Standard Time)), title: 'a title', subtitle: '', description: '', rating: 3, thumbnails: [ Object({ title: '', url: '' }) ] }) ].

[Killed] BlockStatement
src/app/search/search.component.ts:43:23
           this.foundBooks = books as Book[];
           return;
         },
-        error: (e) => {
-          console.error(e);
-          this.isLoading = false;
-        }
+        error: (e) => {}
       });
   }
killedBy: SearchComponent should call BookStoreService.getAllSearch after 400ms if keyup() is called with a string longer then 2 chars and should print error on console
statusReason: Expected spy error to have been called once. It was called 0 times.

[Killed] BooleanLiteral
src/app/search/search.component.ts:45:28
         },
         error: (e) => {
           console.error(e);
-          this.isLoading = false;
+          this.isLoading = true;
         }
       });
killedBy: SearchComponent should call BookStoreService.getAllSearch after 400ms if keyup() is called with a string longer then 2 chars and should print error on console
statusReason: Expected true to be false.

[Killed] BlockStatement
src/app/search/search.component.ts:50:23
       });
   }
 
-  keyup(text: string) {
-    this.search$?.next(text);
-  }
+  keyup(text: string) {}
 }
 
killedBy: SearchComponent should call BookStoreService.getAllSearch after 400ms if keyup() is called with a string longer then 2 chars and should subscribe and set foundBooks
statusReason: Expected false to be true.
