[Killed] StringLiteral
src/app/shared/book-factory.service.ts:21:45
   static getRawFromBook(book: Book): BookRaw {
     return <BookRaw>{
       ...book,
-      published: formatDate(book.published, 'YYYY-MM-dd', 'en', 'Z')
+      published: formatDate(book.published, "", 'en', 'Z')
     };
   }
killedBy: BookFactoryService should convert from BookRaw to Book; BookStoreService  but without Testbed putBook() should call http PUT with book and return ok
statusReason: Expected $.published = '' to equal '2022-02-02'.

[Killed] ArrayDeclaration
src/app/shared/book-factory.service.ts:28:16
     return {
       title: '',
       subtitle: '',
-      authors: [],
+      authors: ["Stryker was here"],
       published: new Date('2022-02-02'),
       isbn: '',
killedBy: BookFactoryService should get an empty book
statusReason: Expected $.length = 1 to equal 0.
Unexpected $[0] = 'Stryker was here' in array.
