[Killed] StringLiteral
src/app/shared/book-store.service.ts:20:15
 
   deleteBook(isbn: string | undefined): Observable<string> {
     return this.http
-      .delete(`https://api4.angular-buch.com/secure/book/${isbn}`, {
+      .delete(``, {
         responseType: 'text' // needed because the api will not answer with JSON, but Angulars HttpClient defaults zu JSON
       })
killedBy: BookStoreService  with Testbed should call deleteBook() and delete a book with isbn with 3 retries , if the first and second try fails
statusReason: Error: Expected one matching request for criteria "Match URL: https://api4.angular-buch.com/secure/book/123", found none. Requests received are: DELETE .

[Killed] StringLiteral
src/app/shared/book-store.service.ts:59:21
   }
   getBookFast(isbn: string | null): Observable<Book | null> {
     return this.http
-      .get<BookRaw>(`https://api4.angular-buch.com/secure/book/${isbn}`)
+      .get<BookRaw>(``)
       .pipe(
         catchError(this.processError),
killedBy: BookStoreService  but without Testbed getBookFast() should call http GET with url and isbn and return this Book converted from BookRaw
statusReason: Expected spy httpStub.get to have been called only once, and with given args:
  [ 'https://api4.angular-buch.com/secure/book/123' ]
But the actual call was:
  [ '' ].
Expected $[0] = '' to equal 'https://api4.angular-buch.com/secure/book/123'.


Error: Expected spy httpStub.get to have been called only once, and with given args:

[Killed] StringLiteral
src/app/shared/book-store.service.ts:68:23
 
   getAll(): Observable<Book[]> {
     return this.http
-      .get<BookRaw[]>('https://api4.angular-buch.com/secure/books')
+      .get<BookRaw[]>("")
       .pipe(
         retry({ count: 3, delay: 1000 }),
killedBy: BookStoreService  with Testbed should call getAll() to get a book with isbn with 3 retries , if the first and second try fails; BookStoreService  but without Testbed getAll() should call http GET with url and return a Book array converted from BookRaw array
statusReason: Error: Expected one matching request for criteria "Match URL: https://api4.angular-buch.com/secure/books", found none. Requests received are: GET .

[Killed] ObjectLiteral
src/app/shared/book-store.service.ts:70:15
     return this.http
       .get<BookRaw[]>('https://api4.angular-buch.com/secure/books')
       .pipe(
-        retry({ count: 3, delay: 1000 }),
+        retry({}),
         catchError(this.processError),
         map((rawBooksArray: BookRaw[]): Book[] =>
killedBy: BookStoreService  with Testbed should call getAll() to get a book with isbn with 3 retries , but all retrials fail
statusReason: Error: Expected no open requests, found 1: GET https://api4.angular-buch.com/secure/books

[Killed] StringLiteral
src/app/shared/book-store.service.ts:82:9
   getAllSearch(text: string): Observable<Book[]> {
     return this.http
       .get<BookRaw[]>(
-        `https://api4.angular-buch.com/secure/books/search/${text}`
+        ``
       )
       .pipe(
killedBy: BookStoreService  with Testbed should call getAllSearch() to get a book with isbn with 3 retries , if the first and second try fails; BookStoreService  but without Testbed getAllSearch() should call http get with search string and return list of books
statusReason: Error: Expected one matching request for criteria "Match URL: https://api4.angular-buch.com/secure/books/search/searchstring", found none. Requests received are: GET .

[Killed] ArrowFunction
src/app/shared/book-store.service.ts:95:23
 
   private processError(err: HttpErrorResponse): Observable<any> {
     //console.error('Service HttpErrorResponse: ' + JSON.stringify(err));
-    return throwError(() => err);
+    return throwError(() => undefined);
   }
 }
killedBy: BookStoreService  with Testbed should call getBook() to get a book with isbn with 3 retries , but all 3 retries fails
statusReason: TypeError: Cannot read properties of undefined (reading 'status')
