[Killed] BlockStatement
app/books/shared/delay.directive.ts:18:45
 
   constructor() {}
 
-  ngOnChanges(changes: SimpleChanges): void {
-    const { bmDelay } = changes;
-    const delay = bmDelay.currentValue;
-    setTimeout(() => {
-      this.visibility = 'visible';
-    }, delay);
-  }
+  ngOnChanges(changes: SimpleChanges): void {}
 }
 
killedBy: DelayDirective ..delay 100ms   should create an instance of the parent test component with style.visiblity = hidden, after 10ms should change to visible ; DelayDirective ..delay undefined (same as 0ms!) ..  should create an instance of the parent test component with style.visiblity = hidden, after 10ms should change to visible 
statusReason: Expected 'hidden' to be 'visible'.

[Killed] BlockStatement
app/books/shared/delay.directive.ts:21:22
   ngOnChanges(changes: SimpleChanges): void {
     const { bmDelay } = changes;
     const delay = bmDelay.currentValue;
-    setTimeout(() => {
-      this.visibility = 'visible';
-    }, delay);
+    setTimeout(() => {}, delay);
   }
 }
killedBy: DelayDirective ..delay 100ms   should create an instance of the parent test component with style.visiblity = hidden, after 10ms should change to visible ; DelayDirective ..delay undefined (same as 0ms!) ..  should create an instance of the parent test component with style.visiblity = hidden, after 10ms should change to visible 
statusReason: Expected 'hidden' to be 'visible'.

[Killed] StringLiteral
app/books/shared/delay.directive.ts:22:25
     const { bmDelay } = changes;
     const delay = bmDelay.currentValue;
     setTimeout(() => {
-      this.visibility = 'visible';
+      this.visibility = "";
     }, delay);
   }
killedBy: DelayDirective ..delay 100ms   should create an instance of the parent test component with style.visiblity = hidden, after 10ms should change to visible ; DelayDirective ..delay undefined (same as 0ms!) ..  should create an instance of the parent test component with style.visiblity = hidden, after 10ms should change to visible 
statusReason: Expected '' to be 'visible'.
