[Survived] StringLiteral
books/store/book-entity/book-entity.actions.ts:8:3
 import { HttpErrorResponse } from '@angular/common/http';
 
 export const loadBookEntities = createAction(
-  '[BookEntity/API] Load BookEntities'
+  ""
 );
 export const loadBookEntitiesSuccess = createAction(

[Survived] StringLiteral
books/store/book-entity/book-entity.actions.ts:26:3
 );
 
 export const addBookEntity = createAction(
-  '[BookEntity/API] Add BookEntity',
+  "",
   props<{ bookEntity: BookEntity }>()
 );

[Survived] StringLiteral
books/store/book-entity/book-entity.actions.ts:35:3
   props<{ bookEntity: BookEntity }>()
 );
 export const upsertBookEntity = createAction(
-  '[BookEntity/API] Upsert BookEntity',
+  "",
   props<{ bookEntity: BookEntity }>()
 );

[Survived] StringLiteral
books/store/book-entity/book-entity.actions.ts:40:3
 );
 
 export const upsertBookEntitySuccess = createAction(
-  '[BookEntity/API] Upsert BookEntity Success',
+  "",
   props<{ bookEntity: BookEntity }>()
 );

[Survived] StringLiteral
books/store/book-entity/book-entity.actions.ts:50:3
 );
 
 export const upsertBookEntitys = createAction(
-  '[BookEntity/API] Upsert BookEntities',
+  "",
   props<{ bookEntitys: BookEntity[] }>()
 );

[Survived] StringLiteral
books/store/book-entity/book-entity.actions.ts:70:3
 );
 
 export const deleteBookEntitySuccess = createAction(
-  '[BookEntity/API] Delete BookEntity Success',
+  "",
   props<{ id: string }>()
 );

[Survived] StringLiteral
books/store/book-entity/book-entity.actions.ts:75:3
 );
 
 export const deleteBookEntitys = createAction(
-  '[BookEntity/API] Delete BookEntitys',
+  "",
   props<{ ids: string[] }>()
 );
