[NoCoverage] BlockStatement
books/store/book-entity/book-entity.selectors.ts:30:77
   };
 });
 
-export const selectCurrentBook = createSelector(selectBookState, (state) => {
-  if (!!state.currentBookId) {
-    return state?.entities[state.currentBookId];
-  } else return null;
-});
+export const selectCurrentBook = createSelector(selectBookState, (state) => {});
 
 export const selectCurrentBookAndAll = createSelector(

[NoCoverage] OptionalChaining
books/store/book-entity/book-entity.selectors.ts:32:12
 
 export const selectCurrentBook = createSelector(selectBookState, (state) => {
   if (!!state.currentBookId) {
-    return state?.entities[state.currentBookId];
+    return state.entities[state.currentBookId];
   } else return null;
 });

[NoCoverage] BlockStatement
books/store/book-entity/book-entity.selectors.ts:80:71
   }
 );
 
-export const selectError = createSelector(selectBookState, (state) => {
-  if (!!state?.httpError || !!state?.errorMessage)
-    return {
-      httpError: state.httpError,
-      errorMessage: state.errorMessage
-    };
-  else return {};
-});
+export const selectError = createSelector(selectBookState, (state) => {});
 

[NoCoverage] OptionalChaining
books/store/book-entity/book-entity.selectors.ts:81:9
 );
 
 export const selectError = createSelector(selectBookState, (state) => {
-  if (!!state?.httpError || !!state?.errorMessage)
+  if (!!state.httpError || !!state?.errorMessage)
     return {
       httpError: state.httpError,

[NoCoverage] BooleanLiteral
books/store/book-entity/book-entity.selectors.ts:81:7
 );
 
 export const selectError = createSelector(selectBookState, (state) => {
-  if (!!state?.httpError || !!state?.errorMessage)
+  if (!state?.httpError || !!state?.errorMessage)
     return {
       httpError: state.httpError,
