[Killed] StringLiteral
books/store/book-entity/book-entity.actions.ts:10:3
   '[BookEntity/API] Load BookEntities'
 );
 export const loadBookEntitiesSuccess = createAction(
-  '[BookEntity/API] Load BookEntities Success',
+  "",
   props<{ bookEntities: BookEntity[]; timeStamp: number }>()
 );
killedBy: BookEntityEffects  success case with BookService.getAllEntities  loadBooks$ should dispatch action loadBookEntitiesSuccess
statusReason: Expected '' to contain 'Load BookEntities Success'.

[Survived] StringLiteral
books/store/book-entity/book-entity.actions.ts:20:3
 );
 
 export const httpFailure = createAction(
-  '[BookEntity/API] HTTP Error Response',
+  "",
   props<{ httpError: HttpErrorResponse; timeStamp: number }>()
 );

[Killed] StringLiteral
books/store/book-entity/book-entity.actions.ts:62:3
   }>()
 );
 export const loadAllAndSetCurrentBook = createAction(
-  '[BookEntity/API] Load all and set Current Book',
+  "",
   props<{ isbn: string }>()
 );
killedBy: BookEntityEffects  success case with BookService.getAllEntities  reloadBooksAndSetCurrentBook$ should dispatch action loadBookEntitiesSuccess
statusReason: Expected '' to contain 'Load all and set Current Book'.
