[Killed] ConditionalExpression
books/store/book-entity/book-entity.effects.ts:49:54
       switchMap((action) =>
         this.bs.getAllEntities().pipe(
           map((books: BookEntity[]) => {
-            const currentBook = books.find((book) => book.isbn == action.isbn);
+            const currentBook = books.find((book) => false);
             return loadAllAndSetCurrentBookSuccess({
               books,
killedBy: BookEntityEffects  success case with BookService.getAllEntities  reloadBooksAndSetCurrentBook$ should dispatch action loadBookEntitiesSuccess
statusReason: Expected undefined to equal '123-0'.

[Killed] EqualityOperator
books/store/book-entity/book-entity.effects.ts:49:54
       switchMap((action) =>
         this.bs.getAllEntities().pipe(
           map((books: BookEntity[]) => {
-            const currentBook = books.find((book) => book.isbn == action.isbn);
+            const currentBook = books.find((book) => book.isbn != action.isbn);
             return loadAllAndSetCurrentBookSuccess({
               books,
killedBy: BookEntityEffects  success case with BookService.getAllEntities  reloadBooksAndSetCurrentBook$ should dispatch action loadBookEntitiesSuccess
statusReason: Expected undefined to equal '123-0'.
