[Survived] BooleanLiteral
books/store/book-entity/book-entity.reducer.ts:30:20
   currentBookId: undefined,
   httpError: null,
   errorMessage: null,
-  showSaveSuccess: false,
+  showSaveSuccess: true,
   searchResults: [],
   lastUpdateTS: 0

[Killed] BooleanLiteral
books/store/book-entity/book-entity.reducer.ts:39:29
   initialBookEntityState,
   on(BookEntityActions.addBookEntitySuccess, (state, action) => {
     state = adapter.addOne(action.bookEntity, state);
-    state.showSaveSuccess = true;
+    state.showSaveSuccess = false;
     return state;
   }),
killedBy: BookEntity Reducer addBookEntitySuccess action should return the previous state
statusReason: Expected $.showSaveSuccess = false to equal true.

[Killed] BooleanLiteral
books/store/book-entity/book-entity.reducer.ts:45:24
   on(BookEntityActions.addBookEntity, (state, action): BookEntityState => {
     return {
       ...state,
-      showSaveSuccess: false
+      showSaveSuccess: true
     };
   }),
killedBy: BookEntity Reducer action...  addBookEntity  should return  state with showSaveSuccess: false
statusReason: Expected $.showSaveSuccess = true to equal false.

[Killed] BooleanLiteral
books/store/book-entity/book-entity.reducer.ts:50:29
   }),
   on(BookEntityActions.upsertBookEntitySuccess, (state, action) => {
     state = adapter.upsertOne(action.bookEntity, state);
-    state.showSaveSuccess = true;
+    state.showSaveSuccess = false;
     return state;
   }),
killedBy: BookEntity Reducer upsertBookEntitySuccess action should return state with changed book and showSaveSuccess flag set
statusReason: Expected $.showSaveSuccess = false to equal true.

[Killed] BooleanLiteral
books/store/book-entity/book-entity.reducer.ts:54:41
     return state;
   }),
   on(BookEntityActions.upsertBookEntity, (state, action) => {
-    return { ...state, showSaveSuccess: false };
+    return { ...state, showSaveSuccess: true };
   }),
   on(BookEntityActions.deleteBookEntity, (state, action) => {
killedBy: BookEntity Reducer action...  upsertBookEntity  should return  state with showSaveSuccess: false
statusReason: Expected $.showSaveSuccess = true to equal false.

[Killed] BooleanLiteral
books/store/book-entity/book-entity.reducer.ts:57:41
     return { ...state, showSaveSuccess: false };
   }),
   on(BookEntityActions.deleteBookEntity, (state, action) => {
-    return { ...state, showSaveSuccess: false };
+    return { ...state, showSaveSuccess: true };
   }),
 
killedBy: BookEntity Reducer action...  deleteBookEntity should return  state with showSaveSuccess: false
statusReason: Expected $.showSaveSuccess = true to equal false.

[Killed] BooleanLiteral
books/store/book-entity/book-entity.reducer.ts:62:29
 
   on(BookEntityActions.deleteBookEntitySuccess, (state, action) => {
     state = adapter.removeOne(action.id, state);
-    state.showSaveSuccess = true;
+    state.showSaveSuccess = false;
     return state;
   }),
killedBy: BookEntity Reducer deleteBookEntitySuccess action should return  state without the specific book
statusReason: Expected $.showSaveSuccess = false to equal true.
