[Killed] ArrowFunction
books/store/book-entity/book-entity.selectors.ts:14:62
   fromBook.bookEntitiesFeatureKey
 );
 
-export const selectBookIds = createSelector(selectBookState, (state) =>
-  selectIds(state)
+export const selectBookIds = createSelector(selectBookState, () => undefined
 );
 
killedBy: BookEntity selectors should return the book ids
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
books/store/book-entity/book-entity.selectors.ts:26:77
   };
 });
 
-export const selectCurrentBook = createSelector(selectBookState, (state) => {
-  if (!!state.currentBookId) {
-    return state.entities[state.currentBookId];
-  } else return null;
-});
+export const selectCurrentBook = createSelector(selectBookState, (state) => {});
 
 export const selectCurrentBookAndAll = createSelector(
killedBy: BookEntity selectors selectCurrentBook should select  CurrentBook
statusReason: Expected undefined to equal Object({ isbn: '123-0', title: 'Title 0', description: 'Description 0', rating: 1, published: Date(Sat Feb 02 2002 01:00:00 GMT+0100 (Central European Standard Time)), authors: [ 'author1' ] }).

[Killed] BlockStatement
books/store/book-entity/book-entity.selectors.ts:52:76
   }
 );
 
-export const selectTotalBooks = createSelector(selectBookState, (state) => {
-  return selectTotal(state);
-});
+export const selectTotalBooks = createSelector(selectBookState, (state) => {});
 export const selectAllBookEntities = createSelector(
   selectBookState,
killedBy: BookEntity selectors selectTotalBooks should select TotalBooks
statusReason: Expected undefined to equal 2.

[Killed] BlockStatement
books/store/book-entity/book-entity.selectors.ts:57:14
 });
 export const selectAllBookEntities = createSelector(
   selectBookState,
-  (state) => {
-    return selectAll(state);
-  }
+  (state) => {}
 );
 
killedBy: BookEntity selectors selectAllBooksEntities should select all books

[Killed] BlockStatement
books/store/book-entity/book-entity.selectors.ts:71:71
   };
 });
 
-export const selectError = createSelector(selectBookState, (state) => {
-  if (!!state.httpError || !!state.errorMessage)
-    return {
-      httpError: state.httpError,
-      errorMessage: state.errorMessage
-    };
-  else return {};
-});
+export const selectError = createSelector(selectBookState, (state) => {});
 
killedBy: BookEntity selectors selectErrors should select ErrorState

[Killed] LogicalOperator
books/store/book-entity/book-entity.selectors.ts:72:7
 });
 
 export const selectError = createSelector(selectBookState, (state) => {
-  if (!!state.httpError || !!state.errorMessage)
+  if (!!state.httpError && !!state.errorMessage)
     return {
       httpError: state.httpError,
killedBy: BookEntity selectors selectErrors should select ErrorState
statusReason: Expected object to have properties
    httpError: HttpErrorResponse({ headers: HttpHeaders({ normalizedNames: Map(  ), lazyUpdate: null, headers: Map(  ) }), status: 404, statusText: 'Unknown Error', url: null, ok: false, name: 'HttpErrorResponse', message: 'Http failure response for (unknown url): 404 undefined', error: null })
    errorMessage: null

[Killed] ConditionalExpression
books/store/book-entity/book-entity.selectors.ts:72:7
 });
 
 export const selectError = createSelector(selectBookState, (state) => {
-  if (!!state.httpError || !!state.errorMessage)
+  if (false)
     return {
       httpError: state.httpError,
killedBy: BookEntity selectors selectErrors should select ErrorState
statusReason: Expected object to have properties
    httpError: HttpErrorResponse({ headers: HttpHeaders({ normalizedNames: Map(  ), lazyUpdate: null, headers: Map(  ) }), status: 404, statusText: 'Unknown Error', url: null, ok: false, name: 'HttpErrorResponse', message: 'Http failure response for (unknown url): 404 undefined', error: null })
    errorMessage: 'the message'
